Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x20fb (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 43 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x2efd2): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -Og -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0xac060): ../Core/Src/main.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x2ac60): /home/lth/src/stm32fun/stm32world_freertos/Debug
    <1a>   DW_AT_ranges      : 0x27
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 16 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 4	(float)
    <2d>   DW_AT_name        : (indirect string, offset: 0xe94c): float
 <1><31>: Abbrev Number: 16 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 1
    <33>   DW_AT_encoding    : 6	(signed char)
    <34>   DW_AT_name        : (indirect string, offset: 0x60bc8): signed char
 <1><38>: Abbrev Number: 6 (DW_TAG_typedef)
    <39>   DW_AT_name        : (indirect string, offset: 0x386bf): __uint8_t
    <3d>   DW_AT_decl_file   : 3
    <3e>   DW_AT_decl_line   : 43
    <3f>   DW_AT_decl_column : 24
    <40>   DW_AT_type        : <0x44>
 <1><44>: Abbrev Number: 16 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 1
    <46>   DW_AT_encoding    : 8	(unsigned char)
    <47>   DW_AT_name        : (indirect string, offset: 0xbab45): unsigned char
 <1><4b>: Abbrev Number: 16 (DW_TAG_base_type)
    <4c>   DW_AT_byte_size   : 2
    <4d>   DW_AT_encoding    : 5	(signed)
    <4e>   DW_AT_name        : (indirect string, offset: 0x8fbc3): short int
 <1><52>: Abbrev Number: 6 (DW_TAG_typedef)
    <53>   DW_AT_name        : (indirect string, offset: 0x9d9df): __uint16_t
    <57>   DW_AT_decl_file   : 3
    <58>   DW_AT_decl_line   : 57
    <59>   DW_AT_decl_column : 25
    <5a>   DW_AT_type        : <0x5e>
 <1><5e>: Abbrev Number: 16 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 2
    <60>   DW_AT_encoding    : 7	(unsigned)
    <61>   DW_AT_name        : (indirect string, offset: 0xb9401): short unsigned int
 <1><65>: Abbrev Number: 16 (DW_TAG_base_type)
    <66>   DW_AT_byte_size   : 4
    <67>   DW_AT_encoding    : 5	(signed)
    <68>   DW_AT_name        : (indirect string, offset: 0x1006e): long int
 <1><6c>: Abbrev Number: 6 (DW_TAG_typedef)
    <6d>   DW_AT_name        : (indirect string, offset: 0x7ab49): __uint32_t
    <71>   DW_AT_decl_file   : 3
    <72>   DW_AT_decl_line   : 79
    <73>   DW_AT_decl_column : 25
    <74>   DW_AT_type        : <0x78>
 <1><78>: Abbrev Number: 16 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 4
    <7a>   DW_AT_encoding    : 7	(unsigned)
    <7b>   DW_AT_name        : (indirect string, offset: 0x4a2aa): long unsigned int
 <1><7f>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <80>   DW_AT_type        : <0x78>
 <1><84>: Abbrev Number: 16 (DW_TAG_base_type)
    <85>   DW_AT_byte_size   : 8
    <86>   DW_AT_encoding    : 5	(signed)
    <87>   DW_AT_name        : (indirect string, offset: 0x58204): long long int
 <1><8b>: Abbrev Number: 16 (DW_TAG_base_type)
    <8c>   DW_AT_byte_size   : 8
    <8d>   DW_AT_encoding    : 7	(unsigned)
    <8e>   DW_AT_name        : (indirect string, offset: 0x28de8): long long unsigned int
 <1><92>: Abbrev Number: 44 (DW_TAG_base_type)
    <93>   DW_AT_byte_size   : 4
    <94>   DW_AT_encoding    : 5	(signed)
    <95>   DW_AT_name        : int
 <1><99>: Abbrev Number: 16 (DW_TAG_base_type)
    <9a>   DW_AT_byte_size   : 4
    <9b>   DW_AT_encoding    : 7	(unsigned)
    <9c>   DW_AT_name        : (indirect string, offset: 0xf775): unsigned int
 <1><a0>: Abbrev Number: 6 (DW_TAG_typedef)
    <a1>   DW_AT_name        : (indirect string, offset: 0x386c1): uint8_t
    <a5>   DW_AT_decl_file   : 4
    <a6>   DW_AT_decl_line   : 24
    <a7>   DW_AT_decl_column : 19
    <a8>   DW_AT_type        : <0x38>
 <1><ac>: Abbrev Number: 18 (DW_TAG_const_type)
    <ad>   DW_AT_type        : <0xa0>
 <1><b1>: Abbrev Number: 6 (DW_TAG_typedef)
    <b2>   DW_AT_name        : (indirect string, offset: 0x8c88b): uint16_t
    <b6>   DW_AT_decl_file   : 4
    <b7>   DW_AT_decl_line   : 36
    <b8>   DW_AT_decl_column : 20
    <b9>   DW_AT_type        : <0x52>
 <1><bd>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <be>   DW_AT_type        : <0xb1>
 <1><c2>: Abbrev Number: 6 (DW_TAG_typedef)
    <c3>   DW_AT_name        : (indirect string, offset: 0xa2434): uint32_t
    <c7>   DW_AT_decl_file   : 4
    <c8>   DW_AT_decl_line   : 48
    <c9>   DW_AT_decl_column : 20
    <ca>   DW_AT_type        : <0x6c>
 <1><ce>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <cf>   DW_AT_type        : <0xc2>
 <1><d3>: Abbrev Number: 26 (DW_TAG_array_type)
    <d4>   DW_AT_type        : <0xc2>
    <d8>   DW_AT_sibling     : <0xe3>
 <2><dc>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <dd>   DW_AT_type        : <0x99>
    <e1>   DW_AT_upper_bound : 1
 <2><e2>: Abbrev Number: 0
 <1><e3>: Abbrev Number: 19 (DW_TAG_structure_type)
    <e4>   DW_AT_byte_size   : 24
    <e5>   DW_AT_decl_file   : 5
    <e6>   DW_AT_decl_line   : 324
    <e8>   DW_AT_decl_column : 9
    <e8>   DW_AT_sibling     : <0x13a>
 <2><ec>: Abbrev Number: 9 (DW_TAG_member)
    <ed>   DW_AT_name        : CR
    <f0>   DW_AT_decl_file   : 5
    <f0>   DW_AT_decl_line   : 326
    <f2>   DW_AT_decl_column : 17
    <f2>   DW_AT_type        : <0xce>
    <f6>   DW_AT_data_member_location: 0
 <2><f7>: Abbrev Number: 4 (DW_TAG_member)
    <f8>   DW_AT_name        : (indirect string, offset: 0x16a18): NDTR
    <fc>   DW_AT_decl_file   : 5
    <fd>   DW_AT_decl_line   : 327
    <ff>   DW_AT_decl_column : 17
    <100>   DW_AT_type        : <0xce>
    <104>   DW_AT_data_member_location: 4
 <2><105>: Abbrev Number: 9 (DW_TAG_member)
    <106>   DW_AT_name        : PAR
    <10a>   DW_AT_decl_file   : 5
    <10a>   DW_AT_decl_line   : 328
    <10c>   DW_AT_decl_column : 17
    <10c>   DW_AT_type        : <0xce>
    <110>   DW_AT_data_member_location: 8
 <2><111>: Abbrev Number: 4 (DW_TAG_member)
    <112>   DW_AT_name        : (indirect string, offset: 0x5062c): M0AR
    <116>   DW_AT_decl_file   : 5
    <117>   DW_AT_decl_line   : 329
    <119>   DW_AT_decl_column : 17
    <11a>   DW_AT_type        : <0xce>
    <11e>   DW_AT_data_member_location: 12
 <2><11f>: Abbrev Number: 4 (DW_TAG_member)
    <120>   DW_AT_name        : (indirect string, offset: 0x6ab44): M1AR
    <124>   DW_AT_decl_file   : 5
    <125>   DW_AT_decl_line   : 330
    <127>   DW_AT_decl_column : 17
    <128>   DW_AT_type        : <0xce>
    <12c>   DW_AT_data_member_location: 16
 <2><12d>: Abbrev Number: 9 (DW_TAG_member)
    <12e>   DW_AT_name        : FCR
    <132>   DW_AT_decl_file   : 5
    <132>   DW_AT_decl_line   : 331
    <134>   DW_AT_decl_column : 17
    <134>   DW_AT_type        : <0xce>
    <138>   DW_AT_data_member_location: 20
 <2><139>: Abbrev Number: 0
 <1><13a>: Abbrev Number: 15 (DW_TAG_typedef)
    <13b>   DW_AT_name        : (indirect string, offset: 0xaf7ee): DMA_Stream_TypeDef
    <13f>   DW_AT_decl_file   : 5
    <140>   DW_AT_decl_line   : 332
    <142>   DW_AT_decl_column : 3
    <142>   DW_AT_type        : <0xe3>
 <1><146>: Abbrev Number: 19 (DW_TAG_structure_type)
    <147>   DW_AT_byte_size   : 40
    <148>   DW_AT_decl_file   : 5
    <149>   DW_AT_decl_line   : 430
    <14b>   DW_AT_decl_column : 9
    <14b>   DW_AT_sibling     : <0x1c8>
 <2><14f>: Abbrev Number: 4 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0x7d44e): MODER
    <154>   DW_AT_decl_file   : 5
    <155>   DW_AT_decl_line   : 432
    <157>   DW_AT_decl_column : 17
    <158>   DW_AT_type        : <0xce>
    <15c>   DW_AT_data_member_location: 0
 <2><15d>: Abbrev Number: 4 (DW_TAG_member)
    <15e>   DW_AT_name        : (indirect string, offset: 0x956c4): OTYPER
    <162>   DW_AT_decl_file   : 5
    <163>   DW_AT_decl_line   : 433
    <165>   DW_AT_decl_column : 17
    <166>   DW_AT_type        : <0xce>
    <16a>   DW_AT_data_member_location: 4
 <2><16b>: Abbrev Number: 4 (DW_TAG_member)
    <16c>   DW_AT_name        : (indirect string, offset: 0xa7e6a): OSPEEDR
    <170>   DW_AT_decl_file   : 5
    <171>   DW_AT_decl_line   : 434
    <173>   DW_AT_decl_column : 17
    <174>   DW_AT_type        : <0xce>
    <178>   DW_AT_data_member_location: 8
 <2><179>: Abbrev Number: 4 (DW_TAG_member)
    <17a>   DW_AT_name        : (indirect string, offset: 0x6f94d): PUPDR
    <17e>   DW_AT_decl_file   : 5
    <17f>   DW_AT_decl_line   : 435
    <181>   DW_AT_decl_column : 17
    <182>   DW_AT_type        : <0xce>
    <186>   DW_AT_data_member_location: 12
 <2><187>: Abbrev Number: 9 (DW_TAG_member)
    <188>   DW_AT_name        : IDR
    <18c>   DW_AT_decl_file   : 5
    <18c>   DW_AT_decl_line   : 436
    <18e>   DW_AT_decl_column : 17
    <18e>   DW_AT_type        : <0xce>
    <192>   DW_AT_data_member_location: 16
 <2><193>: Abbrev Number: 9 (DW_TAG_member)
    <194>   DW_AT_name        : ODR
    <198>   DW_AT_decl_file   : 5
    <198>   DW_AT_decl_line   : 437
    <19a>   DW_AT_decl_column : 17
    <19a>   DW_AT_type        : <0xce>
    <19e>   DW_AT_data_member_location: 20
 <2><19f>: Abbrev Number: 4 (DW_TAG_member)
    <1a0>   DW_AT_name        : (indirect string, offset: 0x2bfc1): BSRR
    <1a4>   DW_AT_decl_file   : 5
    <1a5>   DW_AT_decl_line   : 438
    <1a7>   DW_AT_decl_column : 17
    <1a8>   DW_AT_type        : <0xce>
    <1ac>   DW_AT_data_member_location: 24
 <2><1ad>: Abbrev Number: 4 (DW_TAG_member)
    <1ae>   DW_AT_name        : (indirect string, offset: 0xa5676): LCKR
    <1b2>   DW_AT_decl_file   : 5
    <1b3>   DW_AT_decl_line   : 439
    <1b5>   DW_AT_decl_column : 17
    <1b6>   DW_AT_type        : <0xce>
    <1ba>   DW_AT_data_member_location: 28
 <2><1bb>: Abbrev Number: 9 (DW_TAG_member)
    <1bc>   DW_AT_name        : AFR
    <1c0>   DW_AT_decl_file   : 5
    <1c0>   DW_AT_decl_line   : 440
    <1c2>   DW_AT_decl_column : 17
    <1c2>   DW_AT_type        : <0x1d8>
    <1c6>   DW_AT_data_member_location: 32
 <2><1c7>: Abbrev Number: 0
 <1><1c8>: Abbrev Number: 26 (DW_TAG_array_type)
    <1c9>   DW_AT_type        : <0xce>
    <1cd>   DW_AT_sibling     : <0x1d8>
 <2><1d1>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <1d2>   DW_AT_type        : <0x99>
    <1d6>   DW_AT_upper_bound : 1
 <2><1d7>: Abbrev Number: 0
 <1><1d8>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <1d9>   DW_AT_type        : <0x1c8>
 <1><1dd>: Abbrev Number: 15 (DW_TAG_typedef)
    <1de>   DW_AT_name        : (indirect string, offset: 0xbbb8a): GPIO_TypeDef
    <1e2>   DW_AT_decl_file   : 5
    <1e3>   DW_AT_decl_line   : 441
    <1e5>   DW_AT_decl_column : 3
    <1e5>   DW_AT_type        : <0x146>
 <1><1e9>: Abbrev Number: 19 (DW_TAG_structure_type)
    <1ea>   DW_AT_byte_size   : 8
    <1eb>   DW_AT_decl_file   : 5
    <1ec>   DW_AT_decl_line   : 490
    <1ee>   DW_AT_decl_column : 9
    <1ee>   DW_AT_sibling     : <0x20a>
 <2><1f2>: Abbrev Number: 9 (DW_TAG_member)
    <1f3>   DW_AT_name        : CR
    <1f6>   DW_AT_decl_file   : 5
    <1f6>   DW_AT_decl_line   : 492
    <1f8>   DW_AT_decl_column : 17
    <1f8>   DW_AT_type        : <0xce>
    <1fc>   DW_AT_data_member_location: 0
 <2><1fd>: Abbrev Number: 9 (DW_TAG_member)
    <1fe>   DW_AT_name        : CSR
    <202>   DW_AT_decl_file   : 5
    <202>   DW_AT_decl_line   : 493
    <204>   DW_AT_decl_column : 17
    <204>   DW_AT_type        : <0xce>
    <208>   DW_AT_data_member_location: 4
 <2><209>: Abbrev Number: 0
 <1><20a>: Abbrev Number: 15 (DW_TAG_typedef)
    <20b>   DW_AT_name        : (indirect string, offset: 0x8b3ab): PWR_TypeDef
    <20f>   DW_AT_decl_file   : 5
    <210>   DW_AT_decl_line   : 494
    <212>   DW_AT_decl_column : 3
    <212>   DW_AT_type        : <0x1e9>
 <1><216>: Abbrev Number: 19 (DW_TAG_structure_type)
    <217>   DW_AT_byte_size   : 136
    <218>   DW_AT_decl_file   : 5
    <219>   DW_AT_decl_line   : 500
    <21b>   DW_AT_decl_column : 9
    <21b>   DW_AT_sibling     : <0x3bd>
 <2><21f>: Abbrev Number: 9 (DW_TAG_member)
    <220>   DW_AT_name        : CR
    <223>   DW_AT_decl_file   : 5
    <223>   DW_AT_decl_line   : 502
    <225>   DW_AT_decl_column : 17
    <225>   DW_AT_type        : <0xce>
    <229>   DW_AT_data_member_location: 0
 <2><22a>: Abbrev Number: 4 (DW_TAG_member)
    <22b>   DW_AT_name        : (indirect string, offset: 0x86d66): PLLCFGR
    <22f>   DW_AT_decl_file   : 5
    <230>   DW_AT_decl_line   : 503
    <232>   DW_AT_decl_column : 17
    <233>   DW_AT_type        : <0xce>
    <237>   DW_AT_data_member_location: 4
 <2><238>: Abbrev Number: 4 (DW_TAG_member)
    <239>   DW_AT_name        : (indirect string, offset: 0x86d69): CFGR
    <23d>   DW_AT_decl_file   : 5
    <23e>   DW_AT_decl_line   : 504
    <240>   DW_AT_decl_column : 17
    <241>   DW_AT_type        : <0xce>
    <245>   DW_AT_data_member_location: 8
 <2><246>: Abbrev Number: 9 (DW_TAG_member)
    <247>   DW_AT_name        : CIR
    <24b>   DW_AT_decl_file   : 5
    <24b>   DW_AT_decl_line   : 505
    <24d>   DW_AT_decl_column : 17
    <24d>   DW_AT_type        : <0xce>
    <251>   DW_AT_data_member_location: 12
 <2><252>: Abbrev Number: 4 (DW_TAG_member)
    <253>   DW_AT_name        : (indirect string, offset: 0x99ae9): AHB1RSTR
    <257>   DW_AT_decl_file   : 5
    <258>   DW_AT_decl_line   : 506
    <25a>   DW_AT_decl_column : 17
    <25b>   DW_AT_type        : <0xce>
    <25f>   DW_AT_data_member_location: 16
 <2><260>: Abbrev Number: 4 (DW_TAG_member)
    <261>   DW_AT_name        : (indirect string, offset: 0x16171): AHB2RSTR
    <265>   DW_AT_decl_file   : 5
    <266>   DW_AT_decl_line   : 507
    <268>   DW_AT_decl_column : 17
    <269>   DW_AT_type        : <0xce>
    <26d>   DW_AT_data_member_location: 20
 <2><26e>: Abbrev Number: 4 (DW_TAG_member)
    <26f>   DW_AT_name        : (indirect string, offset: 0x3fe3c): AHB3RSTR
    <273>   DW_AT_decl_file   : 5
    <274>   DW_AT_decl_line   : 508
    <276>   DW_AT_decl_column : 17
    <277>   DW_AT_type        : <0xce>
    <27b>   DW_AT_data_member_location: 24
 <2><27c>: Abbrev Number: 4 (DW_TAG_member)
    <27d>   DW_AT_name        : (indirect string, offset: 0xb660f): RESERVED0
    <281>   DW_AT_decl_file   : 5
    <282>   DW_AT_decl_line   : 509
    <284>   DW_AT_decl_column : 17
    <285>   DW_AT_type        : <0xc2>
    <289>   DW_AT_data_member_location: 28
 <2><28a>: Abbrev Number: 4 (DW_TAG_member)
    <28b>   DW_AT_name        : (indirect string, offset: 0x15c22): APB1RSTR
    <28f>   DW_AT_decl_file   : 5
    <290>   DW_AT_decl_line   : 510
    <292>   DW_AT_decl_column : 17
    <293>   DW_AT_type        : <0xce>
    <297>   DW_AT_data_member_location: 32
 <2><298>: Abbrev Number: 4 (DW_TAG_member)
    <299>   DW_AT_name        : (indirect string, offset: 0x53df6): APB2RSTR
    <29d>   DW_AT_decl_file   : 5
    <29e>   DW_AT_decl_line   : 511
    <2a0>   DW_AT_decl_column : 17
    <2a1>   DW_AT_type        : <0xce>
    <2a5>   DW_AT_data_member_location: 36
 <2><2a6>: Abbrev Number: 4 (DW_TAG_member)
    <2a7>   DW_AT_name        : (indirect string, offset: 0xb6619): RESERVED1
    <2ab>   DW_AT_decl_file   : 5
    <2ac>   DW_AT_decl_line   : 512
    <2ae>   DW_AT_decl_column : 17
    <2af>   DW_AT_type        : <0xd3>
    <2b3>   DW_AT_data_member_location: 40
 <2><2b4>: Abbrev Number: 4 (DW_TAG_member)
    <2b5>   DW_AT_name        : (indirect string, offset: 0xf70a): AHB1ENR
    <2b9>   DW_AT_decl_file   : 5
    <2ba>   DW_AT_decl_line   : 513
    <2bc>   DW_AT_decl_column : 17
    <2bd>   DW_AT_type        : <0xce>
    <2c1>   DW_AT_data_member_location: 48
 <2><2c2>: Abbrev Number: 4 (DW_TAG_member)
    <2c3>   DW_AT_name        : (indirect string, offset: 0x33b29): AHB2ENR
    <2c7>   DW_AT_decl_file   : 5
    <2c8>   DW_AT_decl_line   : 514
    <2ca>   DW_AT_decl_column : 17
    <2cb>   DW_AT_type        : <0xce>
    <2cf>   DW_AT_data_member_location: 52
 <2><2d0>: Abbrev Number: 4 (DW_TAG_member)
    <2d1>   DW_AT_name        : (indirect string, offset: 0x56b36): AHB3ENR
    <2d5>   DW_AT_decl_file   : 5
    <2d6>   DW_AT_decl_line   : 515
    <2d8>   DW_AT_decl_column : 17
    <2d9>   DW_AT_type        : <0xce>
    <2dd>   DW_AT_data_member_location: 56
 <2><2de>: Abbrev Number: 4 (DW_TAG_member)
    <2df>   DW_AT_name        : (indirect string, offset: 0xb6623): RESERVED2
    <2e3>   DW_AT_decl_file   : 5
    <2e4>   DW_AT_decl_line   : 516
    <2e6>   DW_AT_decl_column : 17
    <2e7>   DW_AT_type        : <0xc2>
    <2eb>   DW_AT_data_member_location: 60
 <2><2ec>: Abbrev Number: 4 (DW_TAG_member)
    <2ed>   DW_AT_name        : (indirect string, offset: 0x6eab4): APB1ENR
    <2f1>   DW_AT_decl_file   : 5
    <2f2>   DW_AT_decl_line   : 517
    <2f4>   DW_AT_decl_column : 17
    <2f5>   DW_AT_type        : <0xce>
    <2f9>   DW_AT_data_member_location: 64
 <2><2fa>: Abbrev Number: 4 (DW_TAG_member)
    <2fb>   DW_AT_name        : (indirect string, offset: 0x5d411): APB2ENR
    <2ff>   DW_AT_decl_file   : 5
    <300>   DW_AT_decl_line   : 518
    <302>   DW_AT_decl_column : 17
    <303>   DW_AT_type        : <0xce>
    <307>   DW_AT_data_member_location: 68
 <2><308>: Abbrev Number: 4 (DW_TAG_member)
    <309>   DW_AT_name        : (indirect string, offset: 0xb662d): RESERVED3
    <30d>   DW_AT_decl_file   : 5
    <30e>   DW_AT_decl_line   : 519
    <310>   DW_AT_decl_column : 17
    <311>   DW_AT_type        : <0xd3>
    <315>   DW_AT_data_member_location: 72
 <2><316>: Abbrev Number: 4 (DW_TAG_member)
    <317>   DW_AT_name        : (indirect string, offset: 0x9d864): AHB1LPENR
    <31b>   DW_AT_decl_file   : 5
    <31c>   DW_AT_decl_line   : 520
    <31e>   DW_AT_decl_column : 17
    <31f>   DW_AT_type        : <0xce>
    <323>   DW_AT_data_member_location: 80
 <2><324>: Abbrev Number: 4 (DW_TAG_member)
    <325>   DW_AT_name        : (indirect string, offset: 0x2bc34): AHB2LPENR
    <329>   DW_AT_decl_file   : 5
    <32a>   DW_AT_decl_line   : 521
    <32c>   DW_AT_decl_column : 17
    <32d>   DW_AT_type        : <0xce>
    <331>   DW_AT_data_member_location: 84
 <2><332>: Abbrev Number: 4 (DW_TAG_member)
    <333>   DW_AT_name        : (indirect string, offset: 0x8230a): AHB3LPENR
    <337>   DW_AT_decl_file   : 5
    <338>   DW_AT_decl_line   : 522
    <33a>   DW_AT_decl_column : 17
    <33b>   DW_AT_type        : <0xce>
    <33f>   DW_AT_data_member_location: 88
 <2><340>: Abbrev Number: 4 (DW_TAG_member)
    <341>   DW_AT_name        : (indirect string, offset: 0xb6637): RESERVED4
    <345>   DW_AT_decl_file   : 5
    <346>   DW_AT_decl_line   : 523
    <348>   DW_AT_decl_column : 17
    <349>   DW_AT_type        : <0xc2>
    <34d>   DW_AT_data_member_location: 92
 <2><34e>: Abbrev Number: 4 (DW_TAG_member)
    <34f>   DW_AT_name        : (indirect string, offset: 0xa210d): APB1LPENR
    <353>   DW_AT_decl_file   : 5
    <354>   DW_AT_decl_line   : 524
    <356>   DW_AT_decl_column : 17
    <357>   DW_AT_type        : <0xce>
    <35b>   DW_AT_data_member_location: 96
 <2><35c>: Abbrev Number: 4 (DW_TAG_member)
    <35d>   DW_AT_name        : (indirect string, offset: 0x31838): APB2LPENR
    <361>   DW_AT_decl_file   : 5
    <362>   DW_AT_decl_line   : 525
    <364>   DW_AT_decl_column : 17
    <365>   DW_AT_type        : <0xce>
    <369>   DW_AT_data_member_location: 100
 <2><36a>: Abbrev Number: 4 (DW_TAG_member)
    <36b>   DW_AT_name        : (indirect string, offset: 0xb6641): RESERVED5
    <36f>   DW_AT_decl_file   : 5
    <370>   DW_AT_decl_line   : 526
    <372>   DW_AT_decl_column : 17
    <373>   DW_AT_type        : <0xd3>
    <377>   DW_AT_data_member_location: 104
 <2><378>: Abbrev Number: 4 (DW_TAG_member)
    <379>   DW_AT_name        : (indirect string, offset: 0x1b4b5): BDCR
    <37d>   DW_AT_decl_file   : 5
    <37e>   DW_AT_decl_line   : 527
    <380>   DW_AT_decl_column : 17
    <381>   DW_AT_type        : <0xce>
    <385>   DW_AT_data_member_location: 112
 <2><386>: Abbrev Number: 9 (DW_TAG_member)
    <387>   DW_AT_name        : CSR
    <38b>   DW_AT_decl_file   : 5
    <38b>   DW_AT_decl_line   : 528
    <38d>   DW_AT_decl_column : 17
    <38d>   DW_AT_type        : <0xce>
    <391>   DW_AT_data_member_location: 116
 <2><392>: Abbrev Number: 4 (DW_TAG_member)
    <393>   DW_AT_name        : (indirect string, offset: 0x72f8b): RESERVED6
    <397>   DW_AT_decl_file   : 5
    <398>   DW_AT_decl_line   : 529
    <39a>   DW_AT_decl_column : 17
    <39b>   DW_AT_type        : <0xd3>
    <39f>   DW_AT_data_member_location: 120
 <2><3a0>: Abbrev Number: 4 (DW_TAG_member)
    <3a1>   DW_AT_name        : (indirect string, offset: 0x66283): SSCGR
    <3a5>   DW_AT_decl_file   : 5
    <3a6>   DW_AT_decl_line   : 530
    <3a8>   DW_AT_decl_column : 17
    <3a9>   DW_AT_type        : <0xce>
    <3ad>   DW_AT_data_member_location: 128
 <2><3ae>: Abbrev Number: 4 (DW_TAG_member)
    <3af>   DW_AT_name        : (indirect string, offset: 0x4084d): PLLI2SCFGR
    <3b3>   DW_AT_decl_file   : 5
    <3b4>   DW_AT_decl_line   : 531
    <3b6>   DW_AT_decl_column : 17
    <3b7>   DW_AT_type        : <0xce>
    <3bb>   DW_AT_data_member_location: 132
 <2><3bc>: Abbrev Number: 0
 <1><3bd>: Abbrev Number: 15 (DW_TAG_typedef)
    <3be>   DW_AT_name        : (indirect string, offset: 0x5964b): RCC_TypeDef
    <3c2>   DW_AT_decl_file   : 5
    <3c3>   DW_AT_decl_line   : 532
    <3c5>   DW_AT_decl_column : 3
    <3c5>   DW_AT_type        : <0x216>
 <1><3c9>: Abbrev Number: 19 (DW_TAG_structure_type)
    <3ca>   DW_AT_byte_size   : 84
    <3cb>   DW_AT_decl_file   : 5
    <3cc>   DW_AT_decl_line   : 632
    <3ce>   DW_AT_decl_column : 9
    <3ce>   DW_AT_sibling     : <0x4e3>
 <2><3d2>: Abbrev Number: 9 (DW_TAG_member)
    <3d3>   DW_AT_name        : CR1
    <3d7>   DW_AT_decl_file   : 5
    <3d7>   DW_AT_decl_line   : 634
    <3d9>   DW_AT_decl_column : 17
    <3d9>   DW_AT_type        : <0xce>
    <3dd>   DW_AT_data_member_location: 0
 <2><3de>: Abbrev Number: 9 (DW_TAG_member)
    <3df>   DW_AT_name        : CR2
    <3e3>   DW_AT_decl_file   : 5
    <3e3>   DW_AT_decl_line   : 635
    <3e5>   DW_AT_decl_column : 17
    <3e5>   DW_AT_type        : <0xce>
    <3e9>   DW_AT_data_member_location: 4
 <2><3ea>: Abbrev Number: 4 (DW_TAG_member)
    <3eb>   DW_AT_name        : (indirect string, offset: 0x38ff1): SMCR
    <3ef>   DW_AT_decl_file   : 5
    <3f0>   DW_AT_decl_line   : 636
    <3f2>   DW_AT_decl_column : 17
    <3f3>   DW_AT_type        : <0xce>
    <3f7>   DW_AT_data_member_location: 8
 <2><3f8>: Abbrev Number: 4 (DW_TAG_member)
    <3f9>   DW_AT_name        : (indirect string, offset: 0x3ee21): DIER
    <3fd>   DW_AT_decl_file   : 5
    <3fe>   DW_AT_decl_line   : 637
    <400>   DW_AT_decl_column : 17
    <401>   DW_AT_type        : <0xce>
    <405>   DW_AT_data_member_location: 12
 <2><406>: Abbrev Number: 9 (DW_TAG_member)
    <407>   DW_AT_name        : SR
    <40a>   DW_AT_decl_file   : 5
    <40a>   DW_AT_decl_line   : 638
    <40c>   DW_AT_decl_column : 17
    <40c>   DW_AT_type        : <0xce>
    <410>   DW_AT_data_member_location: 16
 <2><411>: Abbrev Number: 9 (DW_TAG_member)
    <412>   DW_AT_name        : EGR
    <416>   DW_AT_decl_file   : 5
    <416>   DW_AT_decl_line   : 639
    <418>   DW_AT_decl_column : 17
    <418>   DW_AT_type        : <0xce>
    <41c>   DW_AT_data_member_location: 20
 <2><41d>: Abbrev Number: 4 (DW_TAG_member)
    <41e>   DW_AT_name        : (indirect string, offset: 0xb0611): CCMR1
    <422>   DW_AT_decl_file   : 5
    <423>   DW_AT_decl_line   : 640
    <425>   DW_AT_decl_column : 17
    <426>   DW_AT_type        : <0xce>
    <42a>   DW_AT_data_member_location: 24
 <2><42b>: Abbrev Number: 4 (DW_TAG_member)
    <42c>   DW_AT_name        : (indirect string, offset: 0x4d4ec): CCMR2
    <430>   DW_AT_decl_file   : 5
    <431>   DW_AT_decl_line   : 641
    <433>   DW_AT_decl_column : 17
    <434>   DW_AT_type        : <0xce>
    <438>   DW_AT_data_member_location: 28
 <2><439>: Abbrev Number: 4 (DW_TAG_member)
    <43a>   DW_AT_name        : (indirect string, offset: 0x2f8f6): CCER
    <43e>   DW_AT_decl_file   : 5
    <43f>   DW_AT_decl_line   : 642
    <441>   DW_AT_decl_column : 17
    <442>   DW_AT_type        : <0xce>
    <446>   DW_AT_data_member_location: 32
 <2><447>: Abbrev Number: 9 (DW_TAG_member)
    <448>   DW_AT_name        : CNT
    <44c>   DW_AT_decl_file   : 5
    <44c>   DW_AT_decl_line   : 643
    <44e>   DW_AT_decl_column : 17
    <44e>   DW_AT_type        : <0xce>
    <452>   DW_AT_data_member_location: 36
 <2><453>: Abbrev Number: 9 (DW_TAG_member)
    <454>   DW_AT_name        : PSC
    <458>   DW_AT_decl_file   : 5
    <458>   DW_AT_decl_line   : 644
    <45a>   DW_AT_decl_column : 17
    <45a>   DW_AT_type        : <0xce>
    <45e>   DW_AT_data_member_location: 40
 <2><45f>: Abbrev Number: 9 (DW_TAG_member)
    <460>   DW_AT_name        : ARR
    <464>   DW_AT_decl_file   : 5
    <464>   DW_AT_decl_line   : 645
    <466>   DW_AT_decl_column : 17
    <466>   DW_AT_type        : <0xce>
    <46a>   DW_AT_data_member_location: 44
 <2><46b>: Abbrev Number: 9 (DW_TAG_member)
    <46c>   DW_AT_name        : RCR
    <470>   DW_AT_decl_file   : 5
    <470>   DW_AT_decl_line   : 646
    <472>   DW_AT_decl_column : 17
    <472>   DW_AT_type        : <0xce>
    <476>   DW_AT_data_member_location: 48
 <2><477>: Abbrev Number: 4 (DW_TAG_member)
    <478>   DW_AT_name        : (indirect string, offset: 0x17226): CCR1
    <47c>   DW_AT_decl_file   : 5
    <47d>   DW_AT_decl_line   : 647
    <47f>   DW_AT_decl_column : 17
    <480>   DW_AT_type        : <0xce>
    <484>   DW_AT_data_member_location: 52
 <2><485>: Abbrev Number: 4 (DW_TAG_member)
    <486>   DW_AT_name        : (indirect string, offset: 0x511b1): CCR2
    <48a>   DW_AT_decl_file   : 5
    <48b>   DW_AT_decl_line   : 648
    <48d>   DW_AT_decl_column : 17
    <48e>   DW_AT_type        : <0xce>
    <492>   DW_AT_data_member_location: 56
 <2><493>: Abbrev Number: 4 (DW_TAG_member)
    <494>   DW_AT_name        : (indirect string, offset: 0x93798): CCR3
    <498>   DW_AT_decl_file   : 5
    <499>   DW_AT_decl_line   : 649
    <49b>   DW_AT_decl_column : 17
    <49c>   DW_AT_type        : <0xce>
    <4a0>   DW_AT_data_member_location: 60
 <2><4a1>: Abbrev Number: 4 (DW_TAG_member)
    <4a2>   DW_AT_name        : (indirect string, offset: 0xbf20): CCR4
    <4a6>   DW_AT_decl_file   : 5
    <4a7>   DW_AT_decl_line   : 650
    <4a9>   DW_AT_decl_column : 17
    <4aa>   DW_AT_type        : <0xce>
    <4ae>   DW_AT_data_member_location: 64
 <2><4af>: Abbrev Number: 4 (DW_TAG_member)
    <4b0>   DW_AT_name        : (indirect string, offset: 0x835ca): BDTR
    <4b4>   DW_AT_decl_file   : 5
    <4b5>   DW_AT_decl_line   : 651
    <4b7>   DW_AT_decl_column : 17
    <4b8>   DW_AT_type        : <0xce>
    <4bc>   DW_AT_data_member_location: 68
 <2><4bd>: Abbrev Number: 9 (DW_TAG_member)
    <4be>   DW_AT_name        : DCR
    <4c2>   DW_AT_decl_file   : 5
    <4c2>   DW_AT_decl_line   : 652
    <4c4>   DW_AT_decl_column : 17
    <4c4>   DW_AT_type        : <0xce>
    <4c8>   DW_AT_data_member_location: 72
 <2><4c9>: Abbrev Number: 4 (DW_TAG_member)
    <4ca>   DW_AT_name        : (indirect string, offset: 0xa5c8e): DMAR
    <4ce>   DW_AT_decl_file   : 5
    <4cf>   DW_AT_decl_line   : 653
    <4d1>   DW_AT_decl_column : 17
    <4d2>   DW_AT_type        : <0xce>
    <4d6>   DW_AT_data_member_location: 76
 <2><4d7>: Abbrev Number: 9 (DW_TAG_member)
    <4d8>   DW_AT_name        : OR
    <4db>   DW_AT_decl_file   : 5
    <4db>   DW_AT_decl_line   : 654
    <4dd>   DW_AT_decl_column : 17
    <4dd>   DW_AT_type        : <0xce>
    <4e1>   DW_AT_data_member_location: 80
 <2><4e2>: Abbrev Number: 0
 <1><4e3>: Abbrev Number: 15 (DW_TAG_typedef)
    <4e4>   DW_AT_name        : (indirect string, offset: 0xb70a0): TIM_TypeDef
    <4e8>   DW_AT_decl_file   : 5
    <4e9>   DW_AT_decl_line   : 655
    <4eb>   DW_AT_decl_column : 3
    <4eb>   DW_AT_type        : <0x3c9>
 <1><4ef>: Abbrev Number: 19 (DW_TAG_structure_type)
    <4f0>   DW_AT_byte_size   : 28
    <4f1>   DW_AT_decl_file   : 5
    <4f2>   DW_AT_decl_line   : 661
    <4f4>   DW_AT_decl_column : 9
    <4f4>   DW_AT_sibling     : <0x54d>
 <2><4f8>: Abbrev Number: 9 (DW_TAG_member)
    <4f9>   DW_AT_name        : SR
    <4fc>   DW_AT_decl_file   : 5
    <4fc>   DW_AT_decl_line   : 663
    <4fe>   DW_AT_decl_column : 17
    <4fe>   DW_AT_type        : <0xce>
    <502>   DW_AT_data_member_location: 0
 <2><503>: Abbrev Number: 9 (DW_TAG_member)
    <504>   DW_AT_name        : DR
    <507>   DW_AT_decl_file   : 5
    <507>   DW_AT_decl_line   : 664
    <509>   DW_AT_decl_column : 17
    <509>   DW_AT_type        : <0xce>
    <50d>   DW_AT_data_member_location: 4
 <2><50e>: Abbrev Number: 9 (DW_TAG_member)
    <50f>   DW_AT_name        : BRR
    <513>   DW_AT_decl_file   : 5
    <513>   DW_AT_decl_line   : 665
    <515>   DW_AT_decl_column : 17
    <515>   DW_AT_type        : <0xce>
    <519>   DW_AT_data_member_location: 8
 <2><51a>: Abbrev Number: 9 (DW_TAG_member)
    <51b>   DW_AT_name        : CR1
    <51f>   DW_AT_decl_file   : 5
    <51f>   DW_AT_decl_line   : 666
    <521>   DW_AT_decl_column : 17
    <521>   DW_AT_type        : <0xce>
    <525>   DW_AT_data_member_location: 12
 <2><526>: Abbrev Number: 9 (DW_TAG_member)
    <527>   DW_AT_name        : CR2
    <52b>   DW_AT_decl_file   : 5
    <52b>   DW_AT_decl_line   : 667
    <52d>   DW_AT_decl_column : 17
    <52d>   DW_AT_type        : <0xce>
    <531>   DW_AT_data_member_location: 16
 <2><532>: Abbrev Number: 9 (DW_TAG_member)
    <533>   DW_AT_name        : CR3
    <537>   DW_AT_decl_file   : 5
    <537>   DW_AT_decl_line   : 668
    <539>   DW_AT_decl_column : 17
    <539>   DW_AT_type        : <0xce>
    <53d>   DW_AT_data_member_location: 20
 <2><53e>: Abbrev Number: 4 (DW_TAG_member)
    <53f>   DW_AT_name        : (indirect string, offset: 0x35f60): GTPR
    <543>   DW_AT_decl_file   : 5
    <544>   DW_AT_decl_line   : 669
    <546>   DW_AT_decl_column : 17
    <547>   DW_AT_type        : <0xce>
    <54b>   DW_AT_data_member_location: 24
 <2><54c>: Abbrev Number: 0
 <1><54d>: Abbrev Number: 15 (DW_TAG_typedef)
    <54e>   DW_AT_name        : (indirect string, offset: 0xbfc32): USART_TypeDef
    <552>   DW_AT_decl_file   : 5
    <553>   DW_AT_decl_line   : 670
    <555>   DW_AT_decl_column : 3
    <555>   DW_AT_type        : <0x4ef>
 <1><559>: Abbrev Number: 6 (DW_TAG_typedef)
    <55a>   DW_AT_name        : (indirect string, offset: 0x810b): size_t
    <55e>   DW_AT_decl_file   : 6
    <55f>   DW_AT_decl_line   : 214
    <560>   DW_AT_decl_column : 23
    <561>   DW_AT_type        : <0x99>
 <1><565>: Abbrev Number: 16 (DW_TAG_base_type)
    <566>   DW_AT_byte_size   : 8
    <567>   DW_AT_encoding    : 4	(float)
    <568>   DW_AT_name        : (indirect string, offset: 0x24061): long double
 <1><56c>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <56d>   DW_AT_encoding    : 7	(unsigned)
    <56e>   DW_AT_byte_size   : 1
    <56f>   DW_AT_type        : <0x44>
    <573>   DW_AT_decl_file   : 7
    <574>   DW_AT_decl_line   : 39
    <575>   DW_AT_decl_column : 1
    <576>   DW_AT_sibling     : <0x593>
 <2><57a>: Abbrev Number: 2 (DW_TAG_enumerator)
    <57b>   DW_AT_name        : (indirect string, offset: 0x41884): HAL_OK
    <57f>   DW_AT_const_value : 0
 <2><580>: Abbrev Number: 2 (DW_TAG_enumerator)
    <581>   DW_AT_name        : (indirect string, offset: 0x788df): HAL_ERROR
    <585>   DW_AT_const_value : 1
 <2><586>: Abbrev Number: 2 (DW_TAG_enumerator)
    <587>   DW_AT_name        : (indirect string, offset: 0x2265d): HAL_BUSY
    <58b>   DW_AT_const_value : 2
 <2><58c>: Abbrev Number: 2 (DW_TAG_enumerator)
    <58d>   DW_AT_name        : (indirect string, offset: 0x38dd6): HAL_TIMEOUT
    <591>   DW_AT_const_value : 3
 <2><592>: Abbrev Number: 0
 <1><593>: Abbrev Number: 6 (DW_TAG_typedef)
    <594>   DW_AT_name        : (indirect string, offset: 0x21d6): HAL_StatusTypeDef
    <598>   DW_AT_decl_file   : 7
    <599>   DW_AT_decl_line   : 44
    <59a>   DW_AT_decl_column : 3
    <59b>   DW_AT_type        : <0x56c>
 <1><59f>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <5a0>   DW_AT_encoding    : 7	(unsigned)
    <5a1>   DW_AT_byte_size   : 1
    <5a2>   DW_AT_type        : <0x44>
    <5a6>   DW_AT_decl_file   : 7
    <5a7>   DW_AT_decl_line   : 50
    <5a8>   DW_AT_decl_column : 1
    <5a9>   DW_AT_sibling     : <0x5ba>
 <2><5ad>: Abbrev Number: 2 (DW_TAG_enumerator)
    <5ae>   DW_AT_name        : (indirect string, offset: 0x8e8b0): HAL_UNLOCKED
    <5b2>   DW_AT_const_value : 0
 <2><5b3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <5b4>   DW_AT_name        : (indirect string, offset: 0xc1256): HAL_LOCKED
    <5b8>   DW_AT_const_value : 1
 <2><5b9>: Abbrev Number: 0
 <1><5ba>: Abbrev Number: 6 (DW_TAG_typedef)
    <5bb>   DW_AT_name        : (indirect string, offset: 0x71fcf): HAL_LockTypeDef
    <5bf>   DW_AT_decl_file   : 7
    <5c0>   DW_AT_decl_line   : 53
    <5c1>   DW_AT_decl_column : 3
    <5c2>   DW_AT_type        : <0x59f>
 <1><5c6>: Abbrev Number: 17 (DW_TAG_structure_type)
    <5c7>   DW_AT_byte_size   : 24
    <5c8>   DW_AT_decl_file   : 8
    <5c9>   DW_AT_decl_line   : 45
    <5ca>   DW_AT_decl_column : 9
    <5ca>   DW_AT_sibling     : <0x61d>
 <2><5ce>: Abbrev Number: 1 (DW_TAG_member)
    <5cf>   DW_AT_name        : (indirect string, offset: 0x812ab): PLLState
    <5d3>   DW_AT_decl_file   : 8
    <5d4>   DW_AT_decl_line   : 47
    <5d5>   DW_AT_decl_column : 12
    <5d6>   DW_AT_type        : <0xc2>
    <5da>   DW_AT_data_member_location: 0
 <2><5db>: Abbrev Number: 1 (DW_TAG_member)
    <5dc>   DW_AT_name        : (indirect string, offset: 0x85a81): PLLSource
    <5e0>   DW_AT_decl_file   : 8
    <5e1>   DW_AT_decl_line   : 50
    <5e2>   DW_AT_decl_column : 12
    <5e3>   DW_AT_type        : <0xc2>
    <5e7>   DW_AT_data_member_location: 4
 <2><5e8>: Abbrev Number: 1 (DW_TAG_member)
    <5e9>   DW_AT_name        : (indirect string, offset: 0x9fe80): PLLM
    <5ed>   DW_AT_decl_file   : 8
    <5ee>   DW_AT_decl_line   : 53
    <5ef>   DW_AT_decl_column : 12
    <5f0>   DW_AT_type        : <0xc2>
    <5f4>   DW_AT_data_member_location: 8
 <2><5f5>: Abbrev Number: 1 (DW_TAG_member)
    <5f6>   DW_AT_name        : (indirect string, offset: 0x9fe85): PLLN
    <5fa>   DW_AT_decl_file   : 8
    <5fb>   DW_AT_decl_line   : 56
    <5fc>   DW_AT_decl_column : 12
    <5fd>   DW_AT_type        : <0xc2>
    <601>   DW_AT_data_member_location: 12
 <2><602>: Abbrev Number: 1 (DW_TAG_member)
    <603>   DW_AT_name        : (indirect string, offset: 0x9fea2): PLLP
    <607>   DW_AT_decl_file   : 8
    <608>   DW_AT_decl_line   : 60
    <609>   DW_AT_decl_column : 12
    <60a>   DW_AT_type        : <0xc2>
    <60e>   DW_AT_data_member_location: 16
 <2><60f>: Abbrev Number: 1 (DW_TAG_member)
    <610>   DW_AT_name        : (indirect string, offset: 0x482a6): PLLQ
    <614>   DW_AT_decl_file   : 8
    <615>   DW_AT_decl_line   : 63
    <616>   DW_AT_decl_column : 12
    <617>   DW_AT_type        : <0xc2>
    <61b>   DW_AT_data_member_location: 20
 <2><61c>: Abbrev Number: 0
 <1><61d>: Abbrev Number: 6 (DW_TAG_typedef)
    <61e>   DW_AT_name        : (indirect string, offset: 0x74b9d): RCC_PLLInitTypeDef
    <622>   DW_AT_decl_file   : 8
    <623>   DW_AT_decl_line   : 73
    <624>   DW_AT_decl_column : 3
    <625>   DW_AT_type        : <0x5c6>
 <1><629>: Abbrev Number: 17 (DW_TAG_structure_type)
    <62a>   DW_AT_byte_size   : 48
    <62b>   DW_AT_decl_file   : 9
    <62c>   DW_AT_decl_line   : 49
    <62d>   DW_AT_decl_column : 9
    <62d>   DW_AT_sibling     : <0x68d>
 <2><631>: Abbrev Number: 1 (DW_TAG_member)
    <632>   DW_AT_name        : (indirect string, offset: 0x9d375): OscillatorType
    <636>   DW_AT_decl_file   : 9
    <637>   DW_AT_decl_line   : 51
    <638>   DW_AT_decl_column : 12
    <639>   DW_AT_type        : <0xc2>
    <63d>   DW_AT_data_member_location: 0
 <2><63e>: Abbrev Number: 1 (DW_TAG_member)
    <63f>   DW_AT_name        : (indirect string, offset: 0x82908): HSEState
    <643>   DW_AT_decl_file   : 9
    <644>   DW_AT_decl_line   : 54
    <645>   DW_AT_decl_column : 12
    <646>   DW_AT_type        : <0xc2>
    <64a>   DW_AT_data_member_location: 4
 <2><64b>: Abbrev Number: 1 (DW_TAG_member)
    <64c>   DW_AT_name        : (indirect string, offset: 0x791e8): LSEState
    <650>   DW_AT_decl_file   : 9
    <651>   DW_AT_decl_line   : 57
    <652>   DW_AT_decl_column : 12
    <653>   DW_AT_type        : <0xc2>
    <657>   DW_AT_data_member_location: 8
 <2><658>: Abbrev Number: 1 (DW_TAG_member)
    <659>   DW_AT_name        : (indirect string, offset: 0x562e7): HSIState
    <65d>   DW_AT_decl_file   : 9
    <65e>   DW_AT_decl_line   : 60
    <65f>   DW_AT_decl_column : 12
    <660>   DW_AT_type        : <0xc2>
    <664>   DW_AT_data_member_location: 12
 <2><665>: Abbrev Number: 1 (DW_TAG_member)
    <666>   DW_AT_name        : (indirect string, offset: 0xa5ea3): HSICalibrationValue
    <66a>   DW_AT_decl_file   : 9
    <66b>   DW_AT_decl_line   : 63
    <66c>   DW_AT_decl_column : 12
    <66d>   DW_AT_type        : <0xc2>
    <671>   DW_AT_data_member_location: 16
 <2><672>: Abbrev Number: 1 (DW_TAG_member)
    <673>   DW_AT_name        : (indirect string, offset: 0x44055): LSIState
    <677>   DW_AT_decl_file   : 9
    <678>   DW_AT_decl_line   : 66
    <679>   DW_AT_decl_column : 12
    <67a>   DW_AT_type        : <0xc2>
    <67e>   DW_AT_data_member_location: 20
 <2><67f>: Abbrev Number: 36 (DW_TAG_member)
    <680>   DW_AT_name        : PLL
    <684>   DW_AT_decl_file   : 9
    <685>   DW_AT_decl_line   : 69
    <686>   DW_AT_decl_column : 22
    <687>   DW_AT_type        : <0x61d>
    <68b>   DW_AT_data_member_location: 24
 <2><68c>: Abbrev Number: 0
 <1><68d>: Abbrev Number: 6 (DW_TAG_typedef)
    <68e>   DW_AT_name        : (indirect string, offset: 0x667c0): RCC_OscInitTypeDef
    <692>   DW_AT_decl_file   : 9
    <693>   DW_AT_decl_line   : 70
    <694>   DW_AT_decl_column : 3
    <695>   DW_AT_type        : <0x629>
 <1><699>: Abbrev Number: 17 (DW_TAG_structure_type)
    <69a>   DW_AT_byte_size   : 20
    <69b>   DW_AT_decl_file   : 9
    <69c>   DW_AT_decl_line   : 75
    <69d>   DW_AT_decl_column : 9
    <69d>   DW_AT_sibling     : <0x6e3>
 <2><6a1>: Abbrev Number: 1 (DW_TAG_member)
    <6a2>   DW_AT_name        : (indirect string, offset: 0x3b6f6): ClockType
    <6a6>   DW_AT_decl_file   : 9
    <6a7>   DW_AT_decl_line   : 77
    <6a8>   DW_AT_decl_column : 12
    <6a9>   DW_AT_type        : <0xc2>
    <6ad>   DW_AT_data_member_location: 0
 <2><6ae>: Abbrev Number: 1 (DW_TAG_member)
    <6af>   DW_AT_name        : (indirect string, offset: 0x74650): SYSCLKSource
    <6b3>   DW_AT_decl_file   : 9
    <6b4>   DW_AT_decl_line   : 80
    <6b5>   DW_AT_decl_column : 12
    <6b6>   DW_AT_type        : <0xc2>
    <6ba>   DW_AT_data_member_location: 4
 <2><6bb>: Abbrev Number: 1 (DW_TAG_member)
    <6bc>   DW_AT_name        : (indirect string, offset: 0x9f8e7): AHBCLKDivider
    <6c0>   DW_AT_decl_file   : 9
    <6c1>   DW_AT_decl_line   : 83
    <6c2>   DW_AT_decl_column : 12
    <6c3>   DW_AT_type        : <0xc2>
    <6c7>   DW_AT_data_member_location: 8
 <2><6c8>: Abbrev Number: 1 (DW_TAG_member)
    <6c9>   DW_AT_name        : (indirect string, offset: 0x73e9): APB1CLKDivider
    <6cd>   DW_AT_decl_file   : 9
    <6ce>   DW_AT_decl_line   : 86
    <6cf>   DW_AT_decl_column : 12
    <6d0>   DW_AT_type        : <0xc2>
    <6d4>   DW_AT_data_member_location: 12
 <2><6d5>: Abbrev Number: 1 (DW_TAG_member)
    <6d6>   DW_AT_name        : (indirect string, offset: 0x58843): APB2CLKDivider
    <6da>   DW_AT_decl_file   : 9
    <6db>   DW_AT_decl_line   : 89
    <6dc>   DW_AT_decl_column : 12
    <6dd>   DW_AT_type        : <0xc2>
    <6e1>   DW_AT_data_member_location: 16
 <2><6e2>: Abbrev Number: 0
 <1><6e3>: Abbrev Number: 6 (DW_TAG_typedef)
    <6e4>   DW_AT_name        : (indirect string, offset: 0x86d53): RCC_ClkInitTypeDef
    <6e8>   DW_AT_decl_file   : 9
    <6e9>   DW_AT_decl_line   : 92
    <6ea>   DW_AT_decl_column : 3
    <6eb>   DW_AT_type        : <0x699>
 <1><6ef>: Abbrev Number: 17 (DW_TAG_structure_type)
    <6f0>   DW_AT_byte_size   : 20
    <6f1>   DW_AT_decl_file   : 10
    <6f2>   DW_AT_decl_line   : 46
    <6f3>   DW_AT_decl_column : 9
    <6f3>   DW_AT_sibling     : <0x739>
 <2><6f7>: Abbrev Number: 36 (DW_TAG_member)
    <6f8>   DW_AT_name        : Pin
    <6fc>   DW_AT_decl_file   : 10
    <6fd>   DW_AT_decl_line   : 48
    <6fe>   DW_AT_decl_column : 12
    <6ff>   DW_AT_type        : <0xc2>
    <703>   DW_AT_data_member_location: 0
 <2><704>: Abbrev Number: 1 (DW_TAG_member)
    <705>   DW_AT_name        : (indirect string, offset: 0xc5a4d): Mode
    <709>   DW_AT_decl_file   : 10
    <70a>   DW_AT_decl_line   : 51
    <70b>   DW_AT_decl_column : 12
    <70c>   DW_AT_type        : <0xc2>
    <710>   DW_AT_data_member_location: 4
 <2><711>: Abbrev Number: 1 (DW_TAG_member)
    <712>   DW_AT_name        : (indirect string, offset: 0x633d5): Pull
    <716>   DW_AT_decl_file   : 10
    <717>   DW_AT_decl_line   : 54
    <718>   DW_AT_decl_column : 12
    <719>   DW_AT_type        : <0xc2>
    <71d>   DW_AT_data_member_location: 8
 <2><71e>: Abbrev Number: 1 (DW_TAG_member)
    <71f>   DW_AT_name        : (indirect string, offset: 0x71475): Speed
    <723>   DW_AT_decl_file   : 10
    <724>   DW_AT_decl_line   : 57
    <725>   DW_AT_decl_column : 12
    <726>   DW_AT_type        : <0xc2>
    <72a>   DW_AT_data_member_location: 12
 <2><72b>: Abbrev Number: 1 (DW_TAG_member)
    <72c>   DW_AT_name        : (indirect string, offset: 0x58804): Alternate
    <730>   DW_AT_decl_file   : 10
    <731>   DW_AT_decl_line   : 60
    <732>   DW_AT_decl_column : 12
    <733>   DW_AT_type        : <0xc2>
    <737>   DW_AT_data_member_location: 16
 <2><738>: Abbrev Number: 0
 <1><739>: Abbrev Number: 6 (DW_TAG_typedef)
    <73a>   DW_AT_name        : (indirect string, offset: 0x97153): GPIO_InitTypeDef
    <73e>   DW_AT_decl_file   : 10
    <73f>   DW_AT_decl_line   : 62
    <740>   DW_AT_decl_column : 2
    <741>   DW_AT_type        : <0x6ef>
 <1><745>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <746>   DW_AT_encoding    : 7	(unsigned)
    <747>   DW_AT_byte_size   : 1
    <748>   DW_AT_type        : <0x44>
    <74c>   DW_AT_decl_file   : 10
    <74d>   DW_AT_decl_line   : 68
    <74e>   DW_AT_decl_column : 1
    <74f>   DW_AT_sibling     : <0x760>
 <2><753>: Abbrev Number: 2 (DW_TAG_enumerator)
    <754>   DW_AT_name        : (indirect string, offset: 0x2893c): GPIO_PIN_RESET
    <758>   DW_AT_const_value : 0
 <2><759>: Abbrev Number: 2 (DW_TAG_enumerator)
    <75a>   DW_AT_name        : (indirect string, offset: 0x3131d): GPIO_PIN_SET
    <75e>   DW_AT_const_value : 1
 <2><75f>: Abbrev Number: 0
 <1><760>: Abbrev Number: 6 (DW_TAG_typedef)
    <761>   DW_AT_name        : (indirect string, offset: 0xbe02f): GPIO_PinState
    <765>   DW_AT_decl_file   : 10
    <766>   DW_AT_decl_line   : 71
    <767>   DW_AT_decl_column : 2
    <768>   DW_AT_type        : <0x745>
 <1><76c>: Abbrev Number: 17 (DW_TAG_structure_type)
    <76d>   DW_AT_byte_size   : 48
    <76e>   DW_AT_decl_file   : 11
    <76f>   DW_AT_decl_line   : 48
    <770>   DW_AT_decl_column : 9
    <770>   DW_AT_sibling     : <0x811>
 <2><774>: Abbrev Number: 1 (DW_TAG_member)
    <775>   DW_AT_name        : (indirect string, offset: 0x644f4): Channel
    <779>   DW_AT_decl_file   : 11
    <77a>   DW_AT_decl_line   : 50
    <77b>   DW_AT_decl_column : 12
    <77c>   DW_AT_type        : <0xc2>
    <780>   DW_AT_data_member_location: 0
 <2><781>: Abbrev Number: 1 (DW_TAG_member)
    <782>   DW_AT_name        : (indirect string, offset: 0x47ee8): Direction
    <786>   DW_AT_decl_file   : 11
    <787>   DW_AT_decl_line   : 53
    <788>   DW_AT_decl_column : 12
    <789>   DW_AT_type        : <0xc2>
    <78d>   DW_AT_data_member_location: 4
 <2><78e>: Abbrev Number: 1 (DW_TAG_member)
    <78f>   DW_AT_name        : (indirect string, offset: 0xca8d): PeriphInc
    <793>   DW_AT_decl_file   : 11
    <794>   DW_AT_decl_line   : 57
    <795>   DW_AT_decl_column : 12
    <796>   DW_AT_type        : <0xc2>
    <79a>   DW_AT_data_member_location: 8
 <2><79b>: Abbrev Number: 1 (DW_TAG_member)
    <79c>   DW_AT_name        : (indirect string, offset: 0x1ec82): MemInc
    <7a0>   DW_AT_decl_file   : 11
    <7a1>   DW_AT_decl_line   : 60
    <7a2>   DW_AT_decl_column : 12
    <7a3>   DW_AT_type        : <0xc2>
    <7a7>   DW_AT_data_member_location: 12
 <2><7a8>: Abbrev Number: 1 (DW_TAG_member)
    <7a9>   DW_AT_name        : (indirect string, offset: 0x5ff9a): PeriphDataAlignment
    <7ad>   DW_AT_decl_file   : 11
    <7ae>   DW_AT_decl_line   : 63
    <7af>   DW_AT_decl_column : 12
    <7b0>   DW_AT_type        : <0xc2>
    <7b4>   DW_AT_data_member_location: 16
 <2><7b5>: Abbrev Number: 1 (DW_TAG_member)
    <7b6>   DW_AT_name        : (indirect string, offset: 0xae995): MemDataAlignment
    <7ba>   DW_AT_decl_file   : 11
    <7bb>   DW_AT_decl_line   : 66
    <7bc>   DW_AT_decl_column : 12
    <7bd>   DW_AT_type        : <0xc2>
    <7c1>   DW_AT_data_member_location: 20
 <2><7c2>: Abbrev Number: 1 (DW_TAG_member)
    <7c3>   DW_AT_name        : (indirect string, offset: 0xc5a4d): Mode
    <7c7>   DW_AT_decl_file   : 11
    <7c8>   DW_AT_decl_line   : 69
    <7c9>   DW_AT_decl_column : 12
    <7ca>   DW_AT_type        : <0xc2>
    <7ce>   DW_AT_data_member_location: 24
 <2><7cf>: Abbrev Number: 1 (DW_TAG_member)
    <7d0>   DW_AT_name        : (indirect string, offset: 0xc4ff1): Priority
    <7d4>   DW_AT_decl_file   : 11
    <7d5>   DW_AT_decl_line   : 74
    <7d6>   DW_AT_decl_column : 12
    <7d7>   DW_AT_type        : <0xc2>
    <7db>   DW_AT_data_member_location: 28
 <2><7dc>: Abbrev Number: 1 (DW_TAG_member)
    <7dd>   DW_AT_name        : (indirect string, offset: 0x53798): FIFOMode
    <7e1>   DW_AT_decl_file   : 11
    <7e2>   DW_AT_decl_line   : 77
    <7e3>   DW_AT_decl_column : 12
    <7e4>   DW_AT_type        : <0xc2>
    <7e8>   DW_AT_data_member_location: 32
 <2><7e9>: Abbrev Number: 1 (DW_TAG_member)
    <7ea>   DW_AT_name        : (indirect string, offset: 0x92c51): FIFOThreshold
    <7ee>   DW_AT_decl_file   : 11
    <7ef>   DW_AT_decl_line   : 82
    <7f0>   DW_AT_decl_column : 12
    <7f1>   DW_AT_type        : <0xc2>
    <7f5>   DW_AT_data_member_location: 36
 <2><7f6>: Abbrev Number: 1 (DW_TAG_member)
    <7f7>   DW_AT_name        : (indirect string, offset: 0x90fbe): MemBurst
    <7fb>   DW_AT_decl_file   : 11
    <7fc>   DW_AT_decl_line   : 85
    <7fd>   DW_AT_decl_column : 12
    <7fe>   DW_AT_type        : <0xc2>
    <802>   DW_AT_data_member_location: 40
 <2><803>: Abbrev Number: 1 (DW_TAG_member)
    <804>   DW_AT_name        : (indirect string, offset: 0x42795): PeriphBurst
    <808>   DW_AT_decl_file   : 11
    <809>   DW_AT_decl_line   : 91
    <80a>   DW_AT_decl_column : 12
    <80b>   DW_AT_type        : <0xc2>
    <80f>   DW_AT_data_member_location: 44
 <2><810>: Abbrev Number: 0
 <1><811>: Abbrev Number: 6 (DW_TAG_typedef)
    <812>   DW_AT_name        : (indirect string, offset: 0x34455): DMA_InitTypeDef
    <816>   DW_AT_decl_file   : 11
    <817>   DW_AT_decl_line   : 96
    <818>   DW_AT_decl_column : 2
    <819>   DW_AT_type        : <0x76c>
 <1><81d>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <81e>   DW_AT_encoding    : 7	(unsigned)
    <81f>   DW_AT_byte_size   : 1
    <820>   DW_AT_type        : <0x44>
    <824>   DW_AT_decl_file   : 11
    <825>   DW_AT_decl_line   : 103
    <826>   DW_AT_decl_column : 1
    <827>   DW_AT_sibling     : <0x850>
 <2><82b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <82c>   DW_AT_name        : (indirect string, offset: 0xc5c1): HAL_DMA_STATE_RESET
    <830>   DW_AT_const_value : 0
 <2><831>: Abbrev Number: 2 (DW_TAG_enumerator)
    <832>   DW_AT_name        : (indirect string, offset: 0x3570c): HAL_DMA_STATE_READY
    <836>   DW_AT_const_value : 1
 <2><837>: Abbrev Number: 2 (DW_TAG_enumerator)
    <838>   DW_AT_name        : (indirect string, offset: 0x853f8): HAL_DMA_STATE_BUSY
    <83c>   DW_AT_const_value : 2
 <2><83d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <83e>   DW_AT_name        : (indirect string, offset: 0xbe3f8): HAL_DMA_STATE_TIMEOUT
    <842>   DW_AT_const_value : 3
 <2><843>: Abbrev Number: 2 (DW_TAG_enumerator)
    <844>   DW_AT_name        : (indirect string, offset: 0x92700): HAL_DMA_STATE_ERROR
    <848>   DW_AT_const_value : 4
 <2><849>: Abbrev Number: 2 (DW_TAG_enumerator)
    <84a>   DW_AT_name        : (indirect string, offset: 0x4bd32): HAL_DMA_STATE_ABORT
    <84e>   DW_AT_const_value : 5
 <2><84f>: Abbrev Number: 0
 <1><850>: Abbrev Number: 6 (DW_TAG_typedef)
    <851>   DW_AT_name        : (indirect string, offset: 0xadcd3): HAL_DMA_StateTypeDef
    <855>   DW_AT_decl_file   : 11
    <856>   DW_AT_decl_line   : 110
    <857>   DW_AT_decl_column : 2
    <858>   DW_AT_type        : <0x81d>
 <1><85c>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <85d>   DW_AT_type        : <0x850>
 <1><861>: Abbrev Number: 32 (DW_TAG_structure_type)
    <862>   DW_AT_name        : (indirect string, offset: 0xa42bd): __DMA_HandleTypeDef
    <866>   DW_AT_byte_size   : 96
    <867>   DW_AT_decl_file   : 11
    <868>   DW_AT_decl_line   : 138
    <869>   DW_AT_decl_column : 16
    <869>   DW_AT_sibling     : <0x924>
 <2><86d>: Abbrev Number: 1 (DW_TAG_member)
    <86e>   DW_AT_name        : (indirect string, offset: 0xbaef5): Instance
    <872>   DW_AT_decl_file   : 11
    <873>   DW_AT_decl_line   : 140
    <874>   DW_AT_decl_column : 31
    <875>   DW_AT_type        : <0x924>
    <879>   DW_AT_data_member_location: 0
 <2><87a>: Abbrev Number: 1 (DW_TAG_member)
    <87b>   DW_AT_name        : (indirect string, offset: 0x9ed59): Init
    <87f>   DW_AT_decl_file   : 11
    <880>   DW_AT_decl_line   : 142
    <881>   DW_AT_decl_column : 30
    <882>   DW_AT_type        : <0x811>
    <886>   DW_AT_data_member_location: 4
 <2><887>: Abbrev Number: 1 (DW_TAG_member)
    <888>   DW_AT_name        : (indirect string, offset: 0x894bb): Lock
    <88c>   DW_AT_decl_file   : 11
    <88d>   DW_AT_decl_line   : 144
    <88e>   DW_AT_decl_column : 30
    <88f>   DW_AT_type        : <0x5ba>
    <893>   DW_AT_data_member_location: 52
 <2><894>: Abbrev Number: 1 (DW_TAG_member)
    <895>   DW_AT_name        : (indirect string, offset: 0x8290b): State
    <899>   DW_AT_decl_file   : 11
    <89a>   DW_AT_decl_line   : 146
    <89b>   DW_AT_decl_column : 30
    <89c>   DW_AT_type        : <0x85c>
    <8a0>   DW_AT_data_member_location: 53
 <2><8a1>: Abbrev Number: 1 (DW_TAG_member)
    <8a2>   DW_AT_name        : (indirect string, offset: 0xb7e5d): Parent
    <8a6>   DW_AT_decl_file   : 11
    <8a7>   DW_AT_decl_line   : 148
    <8a8>   DW_AT_decl_column : 31
    <8a9>   DW_AT_type        : <0x929>
    <8ad>   DW_AT_data_member_location: 56
 <2><8ae>: Abbrev Number: 1 (DW_TAG_member)
    <8af>   DW_AT_name        : (indirect string, offset: 0xc0839): XferCpltCallback
    <8b3>   DW_AT_decl_file   : 11
    <8b4>   DW_AT_decl_line   : 150
    <8b5>   DW_AT_decl_column : 33
    <8b6>   DW_AT_type        : <0x93b>
    <8ba>   DW_AT_data_member_location: 60
 <2><8bb>: Abbrev Number: 1 (DW_TAG_member)
    <8bc>   DW_AT_name        : (indirect string, offset: 0x96254): XferHalfCpltCallback
    <8c0>   DW_AT_decl_file   : 11
    <8c1>   DW_AT_decl_line   : 152
    <8c2>   DW_AT_decl_column : 33
    <8c3>   DW_AT_type        : <0x93b>
    <8c7>   DW_AT_data_member_location: 64
 <2><8c8>: Abbrev Number: 1 (DW_TAG_member)
    <8c9>   DW_AT_name        : (indirect string, offset: 0x716a2): XferM1CpltCallback
    <8cd>   DW_AT_decl_file   : 11
    <8ce>   DW_AT_decl_line   : 154
    <8cf>   DW_AT_decl_column : 33
    <8d0>   DW_AT_type        : <0x93b>
    <8d4>   DW_AT_data_member_location: 68
 <2><8d5>: Abbrev Number: 1 (DW_TAG_member)
    <8d6>   DW_AT_name        : (indirect string, offset: 0x5ce04): XferM1HalfCpltCallback
    <8da>   DW_AT_decl_file   : 11
    <8db>   DW_AT_decl_line   : 156
    <8dc>   DW_AT_decl_column : 33
    <8dd>   DW_AT_type        : <0x93b>
    <8e1>   DW_AT_data_member_location: 72
 <2><8e2>: Abbrev Number: 1 (DW_TAG_member)
    <8e3>   DW_AT_name        : (indirect string, offset: 0x1c42f): XferErrorCallback
    <8e7>   DW_AT_decl_file   : 11
    <8e8>   DW_AT_decl_line   : 158
    <8e9>   DW_AT_decl_column : 33
    <8ea>   DW_AT_type        : <0x93b>
    <8ee>   DW_AT_data_member_location: 76
 <2><8ef>: Abbrev Number: 1 (DW_TAG_member)
    <8f0>   DW_AT_name        : (indirect string, offset: 0xb4794): XferAbortCallback
    <8f4>   DW_AT_decl_file   : 11
    <8f5>   DW_AT_decl_line   : 160
    <8f6>   DW_AT_decl_column : 33
    <8f7>   DW_AT_type        : <0x93b>
    <8fb>   DW_AT_data_member_location: 80
 <2><8fc>: Abbrev Number: 1 (DW_TAG_member)
    <8fd>   DW_AT_name        : (indirect string, offset: 0xbd10b): ErrorCode
    <901>   DW_AT_decl_file   : 11
    <902>   DW_AT_decl_line   : 162
    <903>   DW_AT_decl_column : 30
    <904>   DW_AT_type        : <0xce>
    <908>   DW_AT_data_member_location: 84
 <2><909>: Abbrev Number: 1 (DW_TAG_member)
    <90a>   DW_AT_name        : (indirect string, offset: 0x5665a): StreamBaseAddress
    <90e>   DW_AT_decl_file   : 11
    <90f>   DW_AT_decl_line   : 164
    <910>   DW_AT_decl_column : 30
    <911>   DW_AT_type        : <0xc2>
    <915>   DW_AT_data_member_location: 88
 <2><916>: Abbrev Number: 1 (DW_TAG_member)
    <917>   DW_AT_name        : (indirect string, offset: 0xa2412): StreamIndex
    <91b>   DW_AT_decl_file   : 11
    <91c>   DW_AT_decl_line   : 166
    <91d>   DW_AT_decl_column : 30
    <91e>   DW_AT_type        : <0xc2>
    <922>   DW_AT_data_member_location: 92
 <2><923>: Abbrev Number: 0
 <1><924>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <925>   DW_AT_byte_size   : 4
    <925>   DW_AT_type        : <0x13a>
 <1><929>: Abbrev Number: 45 (DW_TAG_pointer_type)
    <92a>   DW_AT_byte_size   : 4
 <1><92b>: Abbrev Number: 37 (DW_TAG_subroutine_type)
    <92c>   DW_AT_prototyped  : 1
    <92c>   DW_AT_sibling     : <0x936>
 <2><930>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <931>   DW_AT_type        : <0x936>
 <2><935>: Abbrev Number: 0
 <1><936>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <937>   DW_AT_byte_size   : 4
    <937>   DW_AT_type        : <0x861>
 <1><93b>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <93c>   DW_AT_byte_size   : 4
    <93c>   DW_AT_type        : <0x92b>
 <1><940>: Abbrev Number: 6 (DW_TAG_typedef)
    <941>   DW_AT_name        : (indirect string, offset: 0xa42bf): DMA_HandleTypeDef
    <945>   DW_AT_decl_file   : 11
    <946>   DW_AT_decl_line   : 168
    <947>   DW_AT_decl_column : 2
    <948>   DW_AT_type        : <0x861>
 <1><94c>: Abbrev Number: 17 (DW_TAG_structure_type)
    <94d>   DW_AT_byte_size   : 24
    <94e>   DW_AT_decl_file   : 12
    <94f>   DW_AT_decl_line   : 46
    <950>   DW_AT_decl_column : 9
    <950>   DW_AT_sibling     : <0x9a3>
 <2><954>: Abbrev Number: 1 (DW_TAG_member)
    <955>   DW_AT_name        : (indirect string, offset: 0xc267c): Prescaler
    <959>   DW_AT_decl_file   : 12
    <95a>   DW_AT_decl_line   : 48
    <95b>   DW_AT_decl_column : 12
    <95c>   DW_AT_type        : <0xc2>
    <960>   DW_AT_data_member_location: 0
 <2><961>: Abbrev Number: 1 (DW_TAG_member)
    <962>   DW_AT_name        : (indirect string, offset: 0xaf961): CounterMode
    <966>   DW_AT_decl_file   : 12
    <967>   DW_AT_decl_line   : 51
    <968>   DW_AT_decl_column : 12
    <969>   DW_AT_type        : <0xc2>
    <96d>   DW_AT_data_member_location: 4
 <2><96e>: Abbrev Number: 1 (DW_TAG_member)
    <96f>   DW_AT_name        : (indirect string, offset: 0xcbc43): Period
    <973>   DW_AT_decl_file   : 12
    <974>   DW_AT_decl_line   : 54
    <975>   DW_AT_decl_column : 12
    <976>   DW_AT_type        : <0xc2>
    <97a>   DW_AT_data_member_location: 8
 <2><97b>: Abbrev Number: 1 (DW_TAG_member)
    <97c>   DW_AT_name        : (indirect string, offset: 0x4ebb2): ClockDivision
    <980>   DW_AT_decl_file   : 12
    <981>   DW_AT_decl_line   : 58
    <982>   DW_AT_decl_column : 12
    <983>   DW_AT_type        : <0xc2>
    <987>   DW_AT_data_member_location: 12
 <2><988>: Abbrev Number: 1 (DW_TAG_member)
    <989>   DW_AT_name        : (indirect string, offset: 0x86a86): RepetitionCounter
    <98d>   DW_AT_decl_file   : 12
    <98e>   DW_AT_decl_line   : 61
    <98f>   DW_AT_decl_column : 12
    <990>   DW_AT_type        : <0xc2>
    <994>   DW_AT_data_member_location: 16
 <2><995>: Abbrev Number: 1 (DW_TAG_member)
    <996>   DW_AT_name        : (indirect string, offset: 0xb26cc): AutoReloadPreload
    <99a>   DW_AT_decl_file   : 12
    <99b>   DW_AT_decl_line   : 72
    <99c>   DW_AT_decl_column : 12
    <99d>   DW_AT_type        : <0xc2>
    <9a1>   DW_AT_data_member_location: 20
 <2><9a2>: Abbrev Number: 0
 <1><9a3>: Abbrev Number: 6 (DW_TAG_typedef)
    <9a4>   DW_AT_name        : (indirect string, offset: 0x43021): TIM_Base_InitTypeDef
    <9a8>   DW_AT_decl_file   : 12
    <9a9>   DW_AT_decl_line   : 74
    <9aa>   DW_AT_decl_column : 3
    <9ab>   DW_AT_type        : <0x94c>
 <1><9af>: Abbrev Number: 17 (DW_TAG_structure_type)
    <9b0>   DW_AT_byte_size   : 16
    <9b1>   DW_AT_decl_file   : 12
    <9b2>   DW_AT_decl_line   : 198
    <9b3>   DW_AT_decl_column : 9
    <9b3>   DW_AT_sibling     : <0x9ec>
 <2><9b7>: Abbrev Number: 1 (DW_TAG_member)
    <9b8>   DW_AT_name        : (indirect string, offset: 0x1d10c): ClockSource
    <9bc>   DW_AT_decl_file   : 12
    <9bd>   DW_AT_decl_line   : 200
    <9be>   DW_AT_decl_column : 12
    <9bf>   DW_AT_type        : <0xc2>
    <9c3>   DW_AT_data_member_location: 0
 <2><9c4>: Abbrev Number: 1 (DW_TAG_member)
    <9c5>   DW_AT_name        : (indirect string, offset: 0x6a9b8): ClockPolarity
    <9c9>   DW_AT_decl_file   : 12
    <9ca>   DW_AT_decl_line   : 202
    <9cb>   DW_AT_decl_column : 12
    <9cc>   DW_AT_type        : <0xc2>
    <9d0>   DW_AT_data_member_location: 4
 <2><9d1>: Abbrev Number: 1 (DW_TAG_member)
    <9d2>   DW_AT_name        : (indirect string, offset: 0xaa4b8): ClockPrescaler
    <9d6>   DW_AT_decl_file   : 12
    <9d7>   DW_AT_decl_line   : 204
    <9d8>   DW_AT_decl_column : 12
    <9d9>   DW_AT_type        : <0xc2>
    <9dd>   DW_AT_data_member_location: 8
 <2><9de>: Abbrev Number: 1 (DW_TAG_member)
    <9df>   DW_AT_name        : (indirect string, offset: 0x7c297): ClockFilter
    <9e3>   DW_AT_decl_file   : 12
    <9e4>   DW_AT_decl_line   : 206
    <9e5>   DW_AT_decl_column : 12
    <9e6>   DW_AT_type        : <0xc2>
    <9ea>   DW_AT_data_member_location: 12
 <2><9eb>: Abbrev Number: 0
 <1><9ec>: Abbrev Number: 6 (DW_TAG_typedef)
    <9ed>   DW_AT_name        : (indirect string, offset: 0x5ec5): TIM_ClockConfigTypeDef
    <9f1>   DW_AT_decl_file   : 12
    <9f2>   DW_AT_decl_line   : 208
    <9f3>   DW_AT_decl_column : 3
    <9f4>   DW_AT_type        : <0x9af>
 <1><9f8>: Abbrev Number: 18 (DW_TAG_const_type)
    <9f9>   DW_AT_type        : <0x9ec>
 <1><9fd>: Abbrev Number: 17 (DW_TAG_structure_type)
    <9fe>   DW_AT_byte_size   : 8
    <9ff>   DW_AT_decl_file   : 12
    <a00>   DW_AT_decl_line   : 231
    <a01>   DW_AT_decl_column : 9
    <a01>   DW_AT_sibling     : <0xa20>
 <2><a05>: Abbrev Number: 1 (DW_TAG_member)
    <a06>   DW_AT_name        : (indirect string, offset: 0x71f26): MasterOutputTrigger
    <a0a>   DW_AT_decl_file   : 12
    <a0b>   DW_AT_decl_line   : 233
    <a0c>   DW_AT_decl_column : 13
    <a0d>   DW_AT_type        : <0xc2>
    <a11>   DW_AT_data_member_location: 0
 <2><a12>: Abbrev Number: 1 (DW_TAG_member)
    <a13>   DW_AT_name        : (indirect string, offset: 0x6574d): MasterSlaveMode
    <a17>   DW_AT_decl_file   : 12
    <a18>   DW_AT_decl_line   : 235
    <a19>   DW_AT_decl_column : 13
    <a1a>   DW_AT_type        : <0xc2>
    <a1e>   DW_AT_data_member_location: 4
 <2><a1f>: Abbrev Number: 0
 <1><a20>: Abbrev Number: 6 (DW_TAG_typedef)
    <a21>   DW_AT_name        : (indirect string, offset: 0x8b393): TIM_MasterConfigTypeDef
    <a25>   DW_AT_decl_file   : 12
    <a26>   DW_AT_decl_line   : 242
    <a27>   DW_AT_decl_column : 3
    <a28>   DW_AT_type        : <0x9fd>
 <1><a2c>: Abbrev Number: 18 (DW_TAG_const_type)
    <a2d>   DW_AT_type        : <0xa20>
 <1><a31>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <a32>   DW_AT_encoding    : 7	(unsigned)
    <a32>   DW_AT_byte_size   : 1
    <a32>   DW_AT_type        : <0x44>
    <a36>   DW_AT_decl_file   : 12
    <a36>   DW_AT_decl_line   : 291
    <a38>   DW_AT_decl_column : 1
    <a38>   DW_AT_sibling     : <0xa5b>
 <2><a3c>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a3d>   DW_AT_name        : (indirect string, offset: 0xa7c65): HAL_TIM_STATE_RESET
    <a41>   DW_AT_const_value : 0
 <2><a42>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a43>   DW_AT_name        : (indirect string, offset: 0x6a9c): HAL_TIM_STATE_READY
    <a47>   DW_AT_const_value : 1
 <2><a48>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a49>   DW_AT_name        : (indirect string, offset: 0x312b7): HAL_TIM_STATE_BUSY
    <a4d>   DW_AT_const_value : 2
 <2><a4e>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a4f>   DW_AT_name        : (indirect string, offset: 0xa163f): HAL_TIM_STATE_TIMEOUT
    <a53>   DW_AT_const_value : 3
 <2><a54>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a55>   DW_AT_name        : (indirect string, offset: 0x77080): HAL_TIM_STATE_ERROR
    <a59>   DW_AT_const_value : 4
 <2><a5a>: Abbrev Number: 0
 <1><a5b>: Abbrev Number: 15 (DW_TAG_typedef)
    <a5c>   DW_AT_name        : (indirect string, offset: 0x7e7ba): HAL_TIM_StateTypeDef
    <a60>   DW_AT_decl_file   : 12
    <a61>   DW_AT_decl_line   : 297
    <a63>   DW_AT_decl_column : 3
    <a63>   DW_AT_type        : <0xa31>
 <1><a67>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <a68>   DW_AT_type        : <0xa5b>
 <1><a6c>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <a6d>   DW_AT_encoding    : 7	(unsigned)
    <a6d>   DW_AT_byte_size   : 1
    <a6d>   DW_AT_type        : <0x44>
    <a71>   DW_AT_decl_file   : 12
    <a71>   DW_AT_decl_line   : 303
    <a73>   DW_AT_decl_column : 1
    <a73>   DW_AT_sibling     : <0xa8a>
 <2><a77>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a78>   DW_AT_name        : (indirect string, offset: 0x87e74): HAL_TIM_CHANNEL_STATE_RESET
    <a7c>   DW_AT_const_value : 0
 <2><a7d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a7e>   DW_AT_name        : (indirect string, offset: 0x71968): HAL_TIM_CHANNEL_STATE_READY
    <a82>   DW_AT_const_value : 1
 <2><a83>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a84>   DW_AT_name        : (indirect string, offset: 0x5cf8f): HAL_TIM_CHANNEL_STATE_BUSY
    <a88>   DW_AT_const_value : 2
 <2><a89>: Abbrev Number: 0
 <1><a8a>: Abbrev Number: 15 (DW_TAG_typedef)
    <a8b>   DW_AT_name        : (indirect string, offset: 0x29282): HAL_TIM_ChannelStateTypeDef
    <a8f>   DW_AT_decl_file   : 12
    <a90>   DW_AT_decl_line   : 307
    <a92>   DW_AT_decl_column : 3
    <a92>   DW_AT_type        : <0xa6c>
 <1><a96>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <a97>   DW_AT_type        : <0xa8a>
 <1><a9b>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <a9c>   DW_AT_encoding    : 7	(unsigned)
    <a9c>   DW_AT_byte_size   : 1
    <a9c>   DW_AT_type        : <0x44>
    <aa0>   DW_AT_decl_file   : 12
    <aa0>   DW_AT_decl_line   : 313
    <aa2>   DW_AT_decl_column : 1
    <aa2>   DW_AT_sibling     : <0xab9>
 <2><aa6>: Abbrev Number: 2 (DW_TAG_enumerator)
    <aa7>   DW_AT_name        : (indirect string, offset: 0x3bf9): HAL_DMA_BURST_STATE_RESET
    <aab>   DW_AT_const_value : 0
 <2><aac>: Abbrev Number: 2 (DW_TAG_enumerator)
    <aad>   DW_AT_name        : (indirect string, offset: 0x6a605): HAL_DMA_BURST_STATE_READY
    <ab1>   DW_AT_const_value : 1
 <2><ab2>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ab3>   DW_AT_name        : (indirect string, offset: 0x417d1): HAL_DMA_BURST_STATE_BUSY
    <ab7>   DW_AT_const_value : 2
 <2><ab8>: Abbrev Number: 0
 <1><ab9>: Abbrev Number: 15 (DW_TAG_typedef)
    <aba>   DW_AT_name        : (indirect string, offset: 0x1ab55): HAL_TIM_DMABurstStateTypeDef
    <abe>   DW_AT_decl_file   : 12
    <abf>   DW_AT_decl_line   : 317
    <ac1>   DW_AT_decl_column : 3
    <ac1>   DW_AT_type        : <0xa9b>
 <1><ac5>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <ac6>   DW_AT_type        : <0xab9>
 <1><aca>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <acb>   DW_AT_encoding    : 7	(unsigned)
    <acb>   DW_AT_byte_size   : 1
    <acb>   DW_AT_type        : <0x44>
    <acf>   DW_AT_decl_file   : 12
    <acf>   DW_AT_decl_line   : 323
    <ad1>   DW_AT_decl_column : 1
    <ad1>   DW_AT_sibling     : <0xaf4>
 <2><ad5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ad6>   DW_AT_name        : (indirect string, offset: 0x6c642): HAL_TIM_ACTIVE_CHANNEL_1
    <ada>   DW_AT_const_value : 1
 <2><adb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <adc>   DW_AT_name        : (indirect string, offset: 0x6c65b): HAL_TIM_ACTIVE_CHANNEL_2
    <ae0>   DW_AT_const_value : 2
 <2><ae1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ae2>   DW_AT_name        : (indirect string, offset: 0x6c674): HAL_TIM_ACTIVE_CHANNEL_3
    <ae6>   DW_AT_const_value : 4
 <2><ae7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ae8>   DW_AT_name        : (indirect string, offset: 0x6c68d): HAL_TIM_ACTIVE_CHANNEL_4
    <aec>   DW_AT_const_value : 8
 <2><aed>: Abbrev Number: 2 (DW_TAG_enumerator)
    <aee>   DW_AT_name        : (indirect string, offset: 0x4fcd4): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <af2>   DW_AT_const_value : 0
 <2><af3>: Abbrev Number: 0
 <1><af4>: Abbrev Number: 15 (DW_TAG_typedef)
    <af5>   DW_AT_name        : (indirect string, offset: 0x644e6): HAL_TIM_ActiveChannel
    <af9>   DW_AT_decl_file   : 12
    <afa>   DW_AT_decl_line   : 329
    <afc>   DW_AT_decl_column : 3
    <afc>   DW_AT_type        : <0xaca>
 <1><b00>: Abbrev Number: 19 (DW_TAG_structure_type)
    <b01>   DW_AT_byte_size   : 72
    <b02>   DW_AT_decl_file   : 12
    <b03>   DW_AT_decl_line   : 337
    <b05>   DW_AT_decl_column : 9
    <b05>   DW_AT_sibling     : <0xb88>
 <2><b09>: Abbrev Number: 4 (DW_TAG_member)
    <b0a>   DW_AT_name        : (indirect string, offset: 0xbaef5): Instance
    <b0e>   DW_AT_decl_file   : 12
    <b0f>   DW_AT_decl_line   : 340
    <b11>   DW_AT_decl_column : 39
    <b12>   DW_AT_type        : <0xb88>
    <b16>   DW_AT_data_member_location: 0
 <2><b17>: Abbrev Number: 4 (DW_TAG_member)
    <b18>   DW_AT_name        : (indirect string, offset: 0x9ed59): Init
    <b1c>   DW_AT_decl_file   : 12
    <b1d>   DW_AT_decl_line   : 341
    <b1f>   DW_AT_decl_column : 38
    <b20>   DW_AT_type        : <0x9a3>
    <b24>   DW_AT_data_member_location: 4
 <2><b25>: Abbrev Number: 4 (DW_TAG_member)
    <b26>   DW_AT_name        : (indirect string, offset: 0x644f4): Channel
    <b2a>   DW_AT_decl_file   : 12
    <b2b>   DW_AT_decl_line   : 342
    <b2d>   DW_AT_decl_column : 38
    <b2e>   DW_AT_type        : <0xaf4>
    <b32>   DW_AT_data_member_location: 28
 <2><b33>: Abbrev Number: 4 (DW_TAG_member)
    <b34>   DW_AT_name        : (indirect string, offset: 0x73d3a): hdma
    <b38>   DW_AT_decl_file   : 12
    <b39>   DW_AT_decl_line   : 343
    <b3b>   DW_AT_decl_column : 39
    <b3c>   DW_AT_type        : <0xb8d>
    <b40>   DW_AT_data_member_location: 32
 <2><b41>: Abbrev Number: 4 (DW_TAG_member)
    <b42>   DW_AT_name        : (indirect string, offset: 0x894bb): Lock
    <b46>   DW_AT_decl_file   : 12
    <b47>   DW_AT_decl_line   : 345
    <b49>   DW_AT_decl_column : 38
    <b4a>   DW_AT_type        : <0x5ba>
    <b4e>   DW_AT_data_member_location: 60
 <2><b4f>: Abbrev Number: 4 (DW_TAG_member)
    <b50>   DW_AT_name        : (indirect string, offset: 0x8290b): State
    <b54>   DW_AT_decl_file   : 12
    <b55>   DW_AT_decl_line   : 346
    <b57>   DW_AT_decl_column : 38
    <b58>   DW_AT_type        : <0xa67>
    <b5c>   DW_AT_data_member_location: 61
 <2><b5d>: Abbrev Number: 4 (DW_TAG_member)
    <b5e>   DW_AT_name        : (indirect string, offset: 0xc60ec): ChannelState
    <b62>   DW_AT_decl_file   : 12
    <b63>   DW_AT_decl_line   : 347
    <b65>   DW_AT_decl_column : 38
    <b66>   DW_AT_type        : <0xbb2>
    <b6a>   DW_AT_data_member_location: 62
 <2><b6b>: Abbrev Number: 4 (DW_TAG_member)
    <b6c>   DW_AT_name        : (indirect string, offset: 0xc66ad): ChannelNState
    <b70>   DW_AT_decl_file   : 12
    <b71>   DW_AT_decl_line   : 348
    <b73>   DW_AT_decl_column : 38
    <b74>   DW_AT_type        : <0xbb2>
    <b78>   DW_AT_data_member_location: 66
 <2><b79>: Abbrev Number: 4 (DW_TAG_member)
    <b7a>   DW_AT_name        : (indirect string, offset: 0xc5c95): DMABurstState
    <b7e>   DW_AT_decl_file   : 12
    <b7f>   DW_AT_decl_line   : 349
    <b81>   DW_AT_decl_column : 38
    <b82>   DW_AT_type        : <0xac5>
    <b86>   DW_AT_data_member_location: 70
 <2><b87>: Abbrev Number: 0
 <1><b88>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <b89>   DW_AT_byte_size   : 4
    <b89>   DW_AT_type        : <0x4e3>
 <1><b8d>: Abbrev Number: 26 (DW_TAG_array_type)
    <b8e>   DW_AT_type        : <0xb9d>
    <b92>   DW_AT_sibling     : <0xb9d>
 <2><b96>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <b97>   DW_AT_type        : <0x99>
    <b9b>   DW_AT_upper_bound : 6
 <2><b9c>: Abbrev Number: 0
 <1><b9d>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <b9e>   DW_AT_byte_size   : 4
    <b9e>   DW_AT_type        : <0x940>
 <1><ba2>: Abbrev Number: 26 (DW_TAG_array_type)
    <ba3>   DW_AT_type        : <0xa96>
    <ba7>   DW_AT_sibling     : <0xbb2>
 <2><bab>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <bac>   DW_AT_type        : <0x99>
    <bb0>   DW_AT_upper_bound : 3
 <2><bb1>: Abbrev Number: 0
 <1><bb2>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <bb3>   DW_AT_type        : <0xba2>
 <1><bb7>: Abbrev Number: 15 (DW_TAG_typedef)
    <bb8>   DW_AT_name        : (indirect string, offset: 0x42a7b): TIM_HandleTypeDef
    <bbc>   DW_AT_decl_file   : 12
    <bbd>   DW_AT_decl_line   : 380
    <bbf>   DW_AT_decl_column : 3
    <bbf>   DW_AT_type        : <0xb00>
 <1><bc3>: Abbrev Number: 17 (DW_TAG_structure_type)
    <bc4>   DW_AT_byte_size   : 28
    <bc5>   DW_AT_decl_file   : 13
    <bc6>   DW_AT_decl_line   : 46
    <bc7>   DW_AT_decl_column : 9
    <bc7>   DW_AT_sibling     : <0xc27>
 <2><bcb>: Abbrev Number: 1 (DW_TAG_member)
    <bcc>   DW_AT_name        : (indirect string, offset: 0xb0cf1): BaudRate
    <bd0>   DW_AT_decl_file   : 13
    <bd1>   DW_AT_decl_line   : 48
    <bd2>   DW_AT_decl_column : 12
    <bd3>   DW_AT_type        : <0xc2>
    <bd7>   DW_AT_data_member_location: 0
 <2><bd8>: Abbrev Number: 1 (DW_TAG_member)
    <bd9>   DW_AT_name        : (indirect string, offset: 0x50d30): WordLength
    <bdd>   DW_AT_decl_file   : 13
    <bde>   DW_AT_decl_line   : 54
    <bdf>   DW_AT_decl_column : 12
    <be0>   DW_AT_type        : <0xc2>
    <be4>   DW_AT_data_member_location: 4
 <2><be5>: Abbrev Number: 1 (DW_TAG_member)
    <be6>   DW_AT_name        : (indirect string, offset: 0xb10e3): StopBits
    <bea>   DW_AT_decl_file   : 13
    <beb>   DW_AT_decl_line   : 57
    <bec>   DW_AT_decl_column : 12
    <bed>   DW_AT_type        : <0xc2>
    <bf1>   DW_AT_data_member_location: 8
 <2><bf2>: Abbrev Number: 1 (DW_TAG_member)
    <bf3>   DW_AT_name        : (indirect string, offset: 0x45c12): Parity
    <bf7>   DW_AT_decl_file   : 13
    <bf8>   DW_AT_decl_line   : 60
    <bf9>   DW_AT_decl_column : 12
    <bfa>   DW_AT_type        : <0xc2>
    <bfe>   DW_AT_data_member_location: 12
 <2><bff>: Abbrev Number: 1 (DW_TAG_member)
    <c00>   DW_AT_name        : (indirect string, offset: 0xc5a4d): Mode
    <c04>   DW_AT_decl_file   : 13
    <c05>   DW_AT_decl_line   : 67
    <c06>   DW_AT_decl_column : 12
    <c07>   DW_AT_type        : <0xc2>
    <c0b>   DW_AT_data_member_location: 16
 <2><c0c>: Abbrev Number: 1 (DW_TAG_member)
    <c0d>   DW_AT_name        : (indirect string, offset: 0x167f8): HwFlowCtl
    <c11>   DW_AT_decl_file   : 13
    <c12>   DW_AT_decl_line   : 70
    <c13>   DW_AT_decl_column : 12
    <c14>   DW_AT_type        : <0xc2>
    <c18>   DW_AT_data_member_location: 20
 <2><c19>: Abbrev Number: 1 (DW_TAG_member)
    <c1a>   DW_AT_name        : (indirect string, offset: 0xa1ee0): OverSampling
    <c1e>   DW_AT_decl_file   : 13
    <c1f>   DW_AT_decl_line   : 73
    <c20>   DW_AT_decl_column : 12
    <c21>   DW_AT_type        : <0xc2>
    <c25>   DW_AT_data_member_location: 24
 <2><c26>: Abbrev Number: 0
 <1><c27>: Abbrev Number: 6 (DW_TAG_typedef)
    <c28>   DW_AT_name        : (indirect string, offset: 0x36bc1): UART_InitTypeDef
    <c2c>   DW_AT_decl_file   : 13
    <c2d>   DW_AT_decl_line   : 75
    <c2e>   DW_AT_decl_column : 3
    <c2f>   DW_AT_type        : <0xbc3>
 <1><c33>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <c34>   DW_AT_encoding    : 7	(unsigned)
    <c35>   DW_AT_byte_size   : 1
    <c36>   DW_AT_type        : <0x44>
    <c3a>   DW_AT_decl_file   : 13
    <c3b>   DW_AT_decl_line   : 117
    <c3c>   DW_AT_decl_column : 1
    <c3d>   DW_AT_sibling     : <0xc72>
 <2><c41>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c42>   DW_AT_name        : (indirect string, offset: 0x71619): HAL_UART_STATE_RESET
    <c46>   DW_AT_const_value : 0
 <2><c47>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c48>   DW_AT_name        : (indirect string, offset: 0x5dc11): HAL_UART_STATE_READY
    <c4c>   DW_AT_const_value : 32
 <2><c4d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c4e>   DW_AT_name        : (indirect string, offset: 0xab0e8): HAL_UART_STATE_BUSY
    <c52>   DW_AT_const_value : 36
 <2><c53>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c54>   DW_AT_name        : (indirect string, offset: 0x2305): HAL_UART_STATE_BUSY_TX
    <c58>   DW_AT_const_value : 33
 <2><c59>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c5a>   DW_AT_name        : (indirect string, offset: 0x16f9): HAL_UART_STATE_BUSY_RX
    <c5e>   DW_AT_const_value : 34
 <2><c5f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c60>   DW_AT_name        : (indirect string, offset: 0x2bec8): HAL_UART_STATE_BUSY_TX_RX
    <c64>   DW_AT_const_value : 35
 <2><c65>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c66>   DW_AT_name        : (indirect string, offset: 0x5daa9): HAL_UART_STATE_TIMEOUT
    <c6a>   DW_AT_const_value : 160
 <2><c6b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c6c>   DW_AT_name        : (indirect string, offset: 0x7a48b): HAL_UART_STATE_ERROR
    <c70>   DW_AT_const_value : 224
 <2><c71>: Abbrev Number: 0
 <1><c72>: Abbrev Number: 6 (DW_TAG_typedef)
    <c73>   DW_AT_name        : (indirect string, offset: 0x3b609): HAL_UART_StateTypeDef
    <c77>   DW_AT_decl_file   : 13
    <c78>   DW_AT_decl_line   : 135
    <c79>   DW_AT_decl_column : 3
    <c7a>   DW_AT_type        : <0xc33>
 <1><c7e>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <c7f>   DW_AT_type        : <0xc72>
 <1><c83>: Abbrev Number: 6 (DW_TAG_typedef)
    <c84>   DW_AT_name        : (indirect string, offset: 0x4f48e): HAL_UART_RxTypeTypeDef
    <c88>   DW_AT_decl_file   : 13
    <c89>   DW_AT_decl_line   : 144
    <c8a>   DW_AT_decl_column : 18
    <c8b>   DW_AT_type        : <0xc2>
 <1><c8f>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <c90>   DW_AT_type        : <0xc83>
 <1><c94>: Abbrev Number: 6 (DW_TAG_typedef)
    <c95>   DW_AT_name        : (indirect string, offset: 0x189ac): HAL_UART_RxEventTypeTypeDef
    <c99>   DW_AT_decl_file   : 13
    <c9a>   DW_AT_decl_line   : 155
    <c9b>   DW_AT_decl_column : 18
    <c9c>   DW_AT_type        : <0xc2>
 <1><ca0>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <ca1>   DW_AT_type        : <0xc94>
 <1><ca5>: Abbrev Number: 32 (DW_TAG_structure_type)
    <ca6>   DW_AT_name        : (indirect string, offset: 0x6fb76): __UART_HandleTypeDef
    <caa>   DW_AT_byte_size   : 72
    <cab>   DW_AT_decl_file   : 13
    <cac>   DW_AT_decl_line   : 160
    <cad>   DW_AT_decl_column : 16
    <cad>   DW_AT_sibling     : <0xd82>
 <2><cb1>: Abbrev Number: 1 (DW_TAG_member)
    <cb2>   DW_AT_name        : (indirect string, offset: 0xbaef5): Instance
    <cb6>   DW_AT_decl_file   : 13
    <cb7>   DW_AT_decl_line   : 162
    <cb8>   DW_AT_decl_column : 34
    <cb9>   DW_AT_type        : <0xd82>
    <cbd>   DW_AT_data_member_location: 0
 <2><cbe>: Abbrev Number: 1 (DW_TAG_member)
    <cbf>   DW_AT_name        : (indirect string, offset: 0x9ed59): Init
    <cc3>   DW_AT_decl_file   : 13
    <cc4>   DW_AT_decl_line   : 164
    <cc5>   DW_AT_decl_column : 33
    <cc6>   DW_AT_type        : <0xc27>
    <cca>   DW_AT_data_member_location: 4
 <2><ccb>: Abbrev Number: 1 (DW_TAG_member)
    <ccc>   DW_AT_name        : (indirect string, offset: 0x5c605): pTxBuffPtr
    <cd0>   DW_AT_decl_file   : 13
    <cd1>   DW_AT_decl_line   : 166
    <cd2>   DW_AT_decl_column : 34
    <cd3>   DW_AT_type        : <0xd87>
    <cd7>   DW_AT_data_member_location: 32
 <2><cd8>: Abbrev Number: 1 (DW_TAG_member)
    <cd9>   DW_AT_name        : (indirect string, offset: 0x518cb): TxXferSize
    <cdd>   DW_AT_decl_file   : 13
    <cde>   DW_AT_decl_line   : 168
    <cdf>   DW_AT_decl_column : 33
    <ce0>   DW_AT_type        : <0xb1>
    <ce4>   DW_AT_data_member_location: 36
 <2><ce5>: Abbrev Number: 1 (DW_TAG_member)
    <ce6>   DW_AT_name        : (indirect string, offset: 0x5d940): TxXferCount
    <cea>   DW_AT_decl_file   : 13
    <ceb>   DW_AT_decl_line   : 170
    <cec>   DW_AT_decl_column : 33
    <ced>   DW_AT_type        : <0xbd>
    <cf1>   DW_AT_data_member_location: 38
 <2><cf2>: Abbrev Number: 1 (DW_TAG_member)
    <cf3>   DW_AT_name        : (indirect string, offset: 0xb39d2): pRxBuffPtr
    <cf7>   DW_AT_decl_file   : 13
    <cf8>   DW_AT_decl_line   : 172
    <cf9>   DW_AT_decl_column : 34
    <cfa>   DW_AT_type        : <0xd8c>
    <cfe>   DW_AT_data_member_location: 40
 <2><cff>: Abbrev Number: 1 (DW_TAG_member)
    <d00>   DW_AT_name        : (indirect string, offset: 0x60031): RxXferSize
    <d04>   DW_AT_decl_file   : 13
    <d05>   DW_AT_decl_line   : 174
    <d06>   DW_AT_decl_column : 33
    <d07>   DW_AT_type        : <0xb1>
    <d0b>   DW_AT_data_member_location: 44
 <2><d0c>: Abbrev Number: 1 (DW_TAG_member)
    <d0d>   DW_AT_name        : (indirect string, offset: 0x73f4c): RxXferCount
    <d11>   DW_AT_decl_file   : 13
    <d12>   DW_AT_decl_line   : 176
    <d13>   DW_AT_decl_column : 33
    <d14>   DW_AT_type        : <0xbd>
    <d18>   DW_AT_data_member_location: 46
 <2><d19>: Abbrev Number: 1 (DW_TAG_member)
    <d1a>   DW_AT_name        : (indirect string, offset: 0x96da4): ReceptionType
    <d1e>   DW_AT_decl_file   : 13
    <d1f>   DW_AT_decl_line   : 178
    <d20>   DW_AT_decl_column : 31
    <d21>   DW_AT_type        : <0xc8f>
    <d25>   DW_AT_data_member_location: 48
 <2><d26>: Abbrev Number: 1 (DW_TAG_member)
    <d27>   DW_AT_name        : (indirect string, offset: 0xc6899): RxEventType
    <d2b>   DW_AT_decl_file   : 13
    <d2c>   DW_AT_decl_line   : 180
    <d2d>   DW_AT_decl_column : 36
    <d2e>   DW_AT_type        : <0xca0>
    <d32>   DW_AT_data_member_location: 52
 <2><d33>: Abbrev Number: 1 (DW_TAG_member)
    <d34>   DW_AT_name        : (indirect string, offset: 0xbc507): hdmatx
    <d38>   DW_AT_decl_file   : 13
    <d39>   DW_AT_decl_line   : 182
    <d3a>   DW_AT_decl_column : 34
    <d3b>   DW_AT_type        : <0xb9d>
    <d3f>   DW_AT_data_member_location: 56
 <2><d40>: Abbrev Number: 1 (DW_TAG_member)
    <d41>   DW_AT_name        : (indirect string, offset: 0xbb831): hdmarx
    <d45>   DW_AT_decl_file   : 13
    <d46>   DW_AT_decl_line   : 184
    <d47>   DW_AT_decl_column : 34
    <d48>   DW_AT_type        : <0xb9d>
    <d4c>   DW_AT_data_member_location: 60
 <2><d4d>: Abbrev Number: 1 (DW_TAG_member)
    <d4e>   DW_AT_name        : (indirect string, offset: 0x894bb): Lock
    <d52>   DW_AT_decl_file   : 13
    <d53>   DW_AT_decl_line   : 186
    <d54>   DW_AT_decl_column : 33
    <d55>   DW_AT_type        : <0x5ba>
    <d59>   DW_AT_data_member_location: 64
 <2><d5a>: Abbrev Number: 1 (DW_TAG_member)
    <d5b>   DW_AT_name        : (indirect string, offset: 0x4eaee): gState
    <d5f>   DW_AT_decl_file   : 13
    <d60>   DW_AT_decl_line   : 188
    <d61>   DW_AT_decl_column : 33
    <d62>   DW_AT_type        : <0xc7e>
    <d66>   DW_AT_data_member_location: 65
 <2><d67>: Abbrev Number: 1 (DW_TAG_member)
    <d68>   DW_AT_name        : (indirect string, offset: 0x595c): RxState
    <d6c>   DW_AT_decl_file   : 13
    <d6d>   DW_AT_decl_line   : 192
    <d6e>   DW_AT_decl_column : 33
    <d6f>   DW_AT_type        : <0xc7e>
    <d73>   DW_AT_data_member_location: 66
 <2><d74>: Abbrev Number: 1 (DW_TAG_member)
    <d75>   DW_AT_name        : (indirect string, offset: 0xbd10b): ErrorCode
    <d79>   DW_AT_decl_file   : 13
    <d7a>   DW_AT_decl_line   : 195
    <d7b>   DW_AT_decl_column : 33
    <d7c>   DW_AT_type        : <0xce>
    <d80>   DW_AT_data_member_location: 68
 <2><d81>: Abbrev Number: 0
 <1><d82>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <d83>   DW_AT_byte_size   : 4
    <d83>   DW_AT_type        : <0x54d>
 <1><d87>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <d88>   DW_AT_byte_size   : 4
    <d88>   DW_AT_type        : <0xac>
 <1><d8c>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <d8d>   DW_AT_byte_size   : 4
    <d8d>   DW_AT_type        : <0xa0>
 <1><d91>: Abbrev Number: 6 (DW_TAG_typedef)
    <d92>   DW_AT_name        : (indirect string, offset: 0x6fb78): UART_HandleTypeDef
    <d96>   DW_AT_decl_file   : 13
    <d97>   DW_AT_decl_line   : 213
    <d98>   DW_AT_decl_column : 3
    <d99>   DW_AT_type        : <0xca5>
 <1><d9d>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <d9e>   DW_AT_byte_size   : 4
    <d9e>   DW_AT_type        : <0xda2>
 <1><da2>: Abbrev Number: 37 (DW_TAG_subroutine_type)
    <da3>   DW_AT_prototyped  : 1
    <da3>   DW_AT_sibling     : <0xdad>
 <2><da7>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <da8>   DW_AT_type        : <0x929>
 <2><dac>: Abbrev Number: 0
 <1><dad>: Abbrev Number: 6 (DW_TAG_typedef)
    <dae>   DW_AT_name        : (indirect string, offset: 0x6a318): StackType_t
    <db2>   DW_AT_decl_file   : 14
    <db3>   DW_AT_decl_line   : 55
    <db4>   DW_AT_decl_column : 24
    <db5>   DW_AT_type        : <0xc2>
 <1><db9>: Abbrev Number: 6 (DW_TAG_typedef)
    <dba>   DW_AT_name        : (indirect string, offset: 0x1536): UBaseType_t
    <dbe>   DW_AT_decl_file   : 14
    <dbf>   DW_AT_decl_line   : 57
    <dc0>   DW_AT_decl_column : 23
    <dc1>   DW_AT_type        : <0x78>
 <1><dc5>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <dc6>   DW_AT_type        : <0xdb9>
 <1><dca>: Abbrev Number: 18 (DW_TAG_const_type)
    <dcb>   DW_AT_type        : <0xdb9>
 <1><dcf>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <dd0>   DW_AT_byte_size   : 4
    <dd0>   DW_AT_type        : <0xdd4>
 <1><dd4>: Abbrev Number: 16 (DW_TAG_base_type)
    <dd5>   DW_AT_byte_size   : 1
    <dd6>   DW_AT_encoding    : 8	(unsigned char)
    <dd7>   DW_AT_name        : (indirect string, offset: 0x3efb7): char
 <1><ddb>: Abbrev Number: 18 (DW_TAG_const_type)
    <ddc>   DW_AT_type        : <0xdd4>
 <1><de0>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <de1>   DW_AT_byte_size   : 4
    <de1>   DW_AT_type        : <0xddb>
 <1><de5>: Abbrev Number: 6 (DW_TAG_typedef)
    <de6>   DW_AT_name        : (indirect string, offset: 0x962ba): TaskHandle_t
    <dea>   DW_AT_decl_file   : 15
    <deb>   DW_AT_decl_line   : 70
    <dec>   DW_AT_decl_column : 37
    <ded>   DW_AT_type        : <0xdf1>
 <1><df1>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <df2>   DW_AT_byte_size   : 4
    <df2>   DW_AT_type        : <0xdf6>
 <1><df6>: Abbrev Number: 46 (DW_TAG_structure_type)
    <df7>   DW_AT_name        : (indirect string, offset: 0xa3e5c): tskTaskControlBlock
    <dfb>   DW_AT_declaration : 1
 <1><dfb>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <dfc>   DW_AT_encoding    : 7	(unsigned)
    <dfd>   DW_AT_byte_size   : 1
    <dfe>   DW_AT_type        : <0x44>
    <e02>   DW_AT_decl_file   : 15
    <e03>   DW_AT_decl_line   : 80
    <e04>   DW_AT_decl_column : 1
    <e05>   DW_AT_sibling     : <0xe2e>
 <2><e09>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e0a>   DW_AT_name        : (indirect string, offset: 0x57aac): eRunning
    <e0e>   DW_AT_const_value : 0
 <2><e0f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e10>   DW_AT_name        : (indirect string, offset: 0x4b86f): eReady
    <e14>   DW_AT_const_value : 1
 <2><e15>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e16>   DW_AT_name        : (indirect string, offset: 0x41dab): eBlocked
    <e1a>   DW_AT_const_value : 2
 <2><e1b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e1c>   DW_AT_name        : (indirect string, offset: 0x7003e): eSuspended
    <e20>   DW_AT_const_value : 3
 <2><e21>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e22>   DW_AT_name        : (indirect string, offset: 0x8e50f): eDeleted
    <e26>   DW_AT_const_value : 4
 <2><e27>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e28>   DW_AT_name        : (indirect string, offset: 0x1fa5f): eInvalid
    <e2c>   DW_AT_const_value : 5
 <2><e2d>: Abbrev Number: 0
 <1><e2e>: Abbrev Number: 6 (DW_TAG_typedef)
    <e2f>   DW_AT_name        : (indirect string, offset: 0x4300): eTaskState
    <e33>   DW_AT_decl_file   : 15
    <e34>   DW_AT_decl_line   : 87
    <e35>   DW_AT_decl_column : 3
    <e36>   DW_AT_type        : <0xdfb>
 <1><e3a>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <e3b>   DW_AT_byte_size   : 4
    <e3b>   DW_AT_type        : <0xdad>
 <1><e3f>: Abbrev Number: 32 (DW_TAG_structure_type)
    <e40>   DW_AT_name        : (indirect string, offset: 0x8540b): xTASK_STATUS
    <e44>   DW_AT_byte_size   : 36
    <e45>   DW_AT_decl_file   : 15
    <e46>   DW_AT_decl_line   : 137
    <e47>   DW_AT_decl_column : 16
    <e47>   DW_AT_sibling     : <0xec1>
 <2><e4b>: Abbrev Number: 1 (DW_TAG_member)
    <e4c>   DW_AT_name        : (indirect string, offset: 0x7ee45): xHandle
    <e50>   DW_AT_decl_file   : 15
    <e51>   DW_AT_decl_line   : 139
    <e52>   DW_AT_decl_column : 15
    <e53>   DW_AT_type        : <0xde5>
    <e57>   DW_AT_data_member_location: 0
 <2><e58>: Abbrev Number: 1 (DW_TAG_member)
    <e59>   DW_AT_name        : (indirect string, offset: 0x427dd): pcTaskName
    <e5d>   DW_AT_decl_file   : 15
    <e5e>   DW_AT_decl_line   : 140
    <e5f>   DW_AT_decl_column : 14
    <e60>   DW_AT_type        : <0xde0>
    <e64>   DW_AT_data_member_location: 4
 <2><e65>: Abbrev Number: 1 (DW_TAG_member)
    <e66>   DW_AT_name        : (indirect string, offset: 0xcb02e): xTaskNumber
    <e6a>   DW_AT_decl_file   : 15
    <e6b>   DW_AT_decl_line   : 141
    <e6c>   DW_AT_decl_column : 14
    <e6d>   DW_AT_type        : <0xdb9>
    <e71>   DW_AT_data_member_location: 8
 <2><e72>: Abbrev Number: 1 (DW_TAG_member)
    <e73>   DW_AT_name        : (indirect string, offset: 0x1b88): eCurrentState
    <e77>   DW_AT_decl_file   : 15
    <e78>   DW_AT_decl_line   : 142
    <e79>   DW_AT_decl_column : 13
    <e7a>   DW_AT_type        : <0xe2e>
    <e7e>   DW_AT_data_member_location: 12
 <2><e7f>: Abbrev Number: 1 (DW_TAG_member)
    <e80>   DW_AT_name        : (indirect string, offset: 0x8fdf): uxCurrentPriority
    <e84>   DW_AT_decl_file   : 15
    <e85>   DW_AT_decl_line   : 143
    <e86>   DW_AT_decl_column : 14
    <e87>   DW_AT_type        : <0xdb9>
    <e8b>   DW_AT_data_member_location: 16
 <2><e8c>: Abbrev Number: 1 (DW_TAG_member)
    <e8d>   DW_AT_name        : (indirect string, offset: 0x778cd): uxBasePriority
    <e91>   DW_AT_decl_file   : 15
    <e92>   DW_AT_decl_line   : 144
    <e93>   DW_AT_decl_column : 14
    <e94>   DW_AT_type        : <0xdb9>
    <e98>   DW_AT_data_member_location: 20
 <2><e99>: Abbrev Number: 1 (DW_TAG_member)
    <e9a>   DW_AT_name        : (indirect string, offset: 0x84570): ulRunTimeCounter
    <e9e>   DW_AT_decl_file   : 15
    <e9f>   DW_AT_decl_line   : 145
    <ea0>   DW_AT_decl_column : 11
    <ea1>   DW_AT_type        : <0xc2>
    <ea5>   DW_AT_data_member_location: 24
 <2><ea6>: Abbrev Number: 1 (DW_TAG_member)
    <ea7>   DW_AT_name        : (indirect string, offset: 0x5d391): pxStackBase
    <eab>   DW_AT_decl_file   : 15
    <eac>   DW_AT_decl_line   : 146
    <ead>   DW_AT_decl_column : 15
    <eae>   DW_AT_type        : <0xe3a>
    <eb2>   DW_AT_data_member_location: 28
 <2><eb3>: Abbrev Number: 1 (DW_TAG_member)
    <eb4>   DW_AT_name        : (indirect string, offset: 0x3fc70): usStackHighWaterMark
    <eb8>   DW_AT_decl_file   : 15
    <eb9>   DW_AT_decl_line   : 147
    <eba>   DW_AT_decl_column : 25
    <ebb>   DW_AT_type        : <0xb1>
    <ebf>   DW_AT_data_member_location: 32
 <2><ec0>: Abbrev Number: 0
 <1><ec1>: Abbrev Number: 6 (DW_TAG_typedef)
    <ec2>   DW_AT_name        : (indirect string, offset: 0x5b75d): TaskStatus_t
    <ec6>   DW_AT_decl_file   : 15
    <ec7>   DW_AT_decl_line   : 148
    <ec8>   DW_AT_decl_column : 3
    <ec9>   DW_AT_type        : <0xe3f>
 <1><ecd>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <ece>   DW_AT_encoding    : 5	(signed)
    <ecf>   DW_AT_byte_size   : 4
    <ed0>   DW_AT_type        : <0x92>
    <ed4>   DW_AT_decl_file   : 16
    <ed5>   DW_AT_decl_line   : 82
    <ed6>   DW_AT_decl_column : 14
    <ed7>   DW_AT_sibling     : <0x1019>
 <2><edb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <edc>   DW_AT_name        : (indirect string, offset: 0x39cf4): osPriorityNone
    <ee0>   DW_AT_const_value : 0
 <2><ee1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ee2>   DW_AT_name        : (indirect string, offset: 0xa782f): osPriorityIdle
    <ee6>   DW_AT_const_value : 1
 <2><ee7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ee8>   DW_AT_name        : (indirect string, offset: 0xb2265): osPriorityLow
    <eec>   DW_AT_const_value : 8
 <2><eed>: Abbrev Number: 2 (DW_TAG_enumerator)
    <eee>   DW_AT_name        : (indirect string, offset: 0xb77c3): osPriorityLow1
    <ef2>   DW_AT_const_value : 9
 <2><ef3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ef4>   DW_AT_name        : (indirect string, offset: 0xb77d2): osPriorityLow2
    <ef8>   DW_AT_const_value : 10
 <2><ef9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <efa>   DW_AT_name        : (indirect string, offset: 0xb77e1): osPriorityLow3
    <efe>   DW_AT_const_value : 11
 <2><eff>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f00>   DW_AT_name        : (indirect string, offset: 0xb77f0): osPriorityLow4
    <f04>   DW_AT_const_value : 12
 <2><f05>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f06>   DW_AT_name        : (indirect string, offset: 0xb77ff): osPriorityLow5
    <f0a>   DW_AT_const_value : 13
 <2><f0b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f0c>   DW_AT_name        : (indirect string, offset: 0xb780e): osPriorityLow6
    <f10>   DW_AT_const_value : 14
 <2><f11>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f12>   DW_AT_name        : (indirect string, offset: 0xb781d): osPriorityLow7
    <f16>   DW_AT_const_value : 15
 <2><f17>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f18>   DW_AT_name        : (indirect string, offset: 0xb9dbe): osPriorityBelowNormal
    <f1c>   DW_AT_const_value : 16
 <2><f1d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f1e>   DW_AT_name        : (indirect string, offset: 0x8322c): osPriorityBelowNormal1
    <f22>   DW_AT_const_value : 17
 <2><f23>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f24>   DW_AT_name        : (indirect string, offset: 0xa38f1): osPriorityBelowNormal2
    <f28>   DW_AT_const_value : 18
 <2><f29>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f2a>   DW_AT_name        : (indirect string, offset: 0x73dbe): osPriorityBelowNormal3
    <f2e>   DW_AT_const_value : 19
 <2><f2f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f30>   DW_AT_name        : (indirect string, offset: 0xa392a): osPriorityBelowNormal4
    <f34>   DW_AT_const_value : 20
 <2><f35>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f36>   DW_AT_name        : (indirect string, offset: 0xa3941): osPriorityBelowNormal5
    <f3a>   DW_AT_const_value : 21
 <2><f3b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f3c>   DW_AT_name        : (indirect string, offset: 0xa3958): osPriorityBelowNormal6
    <f40>   DW_AT_const_value : 22
 <2><f41>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f42>   DW_AT_name        : (indirect string, offset: 0xa396f): osPriorityBelowNormal7
    <f46>   DW_AT_const_value : 23
 <2><f47>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f48>   DW_AT_name        : (indirect string, offset: 0x9d3ea): osPriorityNormal
    <f4c>   DW_AT_const_value : 24
 <2><f4d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f4e>   DW_AT_name        : (indirect string, offset: 0x1f7ea): osPriorityNormal1
    <f52>   DW_AT_const_value : 25
 <2><f53>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f54>   DW_AT_name        : (indirect string, offset: 0x1f7fc): osPriorityNormal2
    <f58>   DW_AT_const_value : 26
 <2><f59>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f5a>   DW_AT_name        : (indirect string, offset: 0x1f80e): osPriorityNormal3
    <f5e>   DW_AT_const_value : 27
 <2><f5f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f60>   DW_AT_name        : (indirect string, offset: 0x1f820): osPriorityNormal4
    <f64>   DW_AT_const_value : 28
 <2><f65>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f66>   DW_AT_name        : (indirect string, offset: 0x9254a): osPriorityNormal5
    <f6a>   DW_AT_const_value : 29
 <2><f6b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f6c>   DW_AT_name        : (indirect string, offset: 0x1f850): osPriorityNormal6
    <f70>   DW_AT_const_value : 30
 <2><f71>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f72>   DW_AT_name        : (indirect string, offset: 0x1f862): osPriorityNormal7
    <f76>   DW_AT_const_value : 31
 <2><f77>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f78>   DW_AT_name        : (indirect string, offset: 0x7b82d): osPriorityAboveNormal
    <f7c>   DW_AT_const_value : 32
 <2><f7d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f7e>   DW_AT_name        : (indirect string, offset: 0xc0f42): osPriorityAboveNormal1
    <f82>   DW_AT_const_value : 33
 <2><f83>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f84>   DW_AT_name        : (indirect string, offset: 0xc0f59): osPriorityAboveNormal2
    <f88>   DW_AT_const_value : 34
 <2><f89>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f8a>   DW_AT_name        : (indirect string, offset: 0xc0f70): osPriorityAboveNormal3
    <f8e>   DW_AT_const_value : 35
 <2><f8f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f90>   DW_AT_name        : (indirect string, offset: 0xc0f87): osPriorityAboveNormal4
    <f94>   DW_AT_const_value : 36
 <2><f95>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f96>   DW_AT_name        : (indirect string, offset: 0xaaf5e): osPriorityAboveNormal5
    <f9a>   DW_AT_const_value : 37
 <2><f9b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f9c>   DW_AT_name        : (indirect string, offset: 0xc0fb4): osPriorityAboveNormal6
    <fa0>   DW_AT_const_value : 38
 <2><fa1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fa2>   DW_AT_name        : (indirect string, offset: 0xc0fcb): osPriorityAboveNormal7
    <fa6>   DW_AT_const_value : 39
 <2><fa7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fa8>   DW_AT_name        : (indirect string, offset: 0x25fc1): osPriorityHigh
    <fac>   DW_AT_const_value : 40
 <2><fad>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fae>   DW_AT_name        : (indirect string, offset: 0x7f911): osPriorityHigh1
    <fb2>   DW_AT_const_value : 41
 <2><fb3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fb4>   DW_AT_name        : (indirect string, offset: 0x7f921): osPriorityHigh2
    <fb8>   DW_AT_const_value : 42
 <2><fb9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fba>   DW_AT_name        : (indirect string, offset: 0x7f931): osPriorityHigh3
    <fbe>   DW_AT_const_value : 43
 <2><fbf>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fc0>   DW_AT_name        : (indirect string, offset: 0x7f941): osPriorityHigh4
    <fc4>   DW_AT_const_value : 44
 <2><fc5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fc6>   DW_AT_name        : (indirect string, offset: 0x3a97): osPriorityHigh5
    <fca>   DW_AT_const_value : 45
 <2><fcb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fcc>   DW_AT_name        : (indirect string, offset: 0x7f97d): osPriorityHigh6
    <fd0>   DW_AT_const_value : 46
 <2><fd1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fd2>   DW_AT_name        : (indirect string, offset: 0x7f98d): osPriorityHigh7
    <fd6>   DW_AT_const_value : 47
 <2><fd7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fd8>   DW_AT_name        : (indirect string, offset: 0xaf434): osPriorityRealtime
    <fdc>   DW_AT_const_value : 48
 <2><fdd>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fde>   DW_AT_name        : (indirect string, offset: 0x78e67): osPriorityRealtime1
    <fe2>   DW_AT_const_value : 49
 <2><fe3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fe4>   DW_AT_name        : (indirect string, offset: 0x78e7b): osPriorityRealtime2
    <fe8>   DW_AT_const_value : 50
 <2><fe9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fea>   DW_AT_name        : (indirect string, offset: 0x78e8f): osPriorityRealtime3
    <fee>   DW_AT_const_value : 51
 <2><fef>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ff0>   DW_AT_name        : (indirect string, offset: 0x78ea3): osPriorityRealtime4
    <ff4>   DW_AT_const_value : 52
 <2><ff5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ff6>   DW_AT_name        : (indirect string, offset: 0x78eb7): osPriorityRealtime5
    <ffa>   DW_AT_const_value : 53
 <2><ffb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ffc>   DW_AT_name        : (indirect string, offset: 0x78ecb): osPriorityRealtime6
    <1000>   DW_AT_const_value : 54
 <2><1001>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1002>   DW_AT_name        : (indirect string, offset: 0x78edf): osPriorityRealtime7
    <1006>   DW_AT_const_value : 55
 <2><1007>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1008>   DW_AT_name        : (indirect string, offset: 0x6ba88): osPriorityISR
    <100c>   DW_AT_const_value : 56
 <2><100d>: Abbrev Number: 22 (DW_TAG_enumerator)
    <100e>   DW_AT_name        : (indirect string, offset: 0xaabf9): osPriorityError
    <1012>   DW_AT_const_value : -1
 <2><1013>: Abbrev Number: 38 (DW_TAG_enumerator)
    <1014>   DW_AT_name        : (indirect string, offset: 0xb7e30): osPriorityReserved
    <1018>   DW_AT_const_value : 2147483647
 <2><1018>: Abbrev Number: 0
 <1><1019>: Abbrev Number: 6 (DW_TAG_typedef)
    <101a>   DW_AT_name        : (indirect string, offset: 0x8e15b): osPriority_t
    <101e>   DW_AT_decl_file   : 16
    <101f>   DW_AT_decl_line   : 136
    <1020>   DW_AT_decl_column : 3
    <1021>   DW_AT_type        : <0xecd>
 <1><1025>: Abbrev Number: 6 (DW_TAG_typedef)
    <1026>   DW_AT_name        : (indirect string, offset: 0x68649): osThreadFunc_t
    <102a>   DW_AT_decl_file   : 16
    <102b>   DW_AT_decl_line   : 139
    <102c>   DW_AT_decl_column : 16
    <102d>   DW_AT_type        : <0xd9d>
 <1><1031>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <1032>   DW_AT_encoding    : 5	(signed)
    <1033>   DW_AT_byte_size   : 4
    <1034>   DW_AT_type        : <0x92>
    <1038>   DW_AT_decl_file   : 16
    <1039>   DW_AT_decl_line   : 176
    <103a>   DW_AT_decl_column : 14
    <103b>   DW_AT_sibling     : <0x106f>
 <2><103f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1040>   DW_AT_name        : (indirect string, offset: 0x94aa1): osOK
    <1044>   DW_AT_const_value : 0
 <2><1045>: Abbrev Number: 22 (DW_TAG_enumerator)
    <1046>   DW_AT_name        : (indirect string, offset: 0x5932c): osError
    <104a>   DW_AT_const_value : -1
 <2><104b>: Abbrev Number: 22 (DW_TAG_enumerator)
