Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x157a (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 39 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x2ed73): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -Og -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0xac07e): ../Core/Src/main.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x2aa1c): /home/lth/src/stm32fun/stm32world_freertos/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 9 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x60ad8): signed char
 <1><31>: Abbrev Number: 4 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x38567): __uint8_t
    <36>   DW_AT_decl_file   : 3
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 9 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0xba917): unsigned char
 <1><44>: Abbrev Number: 9 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0x8fb82): short int
 <1><4b>: Abbrev Number: 4 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0x9d967): __uint16_t
    <50>   DW_AT_decl_file   : 3
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 9 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0xb9232): short unsigned int
 <1><5e>: Abbrev Number: 9 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0x10070): long int
 <1><65>: Abbrev Number: 4 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x7abbc): __uint32_t
    <6a>   DW_AT_decl_file   : 3
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 9 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x4a0b2): long unsigned int
 <1><78>: Abbrev Number: 9 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x580f9): long long int
 <1><7f>: Abbrev Number: 9 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x28bdb): long long unsigned int
 <1><86>: Abbrev Number: 40 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 9 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0xf762): unsigned int
 <1><94>: Abbrev Number: 4 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x38569): uint8_t
    <99>   DW_AT_decl_file   : 4
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 28 (DW_TAG_const_type)
    <a1>   DW_AT_type        : <0x94>
 <1><a5>: Abbrev Number: 4 (DW_TAG_typedef)
    <a6>   DW_AT_name        : (indirect string, offset: 0x8c8da): uint16_t
    <aa>   DW_AT_decl_file   : 4
    <ab>   DW_AT_decl_line   : 36
    <ac>   DW_AT_decl_column : 20
    <ad>   DW_AT_type        : <0x4b>
 <1><b1>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <b2>   DW_AT_type        : <0xa5>
 <1><b6>: Abbrev Number: 4 (DW_TAG_typedef)
    <b7>   DW_AT_name        : (indirect string, offset: 0xa23cf): uint32_t
    <bb>   DW_AT_decl_file   : 4
    <bc>   DW_AT_decl_line   : 48
    <bd>   DW_AT_decl_column : 20
    <be>   DW_AT_type        : <0x65>
 <1><c2>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <c3>   DW_AT_type        : <0xb6>
 <1><c7>: Abbrev Number: 22 (DW_TAG_array_type)
    <c8>   DW_AT_type        : <0xb6>
    <cc>   DW_AT_sibling     : <0xd7>
 <2><d0>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <d1>   DW_AT_type        : <0x8d>
    <d5>   DW_AT_upper_bound : 1
 <2><d6>: Abbrev Number: 0
 <1><d7>: Abbrev Number: 15 (DW_TAG_structure_type)
    <d8>   DW_AT_byte_size   : 24
    <d9>   DW_AT_decl_file   : 5
    <da>   DW_AT_decl_line   : 324
    <dc>   DW_AT_decl_column : 9
    <dc>   DW_AT_sibling     : <0x12e>
 <2><e0>: Abbrev Number: 6 (DW_TAG_member)
    <e1>   DW_AT_name        : CR
    <e4>   DW_AT_decl_file   : 5
    <e4>   DW_AT_decl_line   : 326
    <e6>   DW_AT_decl_column : 17
    <e6>   DW_AT_type        : <0xc2>
    <ea>   DW_AT_data_member_location: 0
 <2><eb>: Abbrev Number: 3 (DW_TAG_member)
    <ec>   DW_AT_name        : (indirect string, offset: 0x1694b): NDTR
    <f0>   DW_AT_decl_file   : 5
    <f1>   DW_AT_decl_line   : 327
    <f3>   DW_AT_decl_column : 17
    <f4>   DW_AT_type        : <0xc2>
    <f8>   DW_AT_data_member_location: 4
 <2><f9>: Abbrev Number: 6 (DW_TAG_member)
    <fa>   DW_AT_name        : PAR
    <fe>   DW_AT_decl_file   : 5
    <fe>   DW_AT_decl_line   : 328
    <100>   DW_AT_decl_column : 17
    <100>   DW_AT_type        : <0xc2>
    <104>   DW_AT_data_member_location: 8
 <2><105>: Abbrev Number: 3 (DW_TAG_member)
    <106>   DW_AT_name        : (indirect string, offset: 0x50435): M0AR
    <10a>   DW_AT_decl_file   : 5
    <10b>   DW_AT_decl_line   : 329
    <10d>   DW_AT_decl_column : 17
    <10e>   DW_AT_type        : <0xc2>
    <112>   DW_AT_data_member_location: 12
 <2><113>: Abbrev Number: 3 (DW_TAG_member)
    <114>   DW_AT_name        : (indirect string, offset: 0x6abb6): M1AR
    <118>   DW_AT_decl_file   : 5
    <119>   DW_AT_decl_line   : 330
    <11b>   DW_AT_decl_column : 17
    <11c>   DW_AT_type        : <0xc2>
    <120>   DW_AT_data_member_location: 16
 <2><121>: Abbrev Number: 6 (DW_TAG_member)
    <122>   DW_AT_name        : FCR
    <126>   DW_AT_decl_file   : 5
    <126>   DW_AT_decl_line   : 331
    <128>   DW_AT_decl_column : 17
    <128>   DW_AT_type        : <0xc2>
    <12c>   DW_AT_data_member_location: 20
 <2><12d>: Abbrev Number: 0
 <1><12e>: Abbrev Number: 11 (DW_TAG_typedef)
    <12f>   DW_AT_name        : (indirect string, offset: 0xaf7fe): DMA_Stream_TypeDef
    <133>   DW_AT_decl_file   : 5
    <134>   DW_AT_decl_line   : 332
    <136>   DW_AT_decl_column : 3
    <136>   DW_AT_type        : <0xd7>
 <1><13a>: Abbrev Number: 15 (DW_TAG_structure_type)
    <13b>   DW_AT_byte_size   : 40
    <13c>   DW_AT_decl_file   : 5
    <13d>   DW_AT_decl_line   : 430
    <13f>   DW_AT_decl_column : 9
    <13f>   DW_AT_sibling     : <0x1bc>
 <2><143>: Abbrev Number: 3 (DW_TAG_member)
    <144>   DW_AT_name        : (indirect string, offset: 0x7d388): MODER
    <148>   DW_AT_decl_file   : 5
    <149>   DW_AT_decl_line   : 432
    <14b>   DW_AT_decl_column : 17
    <14c>   DW_AT_type        : <0xc2>
    <150>   DW_AT_data_member_location: 0
 <2><151>: Abbrev Number: 3 (DW_TAG_member)
    <152>   DW_AT_name        : (indirect string, offset: 0x95669): OTYPER
    <156>   DW_AT_decl_file   : 5
    <157>   DW_AT_decl_line   : 433
    <159>   DW_AT_decl_column : 17
    <15a>   DW_AT_type        : <0xc2>
    <15e>   DW_AT_data_member_location: 4
 <2><15f>: Abbrev Number: 3 (DW_TAG_member)
    <160>   DW_AT_name        : (indirect string, offset: 0xa7d8d): OSPEEDR
    <164>   DW_AT_decl_file   : 5
    <165>   DW_AT_decl_line   : 434
    <167>   DW_AT_decl_column : 17
    <168>   DW_AT_type        : <0xc2>
    <16c>   DW_AT_data_member_location: 8
 <2><16d>: Abbrev Number: 3 (DW_TAG_member)
    <16e>   DW_AT_name        : (indirect string, offset: 0x6f923): PUPDR
    <172>   DW_AT_decl_file   : 5
    <173>   DW_AT_decl_line   : 435
    <175>   DW_AT_decl_column : 17
    <176>   DW_AT_type        : <0xc2>
    <17a>   DW_AT_data_member_location: 12
 <2><17b>: Abbrev Number: 6 (DW_TAG_member)
    <17c>   DW_AT_name        : IDR
    <180>   DW_AT_decl_file   : 5
    <180>   DW_AT_decl_line   : 436
    <182>   DW_AT_decl_column : 17
    <182>   DW_AT_type        : <0xc2>
    <186>   DW_AT_data_member_location: 16
 <2><187>: Abbrev Number: 6 (DW_TAG_member)
    <188>   DW_AT_name        : ODR
    <18c>   DW_AT_decl_file   : 5
    <18c>   DW_AT_decl_line   : 437
    <18e>   DW_AT_decl_column : 17
    <18e>   DW_AT_type        : <0xc2>
    <192>   DW_AT_data_member_location: 20
 <2><193>: Abbrev Number: 3 (DW_TAG_member)
    <194>   DW_AT_name        : (indirect string, offset: 0x2bdb0): BSRR
    <198>   DW_AT_decl_file   : 5
    <199>   DW_AT_decl_line   : 438
    <19b>   DW_AT_decl_column : 17
    <19c>   DW_AT_type        : <0xc2>
    <1a0>   DW_AT_data_member_location: 24
 <2><1a1>: Abbrev Number: 3 (DW_TAG_member)
    <1a2>   DW_AT_name        : (indirect string, offset: 0xa55dc): LCKR
    <1a6>   DW_AT_decl_file   : 5
    <1a7>   DW_AT_decl_line   : 439
    <1a9>   DW_AT_decl_column : 17
    <1aa>   DW_AT_type        : <0xc2>
    <1ae>   DW_AT_data_member_location: 28
 <2><1af>: Abbrev Number: 6 (DW_TAG_member)
    <1b0>   DW_AT_name        : AFR
    <1b4>   DW_AT_decl_file   : 5
    <1b4>   DW_AT_decl_line   : 440
    <1b6>   DW_AT_decl_column : 17
    <1b6>   DW_AT_type        : <0x1cc>
    <1ba>   DW_AT_data_member_location: 32
 <2><1bb>: Abbrev Number: 0
 <1><1bc>: Abbrev Number: 22 (DW_TAG_array_type)
    <1bd>   DW_AT_type        : <0xc2>
    <1c1>   DW_AT_sibling     : <0x1cc>
 <2><1c5>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <1c6>   DW_AT_type        : <0x8d>
    <1ca>   DW_AT_upper_bound : 1
 <2><1cb>: Abbrev Number: 0
 <1><1cc>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <1cd>   DW_AT_type        : <0x1bc>
 <1><1d1>: Abbrev Number: 11 (DW_TAG_typedef)
    <1d2>   DW_AT_name        : (indirect string, offset: 0xbb934): GPIO_TypeDef
    <1d6>   DW_AT_decl_file   : 5
    <1d7>   DW_AT_decl_line   : 441
    <1d9>   DW_AT_decl_column : 3
    <1d9>   DW_AT_type        : <0x13a>
 <1><1dd>: Abbrev Number: 15 (DW_TAG_structure_type)
    <1de>   DW_AT_byte_size   : 8
    <1df>   DW_AT_decl_file   : 5
    <1e0>   DW_AT_decl_line   : 490
    <1e2>   DW_AT_decl_column : 9
    <1e2>   DW_AT_sibling     : <0x1fe>
 <2><1e6>: Abbrev Number: 6 (DW_TAG_member)
    <1e7>   DW_AT_name        : CR
    <1ea>   DW_AT_decl_file   : 5
    <1ea>   DW_AT_decl_line   : 492
    <1ec>   DW_AT_decl_column : 17
    <1ec>   DW_AT_type        : <0xc2>
    <1f0>   DW_AT_data_member_location: 0
 <2><1f1>: Abbrev Number: 6 (DW_TAG_member)
    <1f2>   DW_AT_name        : CSR
    <1f6>   DW_AT_decl_file   : 5
    <1f6>   DW_AT_decl_line   : 493
    <1f8>   DW_AT_decl_column : 17
    <1f8>   DW_AT_type        : <0xc2>
    <1fc>   DW_AT_data_member_location: 4
 <2><1fd>: Abbrev Number: 0
 <1><1fe>: Abbrev Number: 11 (DW_TAG_typedef)
    <1ff>   DW_AT_name        : (indirect string, offset: 0x8b440): PWR_TypeDef
    <203>   DW_AT_decl_file   : 5
    <204>   DW_AT_decl_line   : 494
    <206>   DW_AT_decl_column : 3
    <206>   DW_AT_type        : <0x1dd>
 <1><20a>: Abbrev Number: 15 (DW_TAG_structure_type)
    <20b>   DW_AT_byte_size   : 136
    <20c>   DW_AT_decl_file   : 5
    <20d>   DW_AT_decl_line   : 500
    <20f>   DW_AT_decl_column : 9
    <20f>   DW_AT_sibling     : <0x3b1>
 <2><213>: Abbrev Number: 6 (DW_TAG_member)
    <214>   DW_AT_name        : CR
    <217>   DW_AT_decl_file   : 5
    <217>   DW_AT_decl_line   : 502
    <219>   DW_AT_decl_column : 17
    <219>   DW_AT_type        : <0xc2>
    <21d>   DW_AT_data_member_location: 0
 <2><21e>: Abbrev Number: 3 (DW_TAG_member)
    <21f>   DW_AT_name        : (indirect string, offset: 0x86d74): PLLCFGR
    <223>   DW_AT_decl_file   : 5
    <224>   DW_AT_decl_line   : 503
    <226>   DW_AT_decl_column : 17
    <227>   DW_AT_type        : <0xc2>
    <22b>   DW_AT_data_member_location: 4
 <2><22c>: Abbrev Number: 3 (DW_TAG_member)
    <22d>   DW_AT_name        : (indirect string, offset: 0x86d77): CFGR
    <231>   DW_AT_decl_file   : 5
    <232>   DW_AT_decl_line   : 504
    <234>   DW_AT_decl_column : 17
    <235>   DW_AT_type        : <0xc2>
    <239>   DW_AT_data_member_location: 8
 <2><23a>: Abbrev Number: 6 (DW_TAG_member)
    <23b>   DW_AT_name        : CIR
    <23f>   DW_AT_decl_file   : 5
    <23f>   DW_AT_decl_line   : 505
    <241>   DW_AT_decl_column : 17
    <241>   DW_AT_type        : <0xc2>
    <245>   DW_AT_data_member_location: 12
 <2><246>: Abbrev Number: 3 (DW_TAG_member)
    <247>   DW_AT_name        : (indirect string, offset: 0x99a52): AHB1RSTR
    <24b>   DW_AT_decl_file   : 5
    <24c>   DW_AT_decl_line   : 506
    <24e>   DW_AT_decl_column : 17
    <24f>   DW_AT_type        : <0xc2>
    <253>   DW_AT_data_member_location: 16
 <2><254>: Abbrev Number: 3 (DW_TAG_member)
    <255>   DW_AT_name        : (indirect string, offset: 0x160b6): AHB2RSTR
    <259>   DW_AT_decl_file   : 5
    <25a>   DW_AT_decl_line   : 507
    <25c>   DW_AT_decl_column : 17
    <25d>   DW_AT_type        : <0xc2>
    <261>   DW_AT_data_member_location: 20
 <2><262>: Abbrev Number: 3 (DW_TAG_member)
    <263>   DW_AT_name        : (indirect string, offset: 0x3fca1): AHB3RSTR
    <267>   DW_AT_decl_file   : 5
    <268>   DW_AT_decl_line   : 508
    <26a>   DW_AT_decl_column : 17
    <26b>   DW_AT_type        : <0xc2>
    <26f>   DW_AT_data_member_location: 24
 <2><270>: Abbrev Number: 3 (DW_TAG_member)
    <271>   DW_AT_name        : (indirect string, offset: 0xb63ec): RESERVED0
    <275>   DW_AT_decl_file   : 5
    <276>   DW_AT_decl_line   : 509
    <278>   DW_AT_decl_column : 17
    <279>   DW_AT_type        : <0xb6>
    <27d>   DW_AT_data_member_location: 28
 <2><27e>: Abbrev Number: 3 (DW_TAG_member)
    <27f>   DW_AT_name        : (indirect string, offset: 0x15b4b): APB1RSTR
    <283>   DW_AT_decl_file   : 5
    <284>   DW_AT_decl_line   : 510
    <286>   DW_AT_decl_column : 17
    <287>   DW_AT_type        : <0xc2>
    <28b>   DW_AT_data_member_location: 32
 <2><28c>: Abbrev Number: 3 (DW_TAG_member)
    <28d>   DW_AT_name        : (indirect string, offset: 0x53cc3): APB2RSTR
    <291>   DW_AT_decl_file   : 5
    <292>   DW_AT_decl_line   : 511
    <294>   DW_AT_decl_column : 17
    <295>   DW_AT_type        : <0xc2>
    <299>   DW_AT_data_member_location: 36
 <2><29a>: Abbrev Number: 3 (DW_TAG_member)
    <29b>   DW_AT_name        : (indirect string, offset: 0xb63f6): RESERVED1
    <29f>   DW_AT_decl_file   : 5
    <2a0>   DW_AT_decl_line   : 512
    <2a2>   DW_AT_decl_column : 17
    <2a3>   DW_AT_type        : <0xc7>
    <2a7>   DW_AT_data_member_location: 40
 <2><2a8>: Abbrev Number: 3 (DW_TAG_member)
    <2a9>   DW_AT_name        : (indirect string, offset: 0xf6f7): AHB1ENR
    <2ad>   DW_AT_decl_file   : 5
    <2ae>   DW_AT_decl_line   : 513
    <2b0>   DW_AT_decl_column : 17
    <2b1>   DW_AT_type        : <0xc2>
    <2b5>   DW_AT_data_member_location: 48
 <2><2b6>: Abbrev Number: 3 (DW_TAG_member)
    <2b7>   DW_AT_name        : (indirect string, offset: 0x339b7): AHB2ENR
    <2bb>   DW_AT_decl_file   : 5
    <2bc>   DW_AT_decl_line   : 514
    <2be>   DW_AT_decl_column : 17
    <2bf>   DW_AT_type        : <0xc2>
    <2c3>   DW_AT_data_member_location: 52
 <2><2c4>: Abbrev Number: 3 (DW_TAG_member)
    <2c5>   DW_AT_name        : (indirect string, offset: 0x56a57): AHB3ENR
    <2c9>   DW_AT_decl_file   : 5
    <2ca>   DW_AT_decl_line   : 515
    <2cc>   DW_AT_decl_column : 17
    <2cd>   DW_AT_type        : <0xc2>
    <2d1>   DW_AT_data_member_location: 56
 <2><2d2>: Abbrev Number: 3 (DW_TAG_member)
    <2d3>   DW_AT_name        : (indirect string, offset: 0xb6400): RESERVED2
    <2d7>   DW_AT_decl_file   : 5
    <2d8>   DW_AT_decl_line   : 516
    <2da>   DW_AT_decl_column : 17
    <2db>   DW_AT_type        : <0xb6>
    <2df>   DW_AT_data_member_location: 60
 <2><2e0>: Abbrev Number: 3 (DW_TAG_member)
    <2e1>   DW_AT_name        : (indirect string, offset: 0x6ea79): APB1ENR
    <2e5>   DW_AT_decl_file   : 5
    <2e6>   DW_AT_decl_line   : 517
    <2e8>   DW_AT_decl_column : 17
    <2e9>   DW_AT_type        : <0xc2>
    <2ed>   DW_AT_data_member_location: 64
 <2><2ee>: Abbrev Number: 3 (DW_TAG_member)
    <2ef>   DW_AT_name        : (indirect string, offset: 0x5d335): APB2ENR
    <2f3>   DW_AT_decl_file   : 5
    <2f4>   DW_AT_decl_line   : 518
    <2f6>   DW_AT_decl_column : 17
    <2f7>   DW_AT_type        : <0xc2>
    <2fb>   DW_AT_data_member_location: 68
 <2><2fc>: Abbrev Number: 3 (DW_TAG_member)
    <2fd>   DW_AT_name        : (indirect string, offset: 0xb640a): RESERVED3
    <301>   DW_AT_decl_file   : 5
    <302>   DW_AT_decl_line   : 519
    <304>   DW_AT_decl_column : 17
    <305>   DW_AT_type        : <0xc7>
    <309>   DW_AT_data_member_location: 72
 <2><30a>: Abbrev Number: 3 (DW_TAG_member)
    <30b>   DW_AT_name        : (indirect string, offset: 0x9d7ec): AHB1LPENR
    <30f>   DW_AT_decl_file   : 5
    <310>   DW_AT_decl_line   : 520
    <312>   DW_AT_decl_column : 17
    <313>   DW_AT_type        : <0xc2>
    <317>   DW_AT_data_member_location: 80
 <2><318>: Abbrev Number: 3 (DW_TAG_member)
    <319>   DW_AT_name        : (indirect string, offset: 0x2ba23): AHB2LPENR
    <31d>   DW_AT_decl_file   : 5
    <31e>   DW_AT_decl_line   : 521
    <320>   DW_AT_decl_column : 17
    <321>   DW_AT_type        : <0xc2>
    <325>   DW_AT_data_member_location: 84
 <2><326>: Abbrev Number: 3 (DW_TAG_member)
    <327>   DW_AT_name        : (indirect string, offset: 0x82347): AHB3LPENR
    <32b>   DW_AT_decl_file   : 5
    <32c>   DW_AT_decl_line   : 522
    <32e>   DW_AT_decl_column : 17
    <32f>   DW_AT_type        : <0xc2>
    <333>   DW_AT_data_member_location: 88
 <2><334>: Abbrev Number: 3 (DW_TAG_member)
    <335>   DW_AT_name        : (indirect string, offset: 0xb6414): RESERVED4
    <339>   DW_AT_decl_file   : 5
    <33a>   DW_AT_decl_line   : 523
    <33c>   DW_AT_decl_column : 17
    <33d>   DW_AT_type        : <0xb6>
    <341>   DW_AT_data_member_location: 92
 <2><342>: Abbrev Number: 3 (DW_TAG_member)
    <343>   DW_AT_name        : (indirect string, offset: 0xa20a8): APB1LPENR
    <347>   DW_AT_decl_file   : 5
    <348>   DW_AT_decl_line   : 524
    <34a>   DW_AT_decl_column : 17
    <34b>   DW_AT_type        : <0xc2>
    <34f>   DW_AT_data_member_location: 96
 <2><350>: Abbrev Number: 3 (DW_TAG_member)
    <351>   DW_AT_name        : (indirect string, offset: 0x31692): APB2LPENR
    <355>   DW_AT_decl_file   : 5
    <356>   DW_AT_decl_line   : 525
    <358>   DW_AT_decl_column : 17
    <359>   DW_AT_type        : <0xc2>
    <35d>   DW_AT_data_member_location: 100
 <2><35e>: Abbrev Number: 3 (DW_TAG_member)
    <35f>   DW_AT_name        : (indirect string, offset: 0xb641e): RESERVED5
    <363>   DW_AT_decl_file   : 5
    <364>   DW_AT_decl_line   : 526
    <366>   DW_AT_decl_column : 17
    <367>   DW_AT_type        : <0xc7>
    <36b>   DW_AT_data_member_location: 104
 <2><36c>: Abbrev Number: 3 (DW_TAG_member)
    <36d>   DW_AT_name        : (indirect string, offset: 0x1b3d0): BDCR
    <371>   DW_AT_decl_file   : 5
    <372>   DW_AT_decl_line   : 527
    <374>   DW_AT_decl_column : 17
    <375>   DW_AT_type        : <0xc2>
    <379>   DW_AT_data_member_location: 112
 <2><37a>: Abbrev Number: 6 (DW_TAG_member)
    <37b>   DW_AT_name        : CSR
    <37f>   DW_AT_decl_file   : 5
    <37f>   DW_AT_decl_line   : 528
    <381>   DW_AT_decl_column : 17
    <381>   DW_AT_type        : <0xc2>
    <385>   DW_AT_data_member_location: 116
 <2><386>: Abbrev Number: 3 (DW_TAG_member)
    <387>   DW_AT_name        : (indirect string, offset: 0x72f88): RESERVED6
    <38b>   DW_AT_decl_file   : 5
    <38c>   DW_AT_decl_line   : 529
    <38e>   DW_AT_decl_column : 17
    <38f>   DW_AT_type        : <0xc7>
    <393>   DW_AT_data_member_location: 120
 <2><394>: Abbrev Number: 3 (DW_TAG_member)
    <395>   DW_AT_name        : (indirect string, offset: 0x6630c): SSCGR
    <399>   DW_AT_decl_file   : 5
    <39a>   DW_AT_decl_line   : 530
    <39c>   DW_AT_decl_column : 17
    <39d>   DW_AT_type        : <0xc2>
    <3a1>   DW_AT_data_member_location: 128
 <2><3a2>: Abbrev Number: 3 (DW_TAG_member)
    <3a3>   DW_AT_name        : (indirect string, offset: 0x40657): PLLI2SCFGR
    <3a7>   DW_AT_decl_file   : 5
    <3a8>   DW_AT_decl_line   : 531
    <3aa>   DW_AT_decl_column : 17
    <3ab>   DW_AT_type        : <0xc2>
    <3af>   DW_AT_data_member_location: 132
 <2><3b0>: Abbrev Number: 0
 <1><3b1>: Abbrev Number: 11 (DW_TAG_typedef)
    <3b2>   DW_AT_name        : (indirect string, offset: 0x59524): RCC_TypeDef
    <3b6>   DW_AT_decl_file   : 5
    <3b7>   DW_AT_decl_line   : 532
    <3b9>   DW_AT_decl_column : 3
    <3b9>   DW_AT_type        : <0x20a>
 <1><3bd>: Abbrev Number: 15 (DW_TAG_structure_type)
    <3be>   DW_AT_byte_size   : 84
    <3bf>   DW_AT_decl_file   : 5
    <3c0>   DW_AT_decl_line   : 632
    <3c2>   DW_AT_decl_column : 9
    <3c2>   DW_AT_sibling     : <0x4d7>
 <2><3c6>: Abbrev Number: 6 (DW_TAG_member)
    <3c7>   DW_AT_name        : CR1
    <3cb>   DW_AT_decl_file   : 5
    <3cb>   DW_AT_decl_line   : 634
    <3cd>   DW_AT_decl_column : 17
    <3cd>   DW_AT_type        : <0xc2>
    <3d1>   DW_AT_data_member_location: 0
 <2><3d2>: Abbrev Number: 6 (DW_TAG_member)
    <3d3>   DW_AT_name        : CR2
    <3d7>   DW_AT_decl_file   : 5
    <3d7>   DW_AT_decl_line   : 635
    <3d9>   DW_AT_decl_column : 17
    <3d9>   DW_AT_type        : <0xc2>
    <3dd>   DW_AT_data_member_location: 4
 <2><3de>: Abbrev Number: 3 (DW_TAG_member)
    <3df>   DW_AT_name        : (indirect string, offset: 0x38e99): SMCR
    <3e3>   DW_AT_decl_file   : 5
    <3e4>   DW_AT_decl_line   : 636
    <3e6>   DW_AT_decl_column : 17
    <3e7>   DW_AT_type        : <0xc2>
    <3eb>   DW_AT_data_member_location: 8
 <2><3ec>: Abbrev Number: 3 (DW_TAG_member)
    <3ed>   DW_AT_name        : (indirect string, offset: 0x3ec5e): DIER
    <3f1>   DW_AT_decl_file   : 5
    <3f2>   DW_AT_decl_line   : 637
    <3f4>   DW_AT_decl_column : 17
    <3f5>   DW_AT_type        : <0xc2>
    <3f9>   DW_AT_data_member_location: 12
 <2><3fa>: Abbrev Number: 6 (DW_TAG_member)
    <3fb>   DW_AT_name        : SR
    <3fe>   DW_AT_decl_file   : 5
    <3fe>   DW_AT_decl_line   : 638
    <400>   DW_AT_decl_column : 17
    <400>   DW_AT_type        : <0xc2>
    <404>   DW_AT_data_member_location: 16
 <2><405>: Abbrev Number: 6 (DW_TAG_member)
    <406>   DW_AT_name        : EGR
    <40a>   DW_AT_decl_file   : 5
    <40a>   DW_AT_decl_line   : 639
    <40c>   DW_AT_decl_column : 17
    <40c>   DW_AT_type        : <0xc2>
    <410>   DW_AT_data_member_location: 20
 <2><411>: Abbrev Number: 3 (DW_TAG_member)
    <412>   DW_AT_name        : (indirect string, offset: 0xb0621): CCMR1
    <416>   DW_AT_decl_file   : 5
    <417>   DW_AT_decl_line   : 640
    <419>   DW_AT_decl_column : 17
    <41a>   DW_AT_type        : <0xc2>
    <41e>   DW_AT_data_member_location: 24
 <2><41f>: Abbrev Number: 3 (DW_TAG_member)
    <420>   DW_AT_name        : (indirect string, offset: 0x4d2bc): CCMR2
    <424>   DW_AT_decl_file   : 5
    <425>   DW_AT_decl_line   : 641
    <427>   DW_AT_decl_column : 17
    <428>   DW_AT_type        : <0xc2>
    <42c>   DW_AT_data_member_location: 28
 <2><42d>: Abbrev Number: 3 (DW_TAG_member)
    <42e>   DW_AT_name        : (indirect string, offset: 0x2f710): CCER
    <432>   DW_AT_decl_file   : 5
    <433>   DW_AT_decl_line   : 642
    <435>   DW_AT_decl_column : 17
    <436>   DW_AT_type        : <0xc2>
    <43a>   DW_AT_data_member_location: 32
 <2><43b>: Abbrev Number: 6 (DW_TAG_member)
    <43c>   DW_AT_name        : CNT
    <440>   DW_AT_decl_file   : 5
    <440>   DW_AT_decl_line   : 643
    <442>   DW_AT_decl_column : 17
    <442>   DW_AT_type        : <0xc2>
    <446>   DW_AT_data_member_location: 36
 <2><447>: Abbrev Number: 6 (DW_TAG_member)
    <448>   DW_AT_name        : PSC
    <44c>   DW_AT_decl_file   : 5
    <44c>   DW_AT_decl_line   : 644
    <44e>   DW_AT_decl_column : 17
    <44e>   DW_AT_type        : <0xc2>
    <452>   DW_AT_data_member_location: 40
 <2><453>: Abbrev Number: 6 (DW_TAG_member)
    <454>   DW_AT_name        : ARR
    <458>   DW_AT_decl_file   : 5
    <458>   DW_AT_decl_line   : 645
    <45a>   DW_AT_decl_column : 17
    <45a>   DW_AT_type        : <0xc2>
    <45e>   DW_AT_data_member_location: 44
 <2><45f>: Abbrev Number: 6 (DW_TAG_member)
    <460>   DW_AT_name        : RCR
    <464>   DW_AT_decl_file   : 5
    <464>   DW_AT_decl_line   : 646
    <466>   DW_AT_decl_column : 17
    <466>   DW_AT_type        : <0xc2>
    <46a>   DW_AT_data_member_location: 48
 <2><46b>: Abbrev Number: 3 (DW_TAG_member)
    <46c>   DW_AT_name        : (indirect string, offset: 0x17159): CCR1
    <470>   DW_AT_decl_file   : 5
    <471>   DW_AT_decl_line   : 647
    <473>   DW_AT_decl_column : 17
    <474>   DW_AT_type        : <0xc2>
    <478>   DW_AT_data_member_location: 52
 <2><479>: Abbrev Number: 3 (DW_TAG_member)
    <47a>   DW_AT_name        : (indirect string, offset: 0x50fd0): CCR2
    <47e>   DW_AT_decl_file   : 5
    <47f>   DW_AT_decl_line   : 648
    <481>   DW_AT_decl_column : 17
    <482>   DW_AT_type        : <0xc2>
    <486>   DW_AT_data_member_location: 56
 <2><487>: Abbrev Number: 3 (DW_TAG_member)
    <488>   DW_AT_name        : (indirect string, offset: 0x9372f): CCR3
    <48c>   DW_AT_decl_file   : 5
    <48d>   DW_AT_decl_line   : 649
    <48f>   DW_AT_decl_column : 17
    <490>   DW_AT_type        : <0xc2>
    <494>   DW_AT_data_member_location: 60
 <2><495>: Abbrev Number: 3 (DW_TAG_member)
    <496>   DW_AT_name        : (indirect string, offset: 0xbf03): CCR4
    <49a>   DW_AT_decl_file   : 5
    <49b>   DW_AT_decl_line   : 650
    <49d>   DW_AT_decl_column : 17
    <49e>   DW_AT_type        : <0xc2>
    <4a2>   DW_AT_data_member_location: 64
 <2><4a3>: Abbrev Number: 3 (DW_TAG_member)
    <4a4>   DW_AT_name        : (indirect string, offset: 0x835f7): BDTR
    <4a8>   DW_AT_decl_file   : 5
    <4a9>   DW_AT_decl_line   : 651
    <4ab>   DW_AT_decl_column : 17
    <4ac>   DW_AT_type        : <0xc2>
    <4b0>   DW_AT_data_member_location: 68
 <2><4b1>: Abbrev Number: 6 (DW_TAG_member)
    <4b2>   DW_AT_name        : DCR
    <4b6>   DW_AT_decl_file   : 5
    <4b6>   DW_AT_decl_line   : 652
    <4b8>   DW_AT_decl_column : 17
    <4b8>   DW_AT_type        : <0xc2>
    <4bc>   DW_AT_data_member_location: 72
 <2><4bd>: Abbrev Number: 3 (DW_TAG_member)
    <4be>   DW_AT_name        : (indirect string, offset: 0xa5b8e): DMAR
    <4c2>   DW_AT_decl_file   : 5
    <4c3>   DW_AT_decl_line   : 653
    <4c5>   DW_AT_decl_column : 17
    <4c6>   DW_AT_type        : <0xc2>
    <4ca>   DW_AT_data_member_location: 76
 <2><4cb>: Abbrev Number: 6 (DW_TAG_member)
    <4cc>   DW_AT_name        : OR
    <4cf>   DW_AT_decl_file   : 5
    <4cf>   DW_AT_decl_line   : 654
    <4d1>   DW_AT_decl_column : 17
    <4d1>   DW_AT_type        : <0xc2>
    <4d5>   DW_AT_data_member_location: 80
 <2><4d6>: Abbrev Number: 0
 <1><4d7>: Abbrev Number: 11 (DW_TAG_typedef)
    <4d8>   DW_AT_name        : (indirect string, offset: 0xb6e46): TIM_TypeDef
    <4dc>   DW_AT_decl_file   : 5
    <4dd>   DW_AT_decl_line   : 655
    <4df>   DW_AT_decl_column : 3
    <4df>   DW_AT_type        : <0x3bd>
 <1><4e3>: Abbrev Number: 15 (DW_TAG_structure_type)
    <4e4>   DW_AT_byte_size   : 28
    <4e5>   DW_AT_decl_file   : 5
    <4e6>   DW_AT_decl_line   : 661
    <4e8>   DW_AT_decl_column : 9
    <4e8>   DW_AT_sibling     : <0x541>
 <2><4ec>: Abbrev Number: 6 (DW_TAG_member)
    <4ed>   DW_AT_name        : SR
    <4f0>   DW_AT_decl_file   : 5
    <4f0>   DW_AT_decl_line   : 663
    <4f2>   DW_AT_decl_column : 17
    <4f2>   DW_AT_type        : <0xc2>
    <4f6>   DW_AT_data_member_location: 0
 <2><4f7>: Abbrev Number: 6 (DW_TAG_member)
    <4f8>   DW_AT_name        : DR
    <4fb>   DW_AT_decl_file   : 5
    <4fb>   DW_AT_decl_line   : 664
    <4fd>   DW_AT_decl_column : 17
    <4fd>   DW_AT_type        : <0xc2>
    <501>   DW_AT_data_member_location: 4
 <2><502>: Abbrev Number: 6 (DW_TAG_member)
    <503>   DW_AT_name        : BRR
    <507>   DW_AT_decl_file   : 5
    <507>   DW_AT_decl_line   : 665
    <509>   DW_AT_decl_column : 17
    <509>   DW_AT_type        : <0xc2>
    <50d>   DW_AT_data_member_location: 8
 <2><50e>: Abbrev Number: 6 (DW_TAG_member)
    <50f>   DW_AT_name        : CR1
    <513>   DW_AT_decl_file   : 5
    <513>   DW_AT_decl_line   : 666
    <515>   DW_AT_decl_column : 17
    <515>   DW_AT_type        : <0xc2>
    <519>   DW_AT_data_member_location: 12
 <2><51a>: Abbrev Number: 6 (DW_TAG_member)
    <51b>   DW_AT_name        : CR2
    <51f>   DW_AT_decl_file   : 5
    <51f>   DW_AT_decl_line   : 667
    <521>   DW_AT_decl_column : 17
    <521>   DW_AT_type        : <0xc2>
    <525>   DW_AT_data_member_location: 16
 <2><526>: Abbrev Number: 6 (DW_TAG_member)
    <527>   DW_AT_name        : CR3
    <52b>   DW_AT_decl_file   : 5
    <52b>   DW_AT_decl_line   : 668
    <52d>   DW_AT_decl_column : 17
    <52d>   DW_AT_type        : <0xc2>
    <531>   DW_AT_data_member_location: 20
 <2><532>: Abbrev Number: 3 (DW_TAG_member)
    <533>   DW_AT_name        : (indirect string, offset: 0x35e2e): GTPR
    <537>   DW_AT_decl_file   : 5
    <538>   DW_AT_decl_line   : 669
    <53a>   DW_AT_decl_column : 17
    <53b>   DW_AT_type        : <0xc2>
    <53f>   DW_AT_data_member_location: 24
 <2><540>: Abbrev Number: 0
 <1><541>: Abbrev Number: 11 (DW_TAG_typedef)
    <542>   DW_AT_name        : (indirect string, offset: 0xbf9a8): USART_TypeDef
    <546>   DW_AT_decl_file   : 5
    <547>   DW_AT_decl_line   : 670
    <549>   DW_AT_decl_column : 3
    <549>   DW_AT_type        : <0x4e3>
 <1><54d>: Abbrev Number: 9 (DW_TAG_base_type)
    <54e>   DW_AT_byte_size   : 8
    <54f>   DW_AT_encoding    : 4	(float)
    <550>   DW_AT_name        : (indirect string, offset: 0x23e80): long double
 <1><554>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <555>   DW_AT_encoding    : 7	(unsigned)
    <556>   DW_AT_byte_size   : 1
    <557>   DW_AT_type        : <0x3d>
    <55b>   DW_AT_decl_file   : 6
    <55c>   DW_AT_decl_line   : 39
    <55d>   DW_AT_decl_column : 1
    <55e>   DW_AT_sibling     : <0x57b>
 <2><562>: Abbrev Number: 1 (DW_TAG_enumerator)
    <563>   DW_AT_name        : (indirect string, offset: 0x41674): HAL_OK
    <567>   DW_AT_const_value : 0
 <2><568>: Abbrev Number: 1 (DW_TAG_enumerator)
    <569>   DW_AT_name        : (indirect string, offset: 0x788b7): HAL_ERROR
    <56d>   DW_AT_const_value : 1
 <2><56e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <56f>   DW_AT_name        : (indirect string, offset: 0x224ec): HAL_BUSY
    <573>   DW_AT_const_value : 2
 <2><574>: Abbrev Number: 1 (DW_TAG_enumerator)
    <575>   DW_AT_name        : (indirect string, offset: 0x38c7e): HAL_TIMEOUT
    <579>   DW_AT_const_value : 3
 <2><57a>: Abbrev Number: 0
 <1><57b>: Abbrev Number: 4 (DW_TAG_typedef)
    <57c>   DW_AT_name        : (indirect string, offset: 0x21f0): HAL_StatusTypeDef
    <580>   DW_AT_decl_file   : 6
    <581>   DW_AT_decl_line   : 44
    <582>   DW_AT_decl_column : 3
    <583>   DW_AT_type        : <0x554>
 <1><587>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <588>   DW_AT_encoding    : 7	(unsigned)
    <589>   DW_AT_byte_size   : 1
    <58a>   DW_AT_type        : <0x3d>
    <58e>   DW_AT_decl_file   : 6
    <58f>   DW_AT_decl_line   : 50
    <590>   DW_AT_decl_column : 1
    <591>   DW_AT_sibling     : <0x5a2>
 <2><595>: Abbrev Number: 1 (DW_TAG_enumerator)
    <596>   DW_AT_name        : (indirect string, offset: 0x8e89f): HAL_UNLOCKED
    <59a>   DW_AT_const_value : 0
 <2><59b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <59c>   DW_AT_name        : (indirect string, offset: 0xc1004): HAL_LOCKED
    <5a0>   DW_AT_const_value : 1
 <2><5a1>: Abbrev Number: 0
 <1><5a2>: Abbrev Number: 4 (DW_TAG_typedef)
    <5a3>   DW_AT_name        : (indirect string, offset: 0x71fcc): HAL_LockTypeDef
    <5a7>   DW_AT_decl_file   : 6
    <5a8>   DW_AT_decl_line   : 53
    <5a9>   DW_AT_decl_column : 3
    <5aa>   DW_AT_type        : <0x587>
 <1><5ae>: Abbrev Number: 14 (DW_TAG_structure_type)
    <5af>   DW_AT_byte_size   : 24
    <5b0>   DW_AT_decl_file   : 7
    <5b1>   DW_AT_decl_line   : 45
    <5b2>   DW_AT_decl_column : 9
    <5b2>   DW_AT_sibling     : <0x605>
 <2><5b6>: Abbrev Number: 2 (DW_TAG_member)
    <5b7>   DW_AT_name        : (indirect string, offset: 0x81266): PLLState
    <5bb>   DW_AT_decl_file   : 7
    <5bc>   DW_AT_decl_line   : 47
    <5bd>   DW_AT_decl_column : 12
    <5be>   DW_AT_type        : <0xb6>
    <5c2>   DW_AT_data_member_location: 0
 <2><5c3>: Abbrev Number: 2 (DW_TAG_member)
    <5c4>   DW_AT_name        : (indirect string, offset: 0x85a8b): PLLSource
    <5c8>   DW_AT_decl_file   : 7
    <5c9>   DW_AT_decl_line   : 50
    <5ca>   DW_AT_decl_column : 12
    <5cb>   DW_AT_type        : <0xb6>
    <5cf>   DW_AT_data_member_location: 4
 <2><5d0>: Abbrev Number: 2 (DW_TAG_member)
    <5d1>   DW_AT_name        : (indirect string, offset: 0x9fe2c): PLLM
    <5d5>   DW_AT_decl_file   : 7
    <5d6>   DW_AT_decl_line   : 53
    <5d7>   DW_AT_decl_column : 12
    <5d8>   DW_AT_type        : <0xb6>
    <5dc>   DW_AT_data_member_location: 8
 <2><5dd>: Abbrev Number: 2 (DW_TAG_member)
    <5de>   DW_AT_name        : (indirect string, offset: 0x9fe31): PLLN
    <5e2>   DW_AT_decl_file   : 7
    <5e3>   DW_AT_decl_line   : 56
    <5e4>   DW_AT_decl_column : 12
    <5e5>   DW_AT_type        : <0xb6>
    <5e9>   DW_AT_data_member_location: 12
 <2><5ea>: Abbrev Number: 2 (DW_TAG_member)
    <5eb>   DW_AT_name        : (indirect string, offset: 0x9fe4e): PLLP
    <5ef>   DW_AT_decl_file   : 7
    <5f0>   DW_AT_decl_line   : 60
    <5f1>   DW_AT_decl_column : 12
    <5f2>   DW_AT_type        : <0xb6>
    <5f6>   DW_AT_data_member_location: 16
 <2><5f7>: Abbrev Number: 2 (DW_TAG_member)
    <5f8>   DW_AT_name        : (indirect string, offset: 0x480c8): PLLQ
    <5fc>   DW_AT_decl_file   : 7
    <5fd>   DW_AT_decl_line   : 63
    <5fe>   DW_AT_decl_column : 12
    <5ff>   DW_AT_type        : <0xb6>
    <603>   DW_AT_data_member_location: 20
 <2><604>: Abbrev Number: 0
 <1><605>: Abbrev Number: 4 (DW_TAG_typedef)
    <606>   DW_AT_name        : (indirect string, offset: 0x74b8c): RCC_PLLInitTypeDef
    <60a>   DW_AT_decl_file   : 7
    <60b>   DW_AT_decl_line   : 73
    <60c>   DW_AT_decl_column : 3
    <60d>   DW_AT_type        : <0x5ae>
 <1><611>: Abbrev Number: 14 (DW_TAG_structure_type)
    <612>   DW_AT_byte_size   : 48
    <613>   DW_AT_decl_file   : 8
    <614>   DW_AT_decl_line   : 49
    <615>   DW_AT_decl_column : 9
    <615>   DW_AT_sibling     : <0x675>
 <2><619>: Abbrev Number: 2 (DW_TAG_member)
    <61a>   DW_AT_name        : (indirect string, offset: 0x9d317): OscillatorType
    <61e>   DW_AT_decl_file   : 8
    <61f>   DW_AT_decl_line   : 51
    <620>   DW_AT_decl_column : 12
    <621>   DW_AT_type        : <0xb6>
    <625>   DW_AT_data_member_location: 0
 <2><626>: Abbrev Number: 2 (DW_TAG_member)
    <627>   DW_AT_name        : (indirect string, offset: 0x82935): HSEState
    <62b>   DW_AT_decl_file   : 8
    <62c>   DW_AT_decl_line   : 54
    <62d>   DW_AT_decl_column : 12
    <62e>   DW_AT_type        : <0xb6>
    <632>   DW_AT_data_member_location: 4
 <2><633>: Abbrev Number: 2 (DW_TAG_member)
    <634>   DW_AT_name        : (indirect string, offset: 0x791fd): LSEState
    <638>   DW_AT_decl_file   : 8
    <639>   DW_AT_decl_line   : 57
    <63a>   DW_AT_decl_column : 12
    <63b>   DW_AT_type        : <0xb6>
    <63f>   DW_AT_data_member_location: 8
 <2><640>: Abbrev Number: 2 (DW_TAG_member)
    <641>   DW_AT_name        : (indirect string, offset: 0x561df): HSIState
    <645>   DW_AT_decl_file   : 8
    <646>   DW_AT_decl_line   : 60
    <647>   DW_AT_decl_column : 12
    <648>   DW_AT_type        : <0xb6>
    <64c>   DW_AT_data_member_location: 12
 <2><64d>: Abbrev Number: 2 (DW_TAG_member)
    <64e>   DW_AT_name        : (indirect string, offset: 0xa5da3): HSICalibrationValue
    <652>   DW_AT_decl_file   : 8
    <653>   DW_AT_decl_line   : 63
    <654>   DW_AT_decl_column : 12
    <655>   DW_AT_type        : <0xb6>
    <659>   DW_AT_data_member_location: 16
 <2><65a>: Abbrev Number: 2 (DW_TAG_member)
    <65b>   DW_AT_name        : (indirect string, offset: 0x43e81): LSIState
    <65f>   DW_AT_decl_file   : 8
    <660>   DW_AT_decl_line   : 66
    <661>   DW_AT_decl_column : 12
    <662>   DW_AT_type        : <0xb6>
    <666>   DW_AT_data_member_location: 20
 <2><667>: Abbrev Number: 33 (DW_TAG_member)
    <668>   DW_AT_name        : PLL
    <66c>   DW_AT_decl_file   : 8
    <66d>   DW_AT_decl_line   : 69
    <66e>   DW_AT_decl_column : 22
    <66f>   DW_AT_type        : <0x605>
    <673>   DW_AT_data_member_location: 24
 <2><674>: Abbrev Number: 0
 <1><675>: Abbrev Number: 4 (DW_TAG_typedef)
    <676>   DW_AT_name        : (indirect string, offset: 0x66849): RCC_OscInitTypeDef
    <67a>   DW_AT_decl_file   : 8
    <67b>   DW_AT_decl_line   : 70
    <67c>   DW_AT_decl_column : 3
    <67d>   DW_AT_type        : <0x611>
 <1><681>: Abbrev Number: 14 (DW_TAG_structure_type)
    <682>   DW_AT_byte_size   : 20
    <683>   DW_AT_decl_file   : 8
    <684>   DW_AT_decl_line   : 75
    <685>   DW_AT_decl_column : 9
    <685>   DW_AT_sibling     : <0x6cb>
 <2><689>: Abbrev Number: 2 (DW_TAG_member)
    <68a>   DW_AT_name        : (indirect string, offset: 0x3b55d): ClockType
    <68e>   DW_AT_decl_file   : 8
    <68f>   DW_AT_decl_line   : 77
    <690>   DW_AT_decl_column : 12
    <691>   DW_AT_type        : <0xb6>
    <695>   DW_AT_data_member_location: 0
 <2><696>: Abbrev Number: 2 (DW_TAG_member)
    <697>   DW_AT_name        : (indirect string, offset: 0x7463f): SYSCLKSource
    <69b>   DW_AT_decl_file   : 8
    <69c>   DW_AT_decl_line   : 80
    <69d>   DW_AT_decl_column : 12
    <69e>   DW_AT_type        : <0xb6>
    <6a2>   DW_AT_data_member_location: 4
 <2><6a3>: Abbrev Number: 2 (DW_TAG_member)
    <6a4>   DW_AT_name        : (indirect string, offset: 0x9f893): AHBCLKDivider
    <6a8>   DW_AT_decl_file   : 8
    <6a9>   DW_AT_decl_line   : 83
    <6aa>   DW_AT_decl_column : 12
    <6ab>   DW_AT_type        : <0xb6>
    <6af>   DW_AT_data_member_location: 8
 <2><6b0>: Abbrev Number: 2 (DW_TAG_member)
    <6b1>   DW_AT_name        : (indirect string, offset: 0x73ec): APB1CLKDivider
    <6b5>   DW_AT_decl_file   : 8
    <6b6>   DW_AT_decl_line   : 86
    <6b7>   DW_AT_decl_column : 12
    <6b8>   DW_AT_type        : <0xb6>
    <6bc>   DW_AT_data_member_location: 12
 <2><6bd>: Abbrev Number: 2 (DW_TAG_member)
    <6be>   DW_AT_name        : (indirect string, offset: 0x58738): APB2CLKDivider
    <6c2>   DW_AT_decl_file   : 8
    <6c3>   DW_AT_decl_line   : 89
    <6c4>   DW_AT_decl_column : 12
    <6c5>   DW_AT_type        : <0xb6>
    <6c9>   DW_AT_data_member_location: 16
 <2><6ca>: Abbrev Number: 0
 <1><6cb>: Abbrev Number: 4 (DW_TAG_typedef)
    <6cc>   DW_AT_name        : (indirect string, offset: 0x86d61): RCC_ClkInitTypeDef
    <6d0>   DW_AT_decl_file   : 8
    <6d1>   DW_AT_decl_line   : 92
    <6d2>   DW_AT_decl_column : 3
    <6d3>   DW_AT_type        : <0x681>
 <1><6d7>: Abbrev Number: 14 (DW_TAG_structure_type)
    <6d8>   DW_AT_byte_size   : 20
    <6d9>   DW_AT_decl_file   : 9
    <6da>   DW_AT_decl_line   : 46
    <6db>   DW_AT_decl_column : 9
    <6db>   DW_AT_sibling     : <0x721>
 <2><6df>: Abbrev Number: 33 (DW_TAG_member)
    <6e0>   DW_AT_name        : Pin
    <6e4>   DW_AT_decl_file   : 9
    <6e5>   DW_AT_decl_line   : 48
    <6e6>   DW_AT_decl_column : 12
    <6e7>   DW_AT_type        : <0xb6>
    <6eb>   DW_AT_data_member_location: 0
 <2><6ec>: Abbrev Number: 2 (DW_TAG_member)
    <6ed>   DW_AT_name        : (indirect string, offset: 0xc5840): Mode
    <6f1>   DW_AT_decl_file   : 9
    <6f2>   DW_AT_decl_line   : 51
    <6f3>   DW_AT_decl_column : 12
    <6f4>   DW_AT_type        : <0xb6>
    <6f8>   DW_AT_data_member_location: 4
 <2><6f9>: Abbrev Number: 2 (DW_TAG_member)
    <6fa>   DW_AT_name        : (indirect string, offset: 0x633cb): Pull
    <6fe>   DW_AT_decl_file   : 9
    <6ff>   DW_AT_decl_line   : 54
    <700>   DW_AT_decl_column : 12
    <701>   DW_AT_type        : <0xb6>
    <705>   DW_AT_data_member_location: 8
 <2><706>: Abbrev Number: 2 (DW_TAG_member)
    <707>   DW_AT_name        : (indirect string, offset: 0x71486): Speed
    <70b>   DW_AT_decl_file   : 9
    <70c>   DW_AT_decl_line   : 57
    <70d>   DW_AT_decl_column : 12
    <70e>   DW_AT_type        : <0xb6>
    <712>   DW_AT_data_member_location: 12
 <2><713>: Abbrev Number: 2 (DW_TAG_member)
    <714>   DW_AT_name        : (indirect string, offset: 0x586f9): Alternate
    <718>   DW_AT_decl_file   : 9
    <719>   DW_AT_decl_line   : 60
    <71a>   DW_AT_decl_column : 12
    <71b>   DW_AT_type        : <0xb6>
    <71f>   DW_AT_data_member_location: 16
 <2><720>: Abbrev Number: 0
 <1><721>: Abbrev Number: 4 (DW_TAG_typedef)
    <722>   DW_AT_name        : (indirect string, offset: 0x970fa): GPIO_InitTypeDef
    <726>   DW_AT_decl_file   : 9
    <727>   DW_AT_decl_line   : 62
    <728>   DW_AT_decl_column : 2
    <729>   DW_AT_type        : <0x6d7>
 <1><72d>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <72e>   DW_AT_encoding    : 7	(unsigned)
    <72f>   DW_AT_byte_size   : 1
    <730>   DW_AT_type        : <0x3d>
    <734>   DW_AT_decl_file   : 9
    <735>   DW_AT_decl_line   : 68
    <736>   DW_AT_decl_column : 1
    <737>   DW_AT_sibling     : <0x748>
 <2><73b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <73c>   DW_AT_name        : (indirect string, offset: 0x2874d): GPIO_PIN_RESET
    <740>   DW_AT_const_value : 0
 <2><741>: Abbrev Number: 1 (DW_TAG_enumerator)
    <742>   DW_AT_name        : (indirect string, offset: 0x2284f): GPIO_PIN_SET
    <746>   DW_AT_const_value : 1
 <2><747>: Abbrev Number: 0
 <1><748>: Abbrev Number: 4 (DW_TAG_typedef)
    <749>   DW_AT_name        : (indirect string, offset: 0xbddc4): GPIO_PinState
    <74d>   DW_AT_decl_file   : 9
    <74e>   DW_AT_decl_line   : 71
    <74f>   DW_AT_decl_column : 2
    <750>   DW_AT_type        : <0x72d>
 <1><754>: Abbrev Number: 14 (DW_TAG_structure_type)
    <755>   DW_AT_byte_size   : 48
    <756>   DW_AT_decl_file   : 10
    <757>   DW_AT_decl_line   : 48
    <758>   DW_AT_decl_column : 9
    <758>   DW_AT_sibling     : <0x7f9>
 <2><75c>: Abbrev Number: 2 (DW_TAG_member)
    <75d>   DW_AT_name        : (indirect string, offset: 0x6451b): Channel
    <761>   DW_AT_decl_file   : 10
    <762>   DW_AT_decl_line   : 50
    <763>   DW_AT_decl_column : 12
    <764>   DW_AT_type        : <0xb6>
    <768>   DW_AT_data_member_location: 0
 <2><769>: Abbrev Number: 2 (DW_TAG_member)
    <76a>   DW_AT_name        : (indirect string, offset: 0x47d0a): Direction
    <76e>   DW_AT_decl_file   : 10
    <76f>   DW_AT_decl_line   : 53
    <770>   DW_AT_decl_column : 12
    <771>   DW_AT_type        : <0xb6>
    <775>   DW_AT_data_member_location: 4
 <2><776>: Abbrev Number: 2 (DW_TAG_member)
    <777>   DW_AT_name        : (indirect string, offset: 0xca8e): PeriphInc
    <77b>   DW_AT_decl_file   : 10
    <77c>   DW_AT_decl_line   : 57
    <77d>   DW_AT_decl_column : 12
    <77e>   DW_AT_type        : <0xb6>
    <782>   DW_AT_data_member_location: 8
 <2><783>: Abbrev Number: 2 (DW_TAG_member)
    <784>   DW_AT_name        : (indirect string, offset: 0x1eb3c): MemInc
    <788>   DW_AT_decl_file   : 10
    <789>   DW_AT_decl_line   : 60
    <78a>   DW_AT_decl_column : 12
    <78b>   DW_AT_type        : <0xb6>
    <78f>   DW_AT_data_member_location: 12
 <2><790>: Abbrev Number: 2 (DW_TAG_member)
    <791>   DW_AT_name        : (indirect string, offset: 0x5febb): PeriphDataAlignment
    <795>   DW_AT_decl_file   : 10
    <796>   DW_AT_decl_line   : 63
    <797>   DW_AT_decl_column : 12
    <798>   DW_AT_type        : <0xb6>
    <79c>   DW_AT_data_member_location: 16
 <2><79d>: Abbrev Number: 2 (DW_TAG_member)
    <79e>   DW_AT_name        : (indirect string, offset: 0xae9a5): MemDataAlignment
    <7a2>   DW_AT_decl_file   : 10
    <7a3>   DW_AT_decl_line   : 66
    <7a4>   DW_AT_decl_column : 12
    <7a5>   DW_AT_type        : <0xb6>
    <7a9>   DW_AT_data_member_location: 20
 <2><7aa>: Abbrev Number: 2 (DW_TAG_member)
    <7ab>   DW_AT_name        : (indirect string, offset: 0xc5840): Mode
    <7af>   DW_AT_decl_file   : 10
    <7b0>   DW_AT_decl_line   : 69
    <7b1>   DW_AT_decl_column : 12
    <7b2>   DW_AT_type        : <0xb6>
    <7b6>   DW_AT_data_member_location: 24
 <2><7b7>: Abbrev Number: 2 (DW_TAG_member)
    <7b8>   DW_AT_name        : (indirect string, offset: 0xc4d60): Priority
    <7bc>   DW_AT_decl_file   : 10
    <7bd>   DW_AT_decl_line   : 74
    <7be>   DW_AT_decl_column : 12
    <7bf>   DW_AT_type        : <0xb6>
    <7c3>   DW_AT_data_member_location: 28
 <2><7c4>: Abbrev Number: 2 (DW_TAG_member)
    <7c5>   DW_AT_name        : (indirect string, offset: 0x53665): FIFOMode
    <7c9>   DW_AT_decl_file   : 10
    <7ca>   DW_AT_decl_line   : 77
    <7cb>   DW_AT_decl_column : 12
    <7cc>   DW_AT_type        : <0xb6>
    <7d0>   DW_AT_data_member_location: 32
 <2><7d1>: Abbrev Number: 2 (DW_TAG_member)
    <7d2>   DW_AT_name        : (indirect string, offset: 0x92be8): FIFOThreshold
    <7d6>   DW_AT_decl_file   : 10
    <7d7>   DW_AT_decl_line   : 82
    <7d8>   DW_AT_decl_column : 12
    <7d9>   DW_AT_type        : <0xb6>
    <7dd>   DW_AT_data_member_location: 36
 <2><7de>: Abbrev Number: 2 (DW_TAG_member)
    <7df>   DW_AT_name        : (indirect string, offset: 0x90f80): MemBurst
    <7e3>   DW_AT_decl_file   : 10
    <7e4>   DW_AT_decl_line   : 85
    <7e5>   DW_AT_decl_column : 12
    <7e6>   DW_AT_type        : <0xb6>
    <7ea>   DW_AT_data_member_location: 40
 <2><7eb>: Abbrev Number: 2 (DW_TAG_member)
    <7ec>   DW_AT_name        : (indirect string, offset: 0x42588): PeriphBurst
    <7f0>   DW_AT_decl_file   : 10
    <7f1>   DW_AT_decl_line   : 91
    <7f2>   DW_AT_decl_column : 12
    <7f3>   DW_AT_type        : <0xb6>
    <7f7>   DW_AT_data_member_location: 44
 <2><7f8>: Abbrev Number: 0
 <1><7f9>: Abbrev Number: 4 (DW_TAG_typedef)
    <7fa>   DW_AT_name        : (indirect string, offset: 0x342e3): DMA_InitTypeDef
    <7fe>   DW_AT_decl_file   : 10
    <7ff>   DW_AT_decl_line   : 96
    <800>   DW_AT_decl_column : 2
    <801>   DW_AT_type        : <0x754>
 <1><805>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <806>   DW_AT_encoding    : 7	(unsigned)
    <807>   DW_AT_byte_size   : 1
    <808>   DW_AT_type        : <0x3d>
    <80c>   DW_AT_decl_file   : 10
    <80d>   DW_AT_decl_line   : 103
    <80e>   DW_AT_decl_column : 1
    <80f>   DW_AT_sibling     : <0x838>
 <2><813>: Abbrev Number: 1 (DW_TAG_enumerator)
    <814>   DW_AT_name        : (indirect string, offset: 0xc5c2): HAL_DMA_STATE_RESET
    <818>   DW_AT_const_value : 0
 <2><819>: Abbrev Number: 1 (DW_TAG_enumerator)
    <81a>   DW_AT_name        : (indirect string, offset: 0x355b5): HAL_DMA_STATE_READY
    <81e>   DW_AT_const_value : 1
 <2><81f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <820>   DW_AT_name        : (indirect string, offset: 0x85429): HAL_DMA_STATE_BUSY
    <824>   DW_AT_const_value : 2
 <2><825>: Abbrev Number: 1 (DW_TAG_enumerator)
    <826>   DW_AT_name        : (indirect string, offset: 0xbe1bb): HAL_DMA_STATE_TIMEOUT
    <82a>   DW_AT_const_value : 3
 <2><82b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <82c>   DW_AT_name        : (indirect string, offset: 0x92680): HAL_DMA_STATE_ERROR
    <830>   DW_AT_const_value : 4
 <2><831>: Abbrev Number: 1 (DW_TAG_enumerator)
    <832>   DW_AT_name        : (indirect string, offset: 0x4bb1b): HAL_DMA_STATE_ABORT
    <836>   DW_AT_const_value : 5
 <2><837>: Abbrev Number: 0
 <1><838>: Abbrev Number: 4 (DW_TAG_typedef)
    <839>   DW_AT_name        : (indirect string, offset: 0xadce3): HAL_DMA_StateTypeDef
    <83d>   DW_AT_decl_file   : 10
    <83e>   DW_AT_decl_line   : 110
    <83f>   DW_AT_decl_column : 2
    <840>   DW_AT_type        : <0x805>
 <1><844>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <845>   DW_AT_type        : <0x838>
 <1><849>: Abbrev Number: 34 (DW_TAG_structure_type)
    <84a>   DW_AT_name        : (indirect string, offset: 0xa4267): __DMA_HandleTypeDef
    <84e>   DW_AT_byte_size   : 96
    <84f>   DW_AT_decl_file   : 10
    <850>   DW_AT_decl_line   : 138
    <851>   DW_AT_decl_column : 16
    <851>   DW_AT_sibling     : <0x90c>
 <2><855>: Abbrev Number: 2 (DW_TAG_member)
    <856>   DW_AT_name        : (indirect string, offset: 0xbacc7): Instance
    <85a>   DW_AT_decl_file   : 10
    <85b>   DW_AT_decl_line   : 140
    <85c>   DW_AT_decl_column : 31
    <85d>   DW_AT_type        : <0x90c>
    <861>   DW_AT_data_member_location: 0
 <2><862>: Abbrev Number: 2 (DW_TAG_member)
    <863>   DW_AT_name        : (indirect string, offset: 0xc547f): Init
    <867>   DW_AT_decl_file   : 10
    <868>   DW_AT_decl_line   : 142
    <869>   DW_AT_decl_column : 30
    <86a>   DW_AT_type        : <0x7f9>
    <86e>   DW_AT_data_member_location: 4
 <2><86f>: Abbrev Number: 2 (DW_TAG_member)
    <870>   DW_AT_name        : (indirect string, offset: 0x894e4): Lock
    <874>   DW_AT_decl_file   : 10
    <875>   DW_AT_decl_line   : 144
    <876>   DW_AT_decl_column : 30
    <877>   DW_AT_type        : <0x5a2>
    <87b>   DW_AT_data_member_location: 52
 <2><87c>: Abbrev Number: 2 (DW_TAG_member)
    <87d>   DW_AT_name        : (indirect string, offset: 0x82938): State
    <881>   DW_AT_decl_file   : 10
    <882>   DW_AT_decl_line   : 146
    <883>   DW_AT_decl_column : 30
    <884>   DW_AT_type        : <0x844>
    <888>   DW_AT_data_member_location: 53
 <2><889>: Abbrev Number: 2 (DW_TAG_member)
    <88a>   DW_AT_name        : (indirect string, offset: 0xb7be9): Parent
    <88e>   DW_AT_decl_file   : 10
    <88f>   DW_AT_decl_line   : 148
    <890>   DW_AT_decl_column : 31
    <891>   DW_AT_type        : <0x911>
    <895>   DW_AT_data_member_location: 56
 <2><896>: Abbrev Number: 2 (DW_TAG_member)
    <897>   DW_AT_name        : (indirect string, offset: 0xc05e7): XferCpltCallback
    <89b>   DW_AT_decl_file   : 10
    <89c>   DW_AT_decl_line   : 150
    <89d>   DW_AT_decl_column : 33
    <89e>   DW_AT_type        : <0x923>
    <8a2>   DW_AT_data_member_location: 60
 <2><8a3>: Abbrev Number: 2 (DW_TAG_member)
    <8a4>   DW_AT_name        : (indirect string, offset: 0x961f0): XferHalfCpltCallback
    <8a8>   DW_AT_decl_file   : 10
    <8a9>   DW_AT_decl_line   : 152
    <8aa>   DW_AT_decl_column : 33
    <8ab>   DW_AT_type        : <0x923>
    <8af>   DW_AT_data_member_location: 64
 <2><8b0>: Abbrev Number: 2 (DW_TAG_member)
    <8b1>   DW_AT_name        : (indirect string, offset: 0x716b3): XferM1CpltCallback
    <8b5>   DW_AT_decl_file   : 10
    <8b6>   DW_AT_decl_line   : 154
    <8b7>   DW_AT_decl_column : 33
    <8b8>   DW_AT_type        : <0x923>
    <8bc>   DW_AT_data_member_location: 68
 <2><8bd>: Abbrev Number: 2 (DW_TAG_member)
    <8be>   DW_AT_name        : (indirect string, offset: 0x5cd5a): XferM1HalfCpltCallback
    <8c2>   DW_AT_decl_file   : 10
    <8c3>   DW_AT_decl_line   : 156
    <8c4>   DW_AT_decl_column : 33
    <8c5>   DW_AT_type        : <0x923>
    <8c9>   DW_AT_data_member_location: 72
 <2><8ca>: Abbrev Number: 2 (DW_TAG_member)
    <8cb>   DW_AT_name        : (indirect string, offset: 0x1c34a): XferErrorCallback
    <8cf>   DW_AT_decl_file   : 10
    <8d0>   DW_AT_decl_line   : 158
    <8d1>   DW_AT_decl_column : 33
    <8d2>   DW_AT_type        : <0x923>
    <8d6>   DW_AT_data_member_location: 76
 <2><8d7>: Abbrev Number: 2 (DW_TAG_member)
    <8d8>   DW_AT_name        : (indirect string, offset: 0xb46d7): XferAbortCallback
    <8dc>   DW_AT_decl_file   : 10
    <8dd>   DW_AT_decl_line   : 160
    <8de>   DW_AT_decl_column : 33
    <8df>   DW_AT_type        : <0x923>
    <8e3>   DW_AT_data_member_location: 80
 <2><8e4>: Abbrev Number: 2 (DW_TAG_member)
    <8e5>   DW_AT_name        : (indirect string, offset: 0xbcec6): ErrorCode
    <8e9>   DW_AT_decl_file   : 10
    <8ea>   DW_AT_decl_line   : 162
    <8eb>   DW_AT_decl_column : 30
    <8ec>   DW_AT_type        : <0xc2>
    <8f0>   DW_AT_data_member_location: 84
 <2><8f1>: Abbrev Number: 2 (DW_TAG_member)
    <8f2>   DW_AT_name        : (indirect string, offset: 0x5657b): StreamBaseAddress
    <8f6>   DW_AT_decl_file   : 10
    <8f7>   DW_AT_decl_line   : 164
    <8f8>   DW_AT_decl_column : 30
    <8f9>   DW_AT_type        : <0xb6>
    <8fd>   DW_AT_data_member_location: 88
 <2><8fe>: Abbrev Number: 2 (DW_TAG_member)
    <8ff>   DW_AT_name        : (indirect string, offset: 0xa23ad): StreamIndex
    <903>   DW_AT_decl_file   : 10
    <904>   DW_AT_decl_line   : 166
    <905>   DW_AT_decl_column : 30
    <906>   DW_AT_type        : <0xb6>
    <90a>   DW_AT_data_member_location: 92
 <2><90b>: Abbrev Number: 0
 <1><90c>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <90d>   DW_AT_byte_size   : 4
    <90d>   DW_AT_type        : <0x12e>
 <1><911>: Abbrev Number: 41 (DW_TAG_pointer_type)
    <912>   DW_AT_byte_size   : 4
 <1><913>: Abbrev Number: 35 (DW_TAG_subroutine_type)
    <914>   DW_AT_prototyped  : 1
    <914>   DW_AT_sibling     : <0x91e>
 <2><918>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <919>   DW_AT_type        : <0x91e>
 <2><91d>: Abbrev Number: 0
 <1><91e>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <91f>   DW_AT_byte_size   : 4
    <91f>   DW_AT_type        : <0x849>
 <1><923>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <924>   DW_AT_byte_size   : 4
    <924>   DW_AT_type        : <0x913>
 <1><928>: Abbrev Number: 4 (DW_TAG_typedef)
    <929>   DW_AT_name        : (indirect string, offset: 0xa4269): DMA_HandleTypeDef
    <92d>   DW_AT_decl_file   : 10
    <92e>   DW_AT_decl_line   : 168
    <92f>   DW_AT_decl_column : 2
    <930>   DW_AT_type        : <0x849>
 <1><934>: Abbrev Number: 14 (DW_TAG_structure_type)
    <935>   DW_AT_byte_size   : 24
    <936>   DW_AT_decl_file   : 11
    <937>   DW_AT_decl_line   : 46
    <938>   DW_AT_decl_column : 9
    <938>   DW_AT_sibling     : <0x98b>
 <2><93c>: Abbrev Number: 2 (DW_TAG_member)
    <93d>   DW_AT_name        : (indirect string, offset: 0xc23fb): Prescaler
    <941>   DW_AT_decl_file   : 11
    <942>   DW_AT_decl_line   : 48
    <943>   DW_AT_decl_column : 12
    <944>   DW_AT_type        : <0xb6>
    <948>   DW_AT_data_member_location: 0
 <2><949>: Abbrev Number: 2 (DW_TAG_member)
    <94a>   DW_AT_name        : (indirect string, offset: 0xaf971): CounterMode
    <94e>   DW_AT_decl_file   : 11
    <94f>   DW_AT_decl_line   : 51
    <950>   DW_AT_decl_column : 12
    <951>   DW_AT_type        : <0xb6>
    <955>   DW_AT_data_member_location: 4
 <2><956>: Abbrev Number: 2 (DW_TAG_member)
    <957>   DW_AT_name        : (indirect string, offset: 0xcbb35): Period
    <95b>   DW_AT_decl_file   : 11
    <95c>   DW_AT_decl_line   : 54
    <95d>   DW_AT_decl_column : 12
    <95e>   DW_AT_type        : <0xb6>
    <962>   DW_AT_data_member_location: 8
 <2><963>: Abbrev Number: 2 (DW_TAG_member)
    <964>   DW_AT_name        : (indirect string, offset: 0x4e977): ClockDivision
    <968>   DW_AT_decl_file   : 11
    <969>   DW_AT_decl_line   : 58
    <96a>   DW_AT_decl_column : 12
    <96b>   DW_AT_type        : <0xb6>
    <96f>   DW_AT_data_member_location: 12
 <2><970>: Abbrev Number: 2 (DW_TAG_member)
    <971>   DW_AT_name        : (indirect string, offset: 0x86a94): RepetitionCounter
    <975>   DW_AT_decl_file   : 11
    <976>   DW_AT_decl_line   : 61
    <977>   DW_AT_decl_column : 12
    <978>   DW_AT_type        : <0xb6>
    <97c>   DW_AT_data_member_location: 16
 <2><97d>: Abbrev Number: 2 (DW_TAG_member)
    <97e>   DW_AT_name        : (indirect string, offset: 0xb262d): AutoReloadPreload
    <982>   DW_AT_decl_file   : 11
    <983>   DW_AT_decl_line   : 72
    <984>   DW_AT_decl_column : 12
    <985>   DW_AT_type        : <0xb6>
    <989>   DW_AT_data_member_location: 20
 <2><98a>: Abbrev Number: 0
 <1><98b>: Abbrev Number: 4 (DW_TAG_typedef)
    <98c>   DW_AT_name        : (indirect string, offset: 0x42e38): TIM_Base_InitTypeDef
    <990>   DW_AT_decl_file   : 11
    <991>   DW_AT_decl_line   : 74
    <992>   DW_AT_decl_column : 3
    <993>   DW_AT_type        : <0x934>
 <1><997>: Abbrev Number: 24 (DW_TAG_enumeration_type)
    <998>   DW_AT_encoding    : 7	(unsigned)
    <998>   DW_AT_byte_size   : 1
    <998>   DW_AT_type        : <0x3d>
    <99c>   DW_AT_decl_file   : 11
    <99c>   DW_AT_decl_line   : 291
    <99e>   DW_AT_decl_column : 1
    <99e>   DW_AT_sibling     : <0x9c1>
 <2><9a2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9a3>   DW_AT_name        : (indirect string, offset: 0xa7b88): HAL_TIM_STATE_RESET
    <9a7>   DW_AT_const_value : 0
 <2><9a8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9a9>   DW_AT_name        : (indirect string, offset: 0x6a75): HAL_TIM_STATE_READY
    <9ad>   DW_AT_const_value : 1
 <2><9ae>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9af>   DW_AT_name        : (indirect string, offset: 0x310e1): HAL_TIM_STATE_BUSY
    <9b3>   DW_AT_const_value : 2
 <2><9b4>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9b5>   DW_AT_name        : (indirect string, offset: 0xa15eb): HAL_TIM_STATE_TIMEOUT
    <9b9>   DW_AT_const_value : 3
 <2><9ba>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9bb>   DW_AT_name        : (indirect string, offset: 0x77010): HAL_TIM_STATE_ERROR
    <9bf>   DW_AT_const_value : 4
 <2><9c0>: Abbrev Number: 0
 <1><9c1>: Abbrev Number: 11 (DW_TAG_typedef)
    <9c2>   DW_AT_name        : (indirect string, offset: 0x7e75f): HAL_TIM_StateTypeDef
    <9c6>   DW_AT_decl_file   : 11
    <9c7>   DW_AT_decl_line   : 297
    <9c9>   DW_AT_decl_column : 3
    <9c9>   DW_AT_type        : <0x997>
 <1><9cd>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <9ce>   DW_AT_type        : <0x9c1>
 <1><9d2>: Abbrev Number: 24 (DW_TAG_enumeration_type)
    <9d3>   DW_AT_encoding    : 7	(unsigned)
    <9d3>   DW_AT_byte_size   : 1
    <9d3>   DW_AT_type        : <0x3d>
    <9d7>   DW_AT_decl_file   : 11
    <9d7>   DW_AT_decl_line   : 303
    <9d9>   DW_AT_decl_column : 1
    <9d9>   DW_AT_sibling     : <0x9f0>
 <2><9dd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9de>   DW_AT_name        : (indirect string, offset: 0x87e82): HAL_TIM_CHANNEL_STATE_RESET
    <9e2>   DW_AT_const_value : 0
 <2><9e3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9e4>   DW_AT_name        : (indirect string, offset: 0x71979): HAL_TIM_CHANNEL_STATE_READY
    <9e8>   DW_AT_const_value : 1
 <2><9e9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9ea>   DW_AT_name        : (indirect string, offset: 0x5cee5): HAL_TIM_CHANNEL_STATE_BUSY
    <9ee>   DW_AT_const_value : 2
 <2><9ef>: Abbrev Number: 0
 <1><9f0>: Abbrev Number: 11 (DW_TAG_typedef)
    <9f1>   DW_AT_name        : (indirect string, offset: 0x29030): HAL_TIM_ChannelStateTypeDef
    <9f5>   DW_AT_decl_file   : 11
    <9f6>   DW_AT_decl_line   : 307
    <9f8>   DW_AT_decl_column : 3
    <9f8>   DW_AT_type        : <0x9d2>
 <1><9fc>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <9fd>   DW_AT_type        : <0x9f0>
 <1><a01>: Abbrev Number: 24 (DW_TAG_enumeration_type)
    <a02>   DW_AT_encoding    : 7	(unsigned)
    <a02>   DW_AT_byte_size   : 1
    <a02>   DW_AT_type        : <0x3d>
    <a06>   DW_AT_decl_file   : 11
    <a06>   DW_AT_decl_line   : 313
    <a08>   DW_AT_decl_column : 1
    <a08>   DW_AT_sibling     : <0xa1f>
 <2><a0c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a0d>   DW_AT_name        : (indirect string, offset: 0x3beb): HAL_DMA_BURST_STATE_RESET
    <a11>   DW_AT_const_value : 0
 <2><a12>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a13>   DW_AT_name        : (indirect string, offset: 0x6a68d): HAL_DMA_BURST_STATE_READY
    <a17>   DW_AT_const_value : 1
 <2><a18>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a19>   DW_AT_name        : (indirect string, offset: 0x415c1): HAL_DMA_BURST_STATE_BUSY
    <a1d>   DW_AT_const_value : 2
 <2><a1e>: Abbrev Number: 0
 <1><a1f>: Abbrev Number: 11 (DW_TAG_typedef)
    <a20>   DW_AT_name        : (indirect string, offset: 0x1aa6e): HAL_TIM_DMABurstStateTypeDef
    <a24>   DW_AT_decl_file   : 11
    <a25>   DW_AT_decl_line   : 317
    <a27>   DW_AT_decl_column : 3
    <a27>   DW_AT_type        : <0xa01>
 <1><a2b>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <a2c>   DW_AT_type        : <0xa1f>
 <1><a30>: Abbrev Number: 24 (DW_TAG_enumeration_type)
    <a31>   DW_AT_encoding    : 7	(unsigned)
    <a31>   DW_AT_byte_size   : 1
    <a31>   DW_AT_type        : <0x3d>
    <a35>   DW_AT_decl_file   : 11
    <a35>   DW_AT_decl_line   : 323
    <a37>   DW_AT_decl_column : 1
    <a37>   DW_AT_sibling     : <0xa5a>
 <2><a3b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a3c>   DW_AT_name        : (indirect string, offset: 0x6c612): HAL_TIM_ACTIVE_CHANNEL_1
    <a40>   DW_AT_const_value : 1
 <2><a41>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a42>   DW_AT_name        : (indirect string, offset: 0x6c62b): HAL_TIM_ACTIVE_CHANNEL_2
    <a46>   DW_AT_const_value : 2
 <2><a47>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a48>   DW_AT_name        : (indirect string, offset: 0x6c644): HAL_TIM_ACTIVE_CHANNEL_3
    <a4c>   DW_AT_const_value : 4
 <2><a4d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a4e>   DW_AT_name        : (indirect string, offset: 0x6c65d): HAL_TIM_ACTIVE_CHANNEL_4
    <a52>   DW_AT_const_value : 8
 <2><a53>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a54>   DW_AT_name        : (indirect string, offset: 0x4faf2): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <a58>   DW_AT_const_value : 0
 <2><a59>: Abbrev Number: 0
 <1><a5a>: Abbrev Number: 11 (DW_TAG_typedef)
    <a5b>   DW_AT_name        : (indirect string, offset: 0x6450d): HAL_TIM_ActiveChannel
    <a5f>   DW_AT_decl_file   : 11
    <a60>   DW_AT_decl_line   : 329
    <a62>   DW_AT_decl_column : 3
    <a62>   DW_AT_type        : <0xa30>
 <1><a66>: Abbrev Number: 15 (DW_TAG_structure_type)
    <a67>   DW_AT_byte_size   : 72
    <a68>   DW_AT_decl_file   : 11
    <a69>   DW_AT_decl_line   : 337
    <a6b>   DW_AT_decl_column : 9
    <a6b>   DW_AT_sibling     : <0xaee>
 <2><a6f>: Abbrev Number: 3 (DW_TAG_member)
    <a70>   DW_AT_name        : (indirect string, offset: 0xbacc7): Instance
    <a74>   DW_AT_decl_file   : 11
    <a75>   DW_AT_decl_line   : 340
    <a77>   DW_AT_decl_column : 39
    <a78>   DW_AT_type        : <0xaee>
    <a7c>   DW_AT_data_member_location: 0
 <2><a7d>: Abbrev Number: 3 (DW_TAG_member)
    <a7e>   DW_AT_name        : (indirect string, offset: 0xc547f): Init
    <a82>   DW_AT_decl_file   : 11
    <a83>   DW_AT_decl_line   : 341
    <a85>   DW_AT_decl_column : 38
    <a86>   DW_AT_type        : <0x98b>
    <a8a>   DW_AT_data_member_location: 4
 <2><a8b>: Abbrev Number: 3 (DW_TAG_member)
    <a8c>   DW_AT_name        : (indirect string, offset: 0x6451b): Channel
    <a90>   DW_AT_decl_file   : 11
    <a91>   DW_AT_decl_line   : 342
    <a93>   DW_AT_decl_column : 38
    <a94>   DW_AT_type        : <0xa5a>
    <a98>   DW_AT_data_member_location: 28
 <2><a99>: Abbrev Number: 3 (DW_TAG_member)
    <a9a>   DW_AT_name        : (indirect string, offset: 0x73d35): hdma
    <a9e>   DW_AT_decl_file   : 11
    <a9f>   DW_AT_decl_line   : 343
    <aa1>   DW_AT_decl_column : 39
    <aa2>   DW_AT_type        : <0xaf3>
    <aa6>   DW_AT_data_member_location: 32
 <2><aa7>: Abbrev Number: 3 (DW_TAG_member)
    <aa8>   DW_AT_name        : (indirect string, offset: 0x894e4): Lock
    <aac>   DW_AT_decl_file   : 11
    <aad>   DW_AT_decl_line   : 345
    <aaf>   DW_AT_decl_column : 38
    <ab0>   DW_AT_type        : <0x5a2>
    <ab4>   DW_AT_data_member_location: 60
 <2><ab5>: Abbrev Number: 3 (DW_TAG_member)
    <ab6>   DW_AT_name        : (indirect string, offset: 0x82938): State
    <aba>   DW_AT_decl_file   : 11
    <abb>   DW_AT_decl_line   : 346
    <abd>   DW_AT_decl_column : 38
    <abe>   DW_AT_type        : <0x9cd>
    <ac2>   DW_AT_data_member_location: 61
 <2><ac3>: Abbrev Number: 3 (DW_TAG_member)
    <ac4>   DW_AT_name        : (indirect string, offset: 0xc5f08): ChannelState
    <ac8>   DW_AT_decl_file   : 11
    <ac9>   DW_AT_decl_line   : 347
    <acb>   DW_AT_decl_column : 38
    <acc>   DW_AT_type        : <0xb18>
    <ad0>   DW_AT_data_member_location: 62
 <2><ad1>: Abbrev Number: 3 (DW_TAG_member)
    <ad2>   DW_AT_name        : (indirect string, offset: 0xc6539): ChannelNState
    <ad6>   DW_AT_decl_file   : 11
    <ad7>   DW_AT_decl_line   : 348
    <ad9>   DW_AT_decl_column : 38
    <ada>   DW_AT_type        : <0xb18>
    <ade>   DW_AT_data_member_location: 66
 <2><adf>: Abbrev Number: 3 (DW_TAG_member)
    <ae0>   DW_AT_name        : (indirect string, offset: 0xc5a96): DMABurstState
    <ae4>   DW_AT_decl_file   : 11
    <ae5>   DW_AT_decl_line   : 349
    <ae7>   DW_AT_decl_column : 38
    <ae8>   DW_AT_type        : <0xa2b>
    <aec>   DW_AT_data_member_location: 70
 <2><aed>: Abbrev Number: 0
 <1><aee>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <aef>   DW_AT_byte_size   : 4
    <aef>   DW_AT_type        : <0x4d7>
 <1><af3>: Abbrev Number: 22 (DW_TAG_array_type)
    <af4>   DW_AT_type        : <0xb03>
    <af8>   DW_AT_sibling     : <0xb03>
 <2><afc>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <afd>   DW_AT_type        : <0x8d>
    <b01>   DW_AT_upper_bound : 6
 <2><b02>: Abbrev Number: 0
 <1><b03>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <b04>   DW_AT_byte_size   : 4
    <b04>   DW_AT_type        : <0x928>
 <1><b08>: Abbrev Number: 22 (DW_TAG_array_type)
    <b09>   DW_AT_type        : <0x9fc>
    <b0d>   DW_AT_sibling     : <0xb18>
 <2><b11>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <b12>   DW_AT_type        : <0x8d>
    <b16>   DW_AT_upper_bound : 3
 <2><b17>: Abbrev Number: 0
 <1><b18>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <b19>   DW_AT_type        : <0xb08>
 <1><b1d>: Abbrev Number: 11 (DW_TAG_typedef)
    <b1e>   DW_AT_name        : (indirect string, offset: 0x42892): TIM_HandleTypeDef
    <b22>   DW_AT_decl_file   : 11
    <b23>   DW_AT_decl_line   : 380
    <b25>   DW_AT_decl_column : 3
    <b25>   DW_AT_type        : <0xa66>
 <1><b29>: Abbrev Number: 14 (DW_TAG_structure_type)
    <b2a>   DW_AT_byte_size   : 28
    <b2b>   DW_AT_decl_file   : 12
    <b2c>   DW_AT_decl_line   : 46
    <b2d>   DW_AT_decl_column : 9
    <b2d>   DW_AT_sibling     : <0xb8d>
 <2><b31>: Abbrev Number: 2 (DW_TAG_member)
    <b32>   DW_AT_name        : (indirect string, offset: 0xb0d01): BaudRate
    <b36>   DW_AT_decl_file   : 12
    <b37>   DW_AT_decl_line   : 48
    <b38>   DW_AT_decl_column : 12
    <b39>   DW_AT_type        : <0xb6>
    <b3d>   DW_AT_data_member_location: 0
 <2><b3e>: Abbrev Number: 2 (DW_TAG_member)
    <b3f>   DW_AT_name        : (indirect string, offset: 0x50b4f): WordLength
    <b43>   DW_AT_decl_file   : 12
    <b44>   DW_AT_decl_line   : 54
    <b45>   DW_AT_decl_column : 12
    <b46>   DW_AT_type        : <0xb6>
    <b4a>   DW_AT_data_member_location: 4
 <2><b4b>: Abbrev Number: 2 (DW_TAG_member)
    <b4c>   DW_AT_name        : (indirect string, offset: 0xb10a4): StopBits
    <b50>   DW_AT_decl_file   : 12
    <b51>   DW_AT_decl_line   : 57
    <b52>   DW_AT_decl_column : 12
    <b53>   DW_AT_type        : <0xb6>
    <b57>   DW_AT_data_member_location: 8
 <2><b58>: Abbrev Number: 2 (DW_TAG_member)
    <b59>   DW_AT_name        : (indirect string, offset: 0x45a21): Parity
    <b5d>   DW_AT_decl_file   : 12
    <b5e>   DW_AT_decl_line   : 60
    <b5f>   DW_AT_decl_column : 12
    <b60>   DW_AT_type        : <0xb6>
    <b64>   DW_AT_data_member_location: 12
 <2><b65>: Abbrev Number: 2 (DW_TAG_member)
    <b66>   DW_AT_name        : (indirect string, offset: 0xc5840): Mode
    <b6a>   DW_AT_decl_file   : 12
    <b6b>   DW_AT_decl_line   : 67
    <b6c>   DW_AT_decl_column : 12
    <b6d>   DW_AT_type        : <0xb6>
    <b71>   DW_AT_data_member_location: 16
 <2><b72>: Abbrev Number: 2 (DW_TAG_member)
    <b73>   DW_AT_name        : (indirect string, offset: 0x1672b): HwFlowCtl
    <b77>   DW_AT_decl_file   : 12
    <b78>   DW_AT_decl_line   : 70
    <b79>   DW_AT_decl_column : 12
    <b7a>   DW_AT_type        : <0xb6>
    <b7e>   DW_AT_data_member_location: 20
 <2><b7f>: Abbrev Number: 2 (DW_TAG_member)
    <b80>   DW_AT_name        : (indirect string, offset: 0xa1e7b): OverSampling
    <b84>   DW_AT_decl_file   : 12
    <b85>   DW_AT_decl_line   : 73
    <b86>   DW_AT_decl_column : 12
    <b87>   DW_AT_type        : <0xb6>
    <b8b>   DW_AT_data_member_location: 24
 <2><b8c>: Abbrev Number: 0
 <1><b8d>: Abbrev Number: 4 (DW_TAG_typedef)
    <b8e>   DW_AT_name        : (indirect string, offset: 0x36a7c): UART_InitTypeDef
    <b92>   DW_AT_decl_file   : 12
    <b93>   DW_AT_decl_line   : 75
    <b94>   DW_AT_decl_column : 3
    <b95>   DW_AT_type        : <0xb29>
 <1><b99>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <b9a>   DW_AT_encoding    : 7	(unsigned)
    <b9b>   DW_AT_byte_size   : 1
    <b9c>   DW_AT_type        : <0x3d>
    <ba0>   DW_AT_decl_file   : 12
    <ba1>   DW_AT_decl_line   : 117
    <ba2>   DW_AT_decl_column : 1
    <ba3>   DW_AT_sibling     : <0xbd8>
 <2><ba7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ba8>   DW_AT_name        : (indirect string, offset: 0x7162a): HAL_UART_STATE_RESET
    <bac>   DW_AT_const_value : 0
 <2><bad>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bae>   DW_AT_name        : (indirect string, offset: 0x5db35): HAL_UART_STATE_READY
    <bb2>   DW_AT_const_value : 32
 <2><bb3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bb4>   DW_AT_name        : (indirect string, offset: 0xab15c): HAL_UART_STATE_BUSY
    <bb8>   DW_AT_const_value : 36
 <2><bb9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bba>   DW_AT_name        : (indirect string, offset: 0x231f): HAL_UART_STATE_BUSY_TX
    <bbe>   DW_AT_const_value : 33
 <2><bbf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bc0>   DW_AT_name        : (indirect string, offset: 0x1707): HAL_UART_STATE_BUSY_RX
    <bc4>   DW_AT_const_value : 34
 <2><bc5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bc6>   DW_AT_name        : (indirect string, offset: 0x2bcb7): HAL_UART_STATE_BUSY_TX_RX
    <bca>   DW_AT_const_value : 35
 <2><bcb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bcc>   DW_AT_name        : (indirect string, offset: 0x5d9cd): HAL_UART_STATE_TIMEOUT
    <bd0>   DW_AT_const_value : 160
 <2><bd1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bd2>   DW_AT_name        : (indirect string, offset: 0x7a4fe): HAL_UART_STATE_ERROR
    <bd6>   DW_AT_const_value : 224
 <2><bd7>: Abbrev Number: 0
 <1><bd8>: Abbrev Number: 4 (DW_TAG_typedef)
    <bd9>   DW_AT_name        : (indirect string, offset: 0x3b470): HAL_UART_StateTypeDef
    <bdd>   DW_AT_decl_file   : 12
    <bde>   DW_AT_decl_line   : 135
    <bdf>   DW_AT_decl_column : 3
    <be0>   DW_AT_type        : <0xb99>
 <1><be4>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <be5>   DW_AT_type        : <0xbd8>
 <1><be9>: Abbrev Number: 4 (DW_TAG_typedef)
    <bea>   DW_AT_name        : (indirect string, offset: 0x4f28e): HAL_UART_RxTypeTypeDef
    <bee>   DW_AT_decl_file   : 12
    <bef>   DW_AT_decl_line   : 144
    <bf0>   DW_AT_decl_column : 18
    <bf1>   DW_AT_type        : <0xb6>
 <1><bf5>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <bf6>   DW_AT_type        : <0xbe9>
 <1><bfa>: Abbrev Number: 4 (DW_TAG_typedef)
    <bfb>   DW_AT_name        : (indirect string, offset: 0x188b0): HAL_UART_RxEventTypeTypeDef
    <bff>   DW_AT_decl_file   : 12
    <c00>   DW_AT_decl_line   : 155
    <c01>   DW_AT_decl_column : 18
    <c02>   DW_AT_type        : <0xb6>
 <1><c06>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <c07>   DW_AT_type        : <0xbfa>
 <1><c0b>: Abbrev Number: 34 (DW_TAG_structure_type)
    <c0c>   DW_AT_name        : (indirect string, offset: 0x6fb4c): __UART_HandleTypeDef
    <c10>   DW_AT_byte_size   : 72
    <c11>   DW_AT_decl_file   : 12
    <c12>   DW_AT_decl_line   : 160
    <c13>   DW_AT_decl_column : 16
    <c13>   DW_AT_sibling     : <0xce8>
 <2><c17>: Abbrev Number: 2 (DW_TAG_member)
    <c18>   DW_AT_name        : (indirect string, offset: 0xbacc7): Instance
    <c1c>   DW_AT_decl_file   : 12
    <c1d>   DW_AT_decl_line   : 162
    <c1e>   DW_AT_decl_column : 34
    <c1f>   DW_AT_type        : <0xce8>
    <c23>   DW_AT_data_member_location: 0
 <2><c24>: Abbrev Number: 2 (DW_TAG_member)
    <c25>   DW_AT_name        : (indirect string, offset: 0xc547f): Init
    <c29>   DW_AT_decl_file   : 12
    <c2a>   DW_AT_decl_line   : 164
    <c2b>   DW_AT_decl_column : 33
    <c2c>   DW_AT_type        : <0xb8d>
    <c30>   DW_AT_data_member_location: 4
 <2><c31>: Abbrev Number: 2 (DW_TAG_member)
    <c32>   DW_AT_name        : (indirect string, offset: 0x5c52d): pTxBuffPtr
    <c36>   DW_AT_decl_file   : 12
    <c37>   DW_AT_decl_line   : 166
    <c38>   DW_AT_decl_column : 34
    <c39>   DW_AT_type        : <0xced>
    <c3d>   DW_AT_data_member_location: 32
 <2><c3e>: Abbrev Number: 2 (DW_TAG_member)
    <c3f>   DW_AT_name        : (indirect string, offset: 0x516ef): TxXferSize
    <c43>   DW_AT_decl_file   : 12
    <c44>   DW_AT_decl_line   : 168
    <c45>   DW_AT_decl_column : 33
    <c46>   DW_AT_type        : <0xa5>
    <c4a>   DW_AT_data_member_location: 36
 <2><c4b>: Abbrev Number: 2 (DW_TAG_member)
    <c4c>   DW_AT_name        : (indirect string, offset: 0x5d864): TxXferCount
    <c50>   DW_AT_decl_file   : 12
    <c51>   DW_AT_decl_line   : 170
    <c52>   DW_AT_decl_column : 33
    <c53>   DW_AT_type        : <0xb1>
    <c57>   DW_AT_data_member_location: 38
 <2><c58>: Abbrev Number: 2 (DW_TAG_member)
    <c59>   DW_AT_name        : (indirect string, offset: 0xb3922): pRxBuffPtr
    <c5d>   DW_AT_decl_file   : 12
    <c5e>   DW_AT_decl_line   : 172
    <c5f>   DW_AT_decl_column : 34
    <c60>   DW_AT_type        : <0xcf2>
    <c64>   DW_AT_data_member_location: 40
 <2><c65>: Abbrev Number: 2 (DW_TAG_member)
    <c66>   DW_AT_name        : (indirect string, offset: 0x5ff52): RxXferSize
    <c6a>   DW_AT_decl_file   : 12
    <c6b>   DW_AT_decl_line   : 174
    <c6c>   DW_AT_decl_column : 33
    <c6d>   DW_AT_type        : <0xa5>
    <c71>   DW_AT_data_member_location: 44
 <2><c72>: Abbrev Number: 2 (DW_TAG_member)
    <c73>   DW_AT_name        : (indirect string, offset: 0x73f17): RxXferCount
    <c77>   DW_AT_decl_file   : 12
    <c78>   DW_AT_decl_line   : 176
    <c79>   DW_AT_decl_column : 33
    <c7a>   DW_AT_type        : <0xb1>
    <c7e>   DW_AT_data_member_location: 46
 <2><c7f>: Abbrev Number: 2 (DW_TAG_member)
    <c80>   DW_AT_name        : (indirect string, offset: 0x96d4b): ReceptionType
    <c84>   DW_AT_decl_file   : 12
    <c85>   DW_AT_decl_line   : 178
    <c86>   DW_AT_decl_column : 31
    <c87>   DW_AT_type        : <0xbf5>
    <c8b>   DW_AT_data_member_location: 48
 <2><c8c>: Abbrev Number: 2 (DW_TAG_member)
    <c8d>   DW_AT_name        : (indirect string, offset: 0xc6725): RxEventType
    <c91>   DW_AT_decl_file   : 12
    <c92>   DW_AT_decl_line   : 180
    <c93>   DW_AT_decl_column : 36
    <c94>   DW_AT_type        : <0xc06>
    <c98>   DW_AT_data_member_location: 52
 <2><c99>: Abbrev Number: 2 (DW_TAG_member)
    <c9a>   DW_AT_name        : (indirect string, offset: 0xbc2ea): hdmatx
    <c9e>   DW_AT_decl_file   : 12
    <c9f>   DW_AT_decl_line   : 182
    <ca0>   DW_AT_decl_column : 34
    <ca1>   DW_AT_type        : <0xb03>
    <ca5>   DW_AT_data_member_location: 56
 <2><ca6>: Abbrev Number: 2 (DW_TAG_member)
    <ca7>   DW_AT_name        : (indirect string, offset: 0xbb5db): hdmarx
    <cab>   DW_AT_decl_file   : 12
    <cac>   DW_AT_decl_line   : 184
    <cad>   DW_AT_decl_column : 34
    <cae>   DW_AT_type        : <0xb03>
    <cb2>   DW_AT_data_member_location: 60
 <2><cb3>: Abbrev Number: 2 (DW_TAG_member)
    <cb4>   DW_AT_name        : (indirect string, offset: 0x894e4): Lock
    <cb8>   DW_AT_decl_file   : 12
    <cb9>   DW_AT_decl_line   : 186
    <cba>   DW_AT_decl_column : 33
    <cbb>   DW_AT_type        : <0x5a2>
    <cbf>   DW_AT_data_member_location: 64
 <2><cc0>: Abbrev Number: 2 (DW_TAG_member)
    <cc1>   DW_AT_name        : (indirect string, offset: 0x4e8b3): gState
    <cc5>   DW_AT_decl_file   : 12
    <cc6>   DW_AT_decl_line   : 188
    <cc7>   DW_AT_decl_column : 33
    <cc8>   DW_AT_type        : <0xbe4>
    <ccc>   DW_AT_data_member_location: 65
 <2><ccd>: Abbrev Number: 2 (DW_TAG_member)
    <cce>   DW_AT_name        : (indirect string, offset: 0x59c8): RxState
    <cd2>   DW_AT_decl_file   : 12
    <cd3>   DW_AT_decl_line   : 192
    <cd4>   DW_AT_decl_column : 33
    <cd5>   DW_AT_type        : <0xbe4>
    <cd9>   DW_AT_data_member_location: 66
 <2><cda>: Abbrev Number: 2 (DW_TAG_member)
    <cdb>   DW_AT_name        : (indirect string, offset: 0xbcec6): ErrorCode
    <cdf>   DW_AT_decl_file   : 12
    <ce0>   DW_AT_decl_line   : 195
    <ce1>   DW_AT_decl_column : 33
    <ce2>   DW_AT_type        : <0xc2>
    <ce6>   DW_AT_data_member_location: 68
 <2><ce7>: Abbrev Number: 0
 <1><ce8>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <ce9>   DW_AT_byte_size   : 4
    <ce9>   DW_AT_type        : <0x541>
 <1><ced>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <cee>   DW_AT_byte_size   : 4
    <cee>   DW_AT_type        : <0xa0>
 <1><cf2>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <cf3>   DW_AT_byte_size   : 4
    <cf3>   DW_AT_type        : <0x94>
 <1><cf7>: Abbrev Number: 4 (DW_TAG_typedef)
    <cf8>   DW_AT_name        : (indirect string, offset: 0x6fb4e): UART_HandleTypeDef
    <cfc>   DW_AT_decl_file   : 12
    <cfd>   DW_AT_decl_line   : 213
    <cfe>   DW_AT_decl_column : 3
    <cff>   DW_AT_type        : <0xc0b>
 <1><d03>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <d04>   DW_AT_byte_size   : 4
    <d04>   DW_AT_type        : <0xd08>
 <1><d08>: Abbrev Number: 35 (DW_TAG_subroutine_type)
    <d09>   DW_AT_prototyped  : 1
    <d09>   DW_AT_sibling     : <0xd13>
 <2><d0d>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <d0e>   DW_AT_type        : <0x911>
 <2><d12>: Abbrev Number: 0
 <1><d13>: Abbrev Number: 4 (DW_TAG_typedef)
    <d14>   DW_AT_name        : (indirect string, offset: 0x47c5d): TickType_t
    <d18>   DW_AT_decl_file   : 13
    <d19>   DW_AT_decl_line   : 63
    <d1a>   DW_AT_decl_column : 19
    <d1b>   DW_AT_type        : <0xb6>
 <1><d1f>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <d20>   DW_AT_byte_size   : 4
    <d20>   DW_AT_type        : <0xd24>
 <1><d24>: Abbrev Number: 9 (DW_TAG_base_type)
    <d25>   DW_AT_byte_size   : 1
    <d26>   DW_AT_encoding    : 8	(unsigned char)
    <d27>   DW_AT_name        : (indirect string, offset: 0x3ee55): char
 <1><d2b>: Abbrev Number: 28 (DW_TAG_const_type)
    <d2c>   DW_AT_type        : <0xd24>
 <1><d30>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <d31>   DW_AT_byte_size   : 4
    <d31>   DW_AT_type        : <0xd2b>
 <1><d35>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <d36>   DW_AT_encoding    : 5	(signed)
    <d37>   DW_AT_byte_size   : 4
    <d38>   DW_AT_type        : <0x86>
    <d3c>   DW_AT_decl_file   : 14
    <d3d>   DW_AT_decl_line   : 82
    <d3e>   DW_AT_decl_column : 14
    <d3f>   DW_AT_sibling     : <0xe81>
 <2><d43>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d44>   DW_AT_name        : (indirect string, offset: 0x39b7c): osPriorityNone
    <d48>   DW_AT_const_value : 0
 <2><d49>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d4a>   DW_AT_name        : (indirect string, offset: 0xa7752): osPriorityIdle
    <d4e>   DW_AT_const_value : 1
 <2><d4f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d50>   DW_AT_name        : (indirect string, offset: 0xb21c6): osPriorityLow
    <d54>   DW_AT_const_value : 8
 <2><d55>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d56>   DW_AT_name        : (indirect string, offset: 0x9a3e0): osPriorityLow1
    <d5a>   DW_AT_const_value : 9
 <2><d5b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d5c>   DW_AT_name        : (indirect string, offset: 0xb755e): osPriorityLow2
    <d60>   DW_AT_const_value : 10
 <2><d61>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d62>   DW_AT_name        : (indirect string, offset: 0xb756d): osPriorityLow3
    <d66>   DW_AT_const_value : 11
 <2><d67>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d68>   DW_AT_name        : (indirect string, offset: 0xb757c): osPriorityLow4
    <d6c>   DW_AT_const_value : 12
 <2><d6d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d6e>   DW_AT_name        : (indirect string, offset: 0xb758b): osPriorityLow5
    <d72>   DW_AT_const_value : 13
 <2><d73>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d74>   DW_AT_name        : (indirect string, offset: 0xb759a): osPriorityLow6
    <d78>   DW_AT_const_value : 14
 <2><d79>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d7a>   DW_AT_name        : (indirect string, offset: 0xb75a9): osPriorityLow7
    <d7e>   DW_AT_const_value : 15
 <2><d7f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d80>   DW_AT_name        : (indirect string, offset: 0xb9bd6): osPriorityBelowNormal
    <d84>   DW_AT_const_value : 16
 <2><d85>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d86>   DW_AT_name        : (indirect string, offset: 0x83259): osPriorityBelowNormal1
    <d8a>   DW_AT_const_value : 17
 <2><d8b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d8c>   DW_AT_name        : (indirect string, offset: 0xa3892): osPriorityBelowNormal2
    <d90>   DW_AT_const_value : 18
 <2><d91>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d92>   DW_AT_name        : (indirect string, offset: 0x73d89): osPriorityBelowNormal3
    <d96>   DW_AT_const_value : 19
 <2><d97>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d98>   DW_AT_name        : (indirect string, offset: 0xa38cb): osPriorityBelowNormal4
    <d9c>   DW_AT_const_value : 20
 <2><d9d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d9e>   DW_AT_name        : (indirect string, offset: 0xa38e2): osPriorityBelowNormal5
    <da2>   DW_AT_const_value : 21
 <2><da3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <da4>   DW_AT_name        : (indirect string, offset: 0xa38f9): osPriorityBelowNormal6
    <da8>   DW_AT_const_value : 22
 <2><da9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <daa>   DW_AT_name        : (indirect string, offset: 0xa3910): osPriorityBelowNormal7
    <dae>   DW_AT_const_value : 23
 <2><daf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <db0>   DW_AT_name        : (indirect string, offset: 0x9d38c): osPriorityNormal
    <db4>   DW_AT_const_value : 24
 <2><db5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <db6>   DW_AT_name        : (indirect string, offset: 0x1f6a5): osPriorityNormal1
    <dba>   DW_AT_const_value : 25
 <2><dbb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dbc>   DW_AT_name        : (indirect string, offset: 0x1f6b7): osPriorityNormal2
    <dc0>   DW_AT_const_value : 26
 <2><dc1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dc2>   DW_AT_name        : (indirect string, offset: 0x1f6c9): osPriorityNormal3
    <dc6>   DW_AT_const_value : 27
 <2><dc7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dc8>   DW_AT_name        : (indirect string, offset: 0x1f6db): osPriorityNormal4
    <dcc>   DW_AT_const_value : 28
 <2><dcd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dce>   DW_AT_name        : (indirect string, offset: 0x924ca): osPriorityNormal5
    <dd2>   DW_AT_const_value : 29
 <2><dd3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dd4>   DW_AT_name        : (indirect string, offset: 0x1f70b): osPriorityNormal6
    <dd8>   DW_AT_const_value : 30
 <2><dd9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dda>   DW_AT_name        : (indirect string, offset: 0x1f71d): osPriorityNormal7
    <dde>   DW_AT_const_value : 31
 <2><ddf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <de0>   DW_AT_name        : (indirect string, offset: 0x7b889): osPriorityAboveNormal
    <de4>   DW_AT_const_value : 32
 <2><de5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <de6>   DW_AT_name        : (indirect string, offset: 0xc0cf0): osPriorityAboveNormal1
    <dea>   DW_AT_const_value : 33
 <2><deb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dec>   DW_AT_name        : (indirect string, offset: 0xc0d07): osPriorityAboveNormal2
    <df0>   DW_AT_const_value : 34
 <2><df1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <df2>   DW_AT_name        : (indirect string, offset: 0xc0d1e): osPriorityAboveNormal3
    <df6>   DW_AT_const_value : 35
 <2><df7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <df8>   DW_AT_name        : (indirect string, offset: 0xc0d35): osPriorityAboveNormal4
    <dfc>   DW_AT_const_value : 36
 <2><dfd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dfe>   DW_AT_name        : (indirect string, offset: 0xaafd2): osPriorityAboveNormal5
    <e02>   DW_AT_const_value : 37
 <2><e03>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e04>   DW_AT_name        : (indirect string, offset: 0xc0d62): osPriorityAboveNormal6
    <e08>   DW_AT_const_value : 38
 <2><e09>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e0a>   DW_AT_name        : (indirect string, offset: 0xc0d79): osPriorityAboveNormal7
    <e0e>   DW_AT_const_value : 39
 <2><e0f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e10>   DW_AT_name        : (indirect string, offset: 0x25de6): osPriorityHigh
    <e14>   DW_AT_const_value : 40
 <2><e15>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e16>   DW_AT_name        : (indirect string, offset: 0x7f8cb): osPriorityHigh1
    <e1a>   DW_AT_const_value : 41
 <2><e1b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e1c>   DW_AT_name        : (indirect string, offset: 0x7f8db): osPriorityHigh2
    <e20>   DW_AT_const_value : 42
 <2><e21>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e22>   DW_AT_name        : (indirect string, offset: 0x7f8eb): osPriorityHigh3
    <e26>   DW_AT_const_value : 43
 <2><e27>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e28>   DW_AT_name        : (indirect string, offset: 0x7f8fb): osPriorityHigh4
    <e2c>   DW_AT_const_value : 44
 <2><e2d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e2e>   DW_AT_name        : (indirect string, offset: 0x3a89): osPriorityHigh5
    <e32>   DW_AT_const_value : 45
 <2><e33>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e34>   DW_AT_name        : (indirect string, offset: 0x7f937): osPriorityHigh6
    <e38>   DW_AT_const_value : 46
 <2><e39>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e3a>   DW_AT_name        : (indirect string, offset: 0x7f947): osPriorityHigh7
    <e3e>   DW_AT_const_value : 47
 <2><e3f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e40>   DW_AT_name        : (indirect string, offset: 0xaf444): osPriorityRealtime
    <e44>   DW_AT_const_value : 48
 <2><e45>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e46>   DW_AT_name        : (indirect string, offset: 0x78e7c): osPriorityRealtime1
    <e4a>   DW_AT_const_value : 49
 <2><e4b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e4c>   DW_AT_name        : (indirect string, offset: 0x78e90): osPriorityRealtime2
    <e50>   DW_AT_const_value : 50
 <2><e51>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e52>   DW_AT_name        : (indirect string, offset: 0x78ea4): osPriorityRealtime3
    <e56>   DW_AT_const_value : 51
 <2><e57>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e58>   DW_AT_name        : (indirect string, offset: 0x78eb8): osPriorityRealtime4
    <e5c>   DW_AT_const_value : 52
 <2><e5d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e5e>   DW_AT_name        : (indirect string, offset: 0x78ecc): osPriorityRealtime5
    <e62>   DW_AT_const_value : 53
 <2><e63>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e64>   DW_AT_name        : (indirect string, offset: 0x78ee0): osPriorityRealtime6
    <e68>   DW_AT_const_value : 54
 <2><e69>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e6a>   DW_AT_name        : (indirect string, offset: 0x78ef4): osPriorityRealtime7
    <e6e>   DW_AT_const_value : 55
 <2><e6f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e70>   DW_AT_name        : (indirect string, offset: 0x6ba8e): osPriorityISR
    <e74>   DW_AT_const_value : 56
 <2><e75>: Abbrev Number: 17 (DW_TAG_enumerator)
    <e76>   DW_AT_name        : (indirect string, offset: 0xaac6d): osPriorityError
    <e7a>   DW_AT_const_value : -1
 <2><e7b>: Abbrev Number: 36 (DW_TAG_enumerator)
    <e7c>   DW_AT_name        : (indirect string, offset: 0xb7bbc): osPriorityReserved
    <e80>   DW_AT_const_value : 2147483647
 <2><e80>: Abbrev Number: 0
 <1><e81>: Abbrev Number: 4 (DW_TAG_typedef)
    <e82>   DW_AT_name        : (indirect string, offset: 0x8e12c): osPriority_t
    <e86>   DW_AT_decl_file   : 14
    <e87>   DW_AT_decl_line   : 136
    <e88>   DW_AT_decl_column : 3
    <e89>   DW_AT_type        : <0xd35>
 <1><e8d>: Abbrev Number: 4 (DW_TAG_typedef)
    <e8e>   DW_AT_name        : (indirect string, offset: 0x686c4): osThreadFunc_t
    <e92>   DW_AT_decl_file   : 14
    <e93>   DW_AT_decl_line   : 139
    <e94>   DW_AT_decl_column : 16
    <e95>   DW_AT_type        : <0xd03>
 <1><e99>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <e9a>   DW_AT_encoding    : 5	(signed)
    <e9b>   DW_AT_byte_size   : 4
    <e9c>   DW_AT_type        : <0x86>
    <ea0>   DW_AT_decl_file   : 14
    <ea1>   DW_AT_decl_line   : 176
    <ea2>   DW_AT_decl_column : 14
    <ea3>   DW_AT_sibling     : <0xed7>
 <2><ea7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ea8>   DW_AT_name        : (indirect string, offset: 0x94a2a): osOK
    <eac>   DW_AT_const_value : 0
 <2><ead>: Abbrev Number: 17 (DW_TAG_enumerator)
    <eae>   DW_AT_name        : (indirect string, offset: 0x59221): osError
    <eb2>   DW_AT_const_value : -1
 <2><eb3>: Abbrev Number: 17 (DW_TAG_enumerator)
    <eb4>   DW_AT_name        : (indirect string, offset: 0x1c1bf): osErrorTimeout
    <eb8>   DW_AT_const_value : -2
 <2><eb9>: Abbrev Number: 17 (DW_TAG_enumerator)
    <eba>   DW_AT_name        : (indirect string, offset: 0x7dc23): osErrorResource
    <ebe>   DW_AT_const_value : -3
 <2><ebf>: Abbrev Number: 17 (DW_TAG_enumerator)
    <ec0>   DW_AT_name        : (indirect string, offset: 0x32940): osErrorParameter
    <ec4>   DW_AT_const_value : -4
 <2><ec5>: Abbrev Number: 17 (DW_TAG_enumerator)
    <ec6>   DW_AT_name        : (indirect string, offset: 0x2201f): osErrorNoMemory
    <eca>   DW_AT_const_value : -5
 <2><ecb>: Abbrev Number: 17 (DW_TAG_enumerator)
    <ecc>   DW_AT_name        : (indirect string, offset: 0x346aa): osErrorISR
    <ed0>   DW_AT_const_value : -6
 <2><ed1>: Abbrev Number: 36 (DW_TAG_enumerator)
    <ed2>   DW_AT_name        : (indirect string, offset: 0x6140d): osStatusReserved
    <ed6>   DW_AT_const_value : 2147483647
 <2><ed6>: Abbrev Number: 0
 <1><ed7>: Abbrev Number: 4 (DW_TAG_typedef)
    <ed8>   DW_AT_name        : (indirect string, offset: 0x420b4): osStatus_t
    <edc>   DW_AT_decl_file   : 14
    <edd>   DW_AT_decl_line   : 185
    <ede>   DW_AT_decl_column : 3
    <edf>   DW_AT_type        : <0xe99>
 <1><ee3>: Abbrev Number: 4 (DW_TAG_typedef)
    <ee4>   DW_AT_name        : (indirect string, offset: 0xa0622): osThreadId_t
    <ee8>   DW_AT_decl_file   : 14
    <ee9>   DW_AT_decl_line   : 189
    <eea>   DW_AT_decl_column : 15
    <eeb>   DW_AT_type        : <0x911>
 <1><eef>: Abbrev Number: 4 (DW_TAG_typedef)
    <ef0>   DW_AT_name        : (indirect string, offset: 0x8fcda): TZ_ModuleId_t
    <ef4>   DW_AT_decl_file   : 14
    <ef5>   DW_AT_decl_line   : 213
    <ef6>   DW_AT_decl_column : 18
    <ef7>   DW_AT_type        : <0xb6>
 <1><efb>: Abbrev Number: 14 (DW_TAG_structure_type)
    <efc>   DW_AT_byte_size   : 36
    <efd>   DW_AT_decl_file   : 14
    <efe>   DW_AT_decl_line   : 218
    <eff>   DW_AT_decl_column : 9
    <eff>   DW_AT_sibling     : <0xf79>
 <2><f03>: Abbrev Number: 2 (DW_TAG_member)
    <f04>   DW_AT_name        : (indirect string, offset: 0x1655a): name
    <f08>   DW_AT_decl_file   : 14
    <f09>   DW_AT_decl_line   : 219
    <f0a>   DW_AT_decl_column : 33
    <f0b>   DW_AT_type        : <0xd30>
    <f0f>   DW_AT_data_member_location: 0
 <2><f10>: Abbrev Number: 2 (DW_TAG_member)
    <f11>   DW_AT_name        : (indirect string, offset: 0x7da9a): attr_bits
    <f15>   DW_AT_decl_file   : 14
    <f16>   DW_AT_decl_line   : 220
    <f17>   DW_AT_decl_column : 28
    <f18>   DW_AT_type        : <0xb6>
    <f1c>   DW_AT_data_member_location: 4
 <2><f1d>: Abbrev Number: 2 (DW_TAG_member)
    <f1e>   DW_AT_name        : (indirect string, offset: 0x262df): cb_mem
    <f22>   DW_AT_decl_file   : 14
    <f23>   DW_AT_decl_line   : 221
    <f24>   DW_AT_decl_column : 30
    <f25>   DW_AT_type        : <0x911>
    <f29>   DW_AT_data_member_location: 8
 <2><f2a>: Abbrev Number: 2 (DW_TAG_member)
    <f2b>   DW_AT_name        : (indirect string, offset: 0xb6e6a): cb_size
    <f2f>   DW_AT_decl_file   : 14
    <f30>   DW_AT_decl_line   : 222
    <f31>   DW_AT_decl_column : 30
    <f32>   DW_AT_type        : <0xb6>
    <f36>   DW_AT_data_member_location: 12
 <2><f37>: Abbrev Number: 2 (DW_TAG_member)
    <f38>   DW_AT_name        : (indirect string, offset: 0xafcbd): stack_mem
    <f3c>   DW_AT_decl_file   : 14
    <f3d>   DW_AT_decl_line   : 223
    <f3e>   DW_AT_decl_column : 27
    <f3f>   DW_AT_type        : <0x911>
    <f43>   DW_AT_data_member_location: 16
 <2><f44>: Abbrev Number: 2 (DW_TAG_member)
    <f45>   DW_AT_name        : (indirect string, offset: 0x78f08): stack_size
    <f49>   DW_AT_decl_file   : 14
    <f4a>   DW_AT_decl_line   : 224
    <f4b>   DW_AT_decl_column : 27
    <f4c>   DW_AT_type        : <0xb6>
    <f50>   DW_AT_data_member_location: 20
 <2><f51>: Abbrev Number: 2 (DW_TAG_member)
    <f52>   DW_AT_name        : (indirect string, offset: 0x4c924): priority
    <f56>   DW_AT_decl_file   : 14
    <f57>   DW_AT_decl_line   : 225
    <f58>   DW_AT_decl_column : 29
    <f59>   DW_AT_type        : <0xe81>
    <f5d>   DW_AT_data_member_location: 24
 <2><f5e>: Abbrev Number: 2 (DW_TAG_member)
    <f5f>   DW_AT_name        : (indirect string, offset: 0x5271d): tz_module
    <f63>   DW_AT_decl_file   : 14
    <f64>   DW_AT_decl_line   : 226
    <f65>   DW_AT_decl_column : 28
    <f66>   DW_AT_type        : <0xeef>
    <f6a>   DW_AT_data_member_location: 28
 <2><f6b>: Abbrev Number: 2 (DW_TAG_member)
    <f6c>   DW_AT_name        : (indirect string, offset: 0xad65d): reserved
    <f70>   DW_AT_decl_file   : 14
    <f71>   DW_AT_decl_line   : 227
    <f72>   DW_AT_decl_column : 29
    <f73>   DW_AT_type        : <0xb6>
    <f77>   DW_AT_data_member_location: 32
 <2><f78>: Abbrev Number: 0
 <1><f79>: Abbrev Number: 4 (DW_TAG_typedef)
    <f7a>   DW_AT_name        : (indirect string, offset: 0x1f5b2): osThreadAttr_t
    <f7e>   DW_AT_decl_file   : 14
    <f7f>   DW_AT_decl_line   : 228
    <f80>   DW_AT_decl_column : 3
    <f81>   DW_AT_type        : <0xefb>
 <1><f85>: Abbrev Number: 28 (DW_TAG_const_type)
    <f86>   DW_AT_type        : <0xf79>
 <1><f8a>: Abbrev Number: 20 (DW_TAG_variable)
    <f8b>   DW_AT_name        : (indirect string, offset: 0x67886): huart1
    <f8f>   DW_AT_decl_file   : 1
    <f8f>   DW_AT_decl_line   : 44
    <f90>   DW_AT_decl_column : 20
    <f91>   DW_AT_type        : <0xcf7>
    <f95>   DW_AT_external    : 1
    <f95>   DW_AT_location    : 5 byte block: 3 90 0 0 20 	(DW_OP_addr: 20000090)
 <1><f9b>: Abbrev Number: 20 (DW_TAG_variable)
    <f9c>   DW_AT_name        : (indirect string, offset: 0x4ce32): defaultTaskHandle
    <fa0>   DW_AT_decl_file   : 1
    <fa0>   DW_AT_decl_line   : 47
    <fa1>   DW_AT_decl_column : 14
    <fa2>   DW_AT_type        : <0xee3>
    <fa6>   DW_AT_external    : 1
    <fa6>   DW_AT_location    : 5 byte block: 3 8c 0 0 20 	(DW_OP_addr: 2000008c)
 <1><fac>: Abbrev Number: 20 (DW_TAG_variable)
    <fad>   DW_AT_name        : (indirect string, offset: 0x6783a): defaultTask_attributes
    <fb1>   DW_AT_decl_file   : 1
    <fb1>   DW_AT_decl_line   : 48
    <fb2>   DW_AT_decl_column : 22
    <fb3>   DW_AT_type        : <0xf85>
    <fb7>   DW_AT_external    : 1
    <fb7>   DW_AT_location    : 5 byte block: 3 9c 47 0 8 	(DW_OP_addr: 800479c)
 <1><fbd>: Abbrev Number: 20 (DW_TAG_variable)
    <fbe>   DW_AT_name        : (indirect string, offset: 0x8ccf9): ledTaskHandle
    <fc2>   DW_AT_decl_file   : 1
    <fc2>   DW_AT_decl_line   : 54
    <fc3>   DW_AT_decl_column : 14
    <fc4>   DW_AT_type        : <0xee3>
    <fc8>   DW_AT_external    : 1
    <fc8>   DW_AT_location    : 5 byte block: 3 88 0 0 20 	(DW_OP_addr: 20000088)
 <1><fce>: Abbrev Number: 20 (DW_TAG_variable)
    <fcf>   DW_AT_name        : (indirect string, offset: 0x6f010): ledTask_attributes
    <fd3>   DW_AT_decl_file   : 1
    <fd3>   DW_AT_decl_line   : 55
    <fd4>   DW_AT_decl_column : 22
    <fd5>   DW_AT_type        : <0xf85>
    <fd9>   DW_AT_external    : 1
    <fd9>   DW_AT_location    : 5 byte block: 3 78 47 0 8 	(DW_OP_addr: 8004778)
 <1><fdf>: Abbrev Number: 42 (DW_TAG_subprogram)
    <fe0>   DW_AT_external    : 1
    <fe0>   DW_AT_name        : (indirect string, offset: 0x41d24): HAL_IncTick
    <fe4>   DW_AT_decl_file   : 17
    <fe5>   DW_AT_decl_line   : 232
    <fe6>   DW_AT_decl_column : 6
    <fe7>   DW_AT_prototyped  : 1
    <fe7>   DW_AT_declaration : 1
 <1><fe7>: Abbrev Number: 29 (DW_TAG_subprogram)
    <fe8>   DW_AT_external    : 1
    <fe8>   DW_AT_name        : (indirect string, offset: 0x3b266): HAL_GPIO_TogglePin
    <fec>   DW_AT_decl_file   : 9
    <fec>   DW_AT_decl_line   : 236
    <fed>   DW_AT_decl_column : 6
    <fee>   DW_AT_prototyped  : 1
    <fee>   DW_AT_declaration : 1
    <fee>   DW_AT_sibling     : <0xffd>
 <2><ff2>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <ff3>   DW_AT_type        : <0xffd>
 <2><ff7>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <ff8>   DW_AT_type        : <0xa5>
 <2><ffc>: Abbrev Number: 0
 <1><ffd>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <ffe>   DW_AT_byte_size   : 4
    <ffe>   DW_AT_type        : <0x1d1>
 <1><1002>: Abbrev Number: 43 (DW_TAG_subprogram)
    <1003>   DW_AT_external    : 1
    <1003>   DW_AT_name        : (indirect string, offset: 0x6b46): printf
    <1007>   DW_AT_decl_file   : 15
    <1008>   DW_AT_decl_line   : 206
    <1009>   DW_AT_decl_column : 5
    <100a>   DW_AT_prototyped  : 1
    <100a>   DW_AT_type        : <0x86>
    <100e>   DW_AT_declaration : 1
    <100e>   DW_AT_sibling     : <0x1019>
 <2><1012>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <1013>   DW_AT_type        : <0xd30>
 <2><1017>: Abbrev Number: 44 (DW_TAG_unspecified_parameters)
 <2><1018>: Abbrev Number: 0
 <1><1019>: Abbrev Number: 30 (DW_TAG_subprogram)
    <101a>   DW_AT_external    : 1
    <101a>   DW_AT_name        : (indirect string, offset: 0x6bb38): xTaskGetTickCountFromISR
    <101e>   DW_AT_decl_file   : 16
    <101f>   DW_AT_decl_line   : 1372
    <1021>   DW_AT_decl_column : 12
    <1021>   DW_AT_prototyped  : 1
    <1021>   DW_AT_type        : <0xd13>
    <1025>   DW_AT_declaration : 1
 <1><1025>: Abbrev Number: 18 (DW_TAG_subprogram)
    <1026>   DW_AT_external    : 1
    <1026>   DW_AT_name        : (indirect string, offset: 0xaf118): osDelay
    <102a>   DW_AT_decl_file   : 14
    <102b>   DW_AT_decl_line   : 459
    <102d>   DW_AT_decl_column : 12
    <102e>   DW_AT_prototyped  : 1
    <102e>   DW_AT_type        : <0xed7>
    <1032>   DW_AT_declaration : 1
    <1032>   DW_AT_sibling     : <0x103c>
 <2><1036>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <1037>   DW_AT_type        : <0xb6>
 <2><103b>: Abbrev Number: 0
 <1><103c>: Abbrev Number: 18 (DW_TAG_subprogram)
    <103d>   DW_AT_external    : 1
