Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x1e50 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 43 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x2efdd): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -Og -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0xabf96): ../Core/Src/main.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x2ac38): /home/lth/src/stm32fun/stm32world_freertos/Debug
    <1a>   DW_AT_ranges      : 0x27
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 16 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 4	(float)
    <2d>   DW_AT_name        : (indirect string, offset: 0xa58bd): float
 <1><31>: Abbrev Number: 16 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 1
    <33>   DW_AT_encoding    : 6	(signed char)
    <34>   DW_AT_name        : (indirect string, offset: 0x60b53): signed char
 <1><38>: Abbrev Number: 6 (DW_TAG_typedef)
    <39>   DW_AT_name        : (indirect string, offset: 0x3872e): __uint8_t
    <3d>   DW_AT_decl_file   : 3
    <3e>   DW_AT_decl_line   : 43
    <3f>   DW_AT_decl_column : 24
    <40>   DW_AT_type        : <0x44>
 <1><44>: Abbrev Number: 16 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 1
    <46>   DW_AT_encoding    : 8	(unsigned char)
    <47>   DW_AT_name        : (indirect string, offset: 0xbaa9a): unsigned char
 <1><4b>: Abbrev Number: 16 (DW_TAG_base_type)
    <4c>   DW_AT_byte_size   : 2
    <4d>   DW_AT_encoding    : 5	(signed)
    <4e>   DW_AT_name        : (indirect string, offset: 0x8fb2b): short int
 <1><52>: Abbrev Number: 6 (DW_TAG_typedef)
    <53>   DW_AT_name        : (indirect string, offset: 0x9d925): __uint16_t
    <57>   DW_AT_decl_file   : 3
    <58>   DW_AT_decl_line   : 57
    <59>   DW_AT_decl_column : 25
    <5a>   DW_AT_type        : <0x5e>
 <1><5e>: Abbrev Number: 16 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 2
    <60>   DW_AT_encoding    : 7	(unsigned)
    <61>   DW_AT_name        : (indirect string, offset: 0xb9373): short unsigned int
 <1><65>: Abbrev Number: 16 (DW_TAG_base_type)
    <66>   DW_AT_byte_size   : 4
    <67>   DW_AT_encoding    : 5	(signed)
    <68>   DW_AT_name        : (indirect string, offset: 0x10054): long int
 <1><6c>: Abbrev Number: 6 (DW_TAG_typedef)
    <6d>   DW_AT_name        : (indirect string, offset: 0x7aa86): __uint32_t
    <71>   DW_AT_decl_file   : 3
    <72>   DW_AT_decl_line   : 79
    <73>   DW_AT_decl_column : 25
    <74>   DW_AT_type        : <0x78>
 <1><78>: Abbrev Number: 16 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 4
    <7a>   DW_AT_encoding    : 7	(unsigned)
    <7b>   DW_AT_name        : (indirect string, offset: 0x4a2d3): long unsigned int
 <1><7f>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <80>   DW_AT_type        : <0x78>
 <1><84>: Abbrev Number: 16 (DW_TAG_base_type)
    <85>   DW_AT_byte_size   : 8
    <86>   DW_AT_encoding    : 5	(signed)
    <87>   DW_AT_name        : (indirect string, offset: 0x581ba): long long int
 <1><8b>: Abbrev Number: 16 (DW_TAG_base_type)
    <8c>   DW_AT_byte_size   : 8
    <8d>   DW_AT_encoding    : 7	(unsigned)
    <8e>   DW_AT_name        : (indirect string, offset: 0x28dc0): long long unsigned int
 <1><92>: Abbrev Number: 44 (DW_TAG_base_type)
    <93>   DW_AT_byte_size   : 4
    <94>   DW_AT_encoding    : 5	(signed)
    <95>   DW_AT_name        : int
 <1><99>: Abbrev Number: 16 (DW_TAG_base_type)
    <9a>   DW_AT_byte_size   : 4
    <9b>   DW_AT_encoding    : 7	(unsigned)
    <9c>   DW_AT_name        : (indirect string, offset: 0xf75b): unsigned int
 <1><a0>: Abbrev Number: 6 (DW_TAG_typedef)
    <a1>   DW_AT_name        : (indirect string, offset: 0x38730): uint8_t
    <a5>   DW_AT_decl_file   : 4
    <a6>   DW_AT_decl_line   : 24
    <a7>   DW_AT_decl_column : 19
    <a8>   DW_AT_type        : <0x38>
 <1><ac>: Abbrev Number: 18 (DW_TAG_const_type)
    <ad>   DW_AT_type        : <0xa0>
 <1><b1>: Abbrev Number: 6 (DW_TAG_typedef)
    <b2>   DW_AT_name        : (indirect string, offset: 0x8c80b): uint16_t
    <b6>   DW_AT_decl_file   : 4
    <b7>   DW_AT_decl_line   : 36
    <b8>   DW_AT_decl_column : 20
    <b9>   DW_AT_type        : <0x52>
 <1><bd>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <be>   DW_AT_type        : <0xb1>
 <1><c2>: Abbrev Number: 6 (DW_TAG_typedef)
    <c3>   DW_AT_name        : (indirect string, offset: 0xa238e): uint32_t
    <c7>   DW_AT_decl_file   : 4
    <c8>   DW_AT_decl_line   : 48
    <c9>   DW_AT_decl_column : 20
    <ca>   DW_AT_type        : <0x6c>
 <1><ce>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <cf>   DW_AT_type        : <0xc2>
 <1><d3>: Abbrev Number: 24 (DW_TAG_array_type)
    <d4>   DW_AT_type        : <0xc2>
    <d8>   DW_AT_sibling     : <0xe3>
 <2><dc>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <dd>   DW_AT_type        : <0x99>
    <e1>   DW_AT_upper_bound : 1
 <2><e2>: Abbrev Number: 0
 <1><e3>: Abbrev Number: 19 (DW_TAG_structure_type)
    <e4>   DW_AT_byte_size   : 24
    <e5>   DW_AT_decl_file   : 5
    <e6>   DW_AT_decl_line   : 324
    <e8>   DW_AT_decl_column : 9
    <e8>   DW_AT_sibling     : <0x13a>
 <2><ec>: Abbrev Number: 8 (DW_TAG_member)
    <ed>   DW_AT_name        : CR
    <f0>   DW_AT_decl_file   : 5
    <f0>   DW_AT_decl_line   : 326
    <f2>   DW_AT_decl_column : 17
    <f2>   DW_AT_type        : <0xce>
    <f6>   DW_AT_data_member_location: 0
 <2><f7>: Abbrev Number: 3 (DW_TAG_member)
    <f8>   DW_AT_name        : (indirect string, offset: 0x169fe): NDTR
    <fc>   DW_AT_decl_file   : 5
    <fd>   DW_AT_decl_line   : 327
    <ff>   DW_AT_decl_column : 17
    <100>   DW_AT_type        : <0xce>
    <104>   DW_AT_data_member_location: 4
 <2><105>: Abbrev Number: 8 (DW_TAG_member)
    <106>   DW_AT_name        : PAR
    <10a>   DW_AT_decl_file   : 5
    <10a>   DW_AT_decl_line   : 328
    <10c>   DW_AT_decl_column : 17
    <10c>   DW_AT_type        : <0xce>
    <110>   DW_AT_data_member_location: 8
 <2><111>: Abbrev Number: 3 (DW_TAG_member)
    <112>   DW_AT_name        : (indirect string, offset: 0x50655): M0AR
    <116>   DW_AT_decl_file   : 5
    <117>   DW_AT_decl_line   : 329
    <119>   DW_AT_decl_column : 17
    <11a>   DW_AT_type        : <0xce>
    <11e>   DW_AT_data_member_location: 12
 <2><11f>: Abbrev Number: 3 (DW_TAG_member)
    <120>   DW_AT_name        : (indirect string, offset: 0x6aab0): M1AR
    <124>   DW_AT_decl_file   : 5
    <125>   DW_AT_decl_line   : 330
    <127>   DW_AT_decl_column : 17
    <128>   DW_AT_type        : <0xce>
    <12c>   DW_AT_data_member_location: 16
 <2><12d>: Abbrev Number: 8 (DW_TAG_member)
    <12e>   DW_AT_name        : FCR
    <132>   DW_AT_decl_file   : 5
    <132>   DW_AT_decl_line   : 331
    <134>   DW_AT_decl_column : 17
    <134>   DW_AT_type        : <0xce>
    <138>   DW_AT_data_member_location: 20
 <2><139>: Abbrev Number: 0
 <1><13a>: Abbrev Number: 14 (DW_TAG_typedef)
    <13b>   DW_AT_name        : (indirect string, offset: 0xaf756): DMA_Stream_TypeDef
    <13f>   DW_AT_decl_file   : 5
    <140>   DW_AT_decl_line   : 332
    <142>   DW_AT_decl_column : 3
    <142>   DW_AT_type        : <0xe3>
 <1><146>: Abbrev Number: 19 (DW_TAG_structure_type)
    <147>   DW_AT_byte_size   : 40
    <148>   DW_AT_decl_file   : 5
    <149>   DW_AT_decl_line   : 430
    <14b>   DW_AT_decl_column : 9
    <14b>   DW_AT_sibling     : <0x1c8>
 <2><14f>: Abbrev Number: 3 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0x7d399): MODER
    <154>   DW_AT_decl_file   : 5
    <155>   DW_AT_decl_line   : 432
    <157>   DW_AT_decl_column : 17
    <158>   DW_AT_type        : <0xce>
    <15c>   DW_AT_data_member_location: 0
 <2><15d>: Abbrev Number: 3 (DW_TAG_member)
    <15e>   DW_AT_name        : (indirect string, offset: 0x9565f): OTYPER
    <162>   DW_AT_decl_file   : 5
    <163>   DW_AT_decl_line   : 433
    <165>   DW_AT_decl_column : 17
    <166>   DW_AT_type        : <0xce>
    <16a>   DW_AT_data_member_location: 4
 <2><16b>: Abbrev Number: 3 (DW_TAG_member)
    <16c>   DW_AT_name        : (indirect string, offset: 0xa7daf): OSPEEDR
    <170>   DW_AT_decl_file   : 5
    <171>   DW_AT_decl_line   : 434
    <173>   DW_AT_decl_column : 17
    <174>   DW_AT_type        : <0xce>
    <178>   DW_AT_data_member_location: 8
 <2><179>: Abbrev Number: 3 (DW_TAG_member)
    <17a>   DW_AT_name        : (indirect string, offset: 0x6f8a0): PUPDR
    <17e>   DW_AT_decl_file   : 5
    <17f>   DW_AT_decl_line   : 435
    <181>   DW_AT_decl_column : 17
    <182>   DW_AT_type        : <0xce>
    <186>   DW_AT_data_member_location: 12
 <2><187>: Abbrev Number: 8 (DW_TAG_member)
    <188>   DW_AT_name        : IDR
    <18c>   DW_AT_decl_file   : 5
    <18c>   DW_AT_decl_line   : 436
    <18e>   DW_AT_decl_column : 17
    <18e>   DW_AT_type        : <0xce>
    <192>   DW_AT_data_member_location: 16
 <2><193>: Abbrev Number: 8 (DW_TAG_member)
    <194>   DW_AT_name        : ODR
    <198>   DW_AT_decl_file   : 5
    <198>   DW_AT_decl_line   : 437
    <19a>   DW_AT_decl_column : 17
    <19a>   DW_AT_type        : <0xce>
    <19e>   DW_AT_data_member_location: 20
 <2><19f>: Abbrev Number: 3 (DW_TAG_member)
    <1a0>   DW_AT_name        : (indirect string, offset: 0x2bfcc): BSRR
    <1a4>   DW_AT_decl_file   : 5
    <1a5>   DW_AT_decl_line   : 438
    <1a7>   DW_AT_decl_column : 17
    <1a8>   DW_AT_type        : <0xce>
    <1ac>   DW_AT_data_member_location: 24
 <2><1ad>: Abbrev Number: 3 (DW_TAG_member)
    <1ae>   DW_AT_name        : (indirect string, offset: 0xa55d8): LCKR
    <1b2>   DW_AT_decl_file   : 5
    <1b3>   DW_AT_decl_line   : 439
    <1b5>   DW_AT_decl_column : 17
    <1b6>   DW_AT_type        : <0xce>
    <1ba>   DW_AT_data_member_location: 28
 <2><1bb>: Abbrev Number: 8 (DW_TAG_member)
    <1bc>   DW_AT_name        : AFR
    <1c0>   DW_AT_decl_file   : 5
    <1c0>   DW_AT_decl_line   : 440
    <1c2>   DW_AT_decl_column : 17
    <1c2>   DW_AT_type        : <0x1d8>
    <1c6>   DW_AT_data_member_location: 32
 <2><1c7>: Abbrev Number: 0
 <1><1c8>: Abbrev Number: 24 (DW_TAG_array_type)
    <1c9>   DW_AT_type        : <0xce>
    <1cd>   DW_AT_sibling     : <0x1d8>
 <2><1d1>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <1d2>   DW_AT_type        : <0x99>
    <1d6>   DW_AT_upper_bound : 1
 <2><1d7>: Abbrev Number: 0
 <1><1d8>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <1d9>   DW_AT_type        : <0x1c8>
 <1><1dd>: Abbrev Number: 14 (DW_TAG_typedef)
    <1de>   DW_AT_name        : (indirect string, offset: 0xbbadf): GPIO_TypeDef
    <1e2>   DW_AT_decl_file   : 5
    <1e3>   DW_AT_decl_line   : 441
    <1e5>   DW_AT_decl_column : 3
    <1e5>   DW_AT_type        : <0x146>
 <1><1e9>: Abbrev Number: 19 (DW_TAG_structure_type)
    <1ea>   DW_AT_byte_size   : 8
    <1eb>   DW_AT_decl_file   : 5
    <1ec>   DW_AT_decl_line   : 490
    <1ee>   DW_AT_decl_column : 9
    <1ee>   DW_AT_sibling     : <0x20a>
 <2><1f2>: Abbrev Number: 8 (DW_TAG_member)
    <1f3>   DW_AT_name        : CR
    <1f6>   DW_AT_decl_file   : 5
    <1f6>   DW_AT_decl_line   : 492
    <1f8>   DW_AT_decl_column : 17
    <1f8>   DW_AT_type        : <0xce>
    <1fc>   DW_AT_data_member_location: 0
 <2><1fd>: Abbrev Number: 8 (DW_TAG_member)
    <1fe>   DW_AT_name        : CSR
    <202>   DW_AT_decl_file   : 5
    <202>   DW_AT_decl_line   : 493
    <204>   DW_AT_decl_column : 17
    <204>   DW_AT_type        : <0xce>
    <208>   DW_AT_data_member_location: 4
 <2><209>: Abbrev Number: 0
 <1><20a>: Abbrev Number: 14 (DW_TAG_typedef)
    <20b>   DW_AT_name        : (indirect string, offset: 0x8b36f): PWR_TypeDef
    <20f>   DW_AT_decl_file   : 5
    <210>   DW_AT_decl_line   : 494
    <212>   DW_AT_decl_column : 3
    <212>   DW_AT_type        : <0x1e9>
 <1><216>: Abbrev Number: 19 (DW_TAG_structure_type)
    <217>   DW_AT_byte_size   : 136
    <218>   DW_AT_decl_file   : 5
    <219>   DW_AT_decl_line   : 500
    <21b>   DW_AT_decl_column : 9
    <21b>   DW_AT_sibling     : <0x3bd>
 <2><21f>: Abbrev Number: 8 (DW_TAG_member)
    <220>   DW_AT_name        : CR
    <223>   DW_AT_decl_file   : 5
    <223>   DW_AT_decl_line   : 502
    <225>   DW_AT_decl_column : 17
    <225>   DW_AT_type        : <0xce>
    <229>   DW_AT_data_member_location: 0
 <2><22a>: Abbrev Number: 3 (DW_TAG_member)
    <22b>   DW_AT_name        : (indirect string, offset: 0x86cd5): PLLCFGR
    <22f>   DW_AT_decl_file   : 5
    <230>   DW_AT_decl_line   : 503
    <232>   DW_AT_decl_column : 17
    <233>   DW_AT_type        : <0xce>
    <237>   DW_AT_data_member_location: 4
 <2><238>: Abbrev Number: 3 (DW_TAG_member)
    <239>   DW_AT_name        : (indirect string, offset: 0x86cd8): CFGR
    <23d>   DW_AT_decl_file   : 5
    <23e>   DW_AT_decl_line   : 504
    <240>   DW_AT_decl_column : 17
    <241>   DW_AT_type        : <0xce>
    <245>   DW_AT_data_member_location: 8
 <2><246>: Abbrev Number: 8 (DW_TAG_member)
    <247>   DW_AT_name        : CIR
    <24b>   DW_AT_decl_file   : 5
    <24b>   DW_AT_decl_line   : 505
    <24d>   DW_AT_decl_column : 17
    <24d>   DW_AT_type        : <0xce>
    <251>   DW_AT_data_member_location: 12
 <2><252>: Abbrev Number: 3 (DW_TAG_member)
    <253>   DW_AT_name        : (indirect string, offset: 0x99a49): AHB1RSTR
    <257>   DW_AT_decl_file   : 5
    <258>   DW_AT_decl_line   : 506
    <25a>   DW_AT_decl_column : 17
    <25b>   DW_AT_type        : <0xce>
    <25f>   DW_AT_data_member_location: 16
 <2><260>: Abbrev Number: 3 (DW_TAG_member)
    <261>   DW_AT_name        : (indirect string, offset: 0x16157): AHB2RSTR
    <265>   DW_AT_decl_file   : 5
    <266>   DW_AT_decl_line   : 507
    <268>   DW_AT_decl_column : 17
    <269>   DW_AT_type        : <0xce>
    <26d>   DW_AT_data_member_location: 20
 <2><26e>: Abbrev Number: 3 (DW_TAG_member)
    <26f>   DW_AT_name        : (indirect string, offset: 0x3fe17): AHB3RSTR
    <273>   DW_AT_decl_file   : 5
    <274>   DW_AT_decl_line   : 508
    <276>   DW_AT_decl_column : 17
    <277>   DW_AT_type        : <0xce>
    <27b>   DW_AT_data_member_location: 24
 <2><27c>: Abbrev Number: 3 (DW_TAG_member)
    <27d>   DW_AT_name        : (indirect string, offset: 0xb655c): RESERVED0
    <281>   DW_AT_decl_file   : 5
    <282>   DW_AT_decl_line   : 509
    <284>   DW_AT_decl_column : 17
    <285>   DW_AT_type        : <0xc2>
    <289>   DW_AT_data_member_location: 28
 <2><28a>: Abbrev Number: 3 (DW_TAG_member)
    <28b>   DW_AT_name        : (indirect string, offset: 0x15c08): APB1RSTR
    <28f>   DW_AT_decl_file   : 5
    <290>   DW_AT_decl_line   : 510
    <292>   DW_AT_decl_column : 17
    <293>   DW_AT_type        : <0xce>
    <297>   DW_AT_data_member_location: 32
 <2><298>: Abbrev Number: 3 (DW_TAG_member)
    <299>   DW_AT_name        : (indirect string, offset: 0x53dee): APB2RSTR
    <29d>   DW_AT_decl_file   : 5
    <29e>   DW_AT_decl_line   : 511
    <2a0>   DW_AT_decl_column : 17
    <2a1>   DW_AT_type        : <0xce>
    <2a5>   DW_AT_data_member_location: 36
 <2><2a6>: Abbrev Number: 3 (DW_TAG_member)
    <2a7>   DW_AT_name        : (indirect string, offset: 0xb6566): RESERVED1
    <2ab>   DW_AT_decl_file   : 5
    <2ac>   DW_AT_decl_line   : 512
    <2ae>   DW_AT_decl_column : 17
    <2af>   DW_AT_type        : <0xd3>
    <2b3>   DW_AT_data_member_location: 40
 <2><2b4>: Abbrev Number: 3 (DW_TAG_member)
    <2b5>   DW_AT_name        : (indirect string, offset: 0xf6f0): AHB1ENR
    <2b9>   DW_AT_decl_file   : 5
    <2ba>   DW_AT_decl_line   : 513
    <2bc>   DW_AT_decl_column : 17
    <2bd>   DW_AT_type        : <0xce>
    <2c1>   DW_AT_data_member_location: 48
 <2><2c2>: Abbrev Number: 3 (DW_TAG_member)
    <2c3>   DW_AT_name        : (indirect string, offset: 0x33be2): AHB2ENR
    <2c7>   DW_AT_decl_file   : 5
    <2c8>   DW_AT_decl_line   : 514
    <2ca>   DW_AT_decl_column : 17
    <2cb>   DW_AT_type        : <0xce>
    <2cf>   DW_AT_data_member_location: 52
 <2><2d0>: Abbrev Number: 3 (DW_TAG_member)
    <2d1>   DW_AT_name        : (indirect string, offset: 0x56aec): AHB3ENR
    <2d5>   DW_AT_decl_file   : 5
    <2d6>   DW_AT_decl_line   : 515
    <2d8>   DW_AT_decl_column : 17
    <2d9>   DW_AT_type        : <0xce>
    <2dd>   DW_AT_data_member_location: 56
 <2><2de>: Abbrev Number: 3 (DW_TAG_member)
    <2df>   DW_AT_name        : (indirect string, offset: 0xb6570): RESERVED2
    <2e3>   DW_AT_decl_file   : 5
    <2e4>   DW_AT_decl_line   : 516
    <2e6>   DW_AT_decl_column : 17
    <2e7>   DW_AT_type        : <0xc2>
    <2eb>   DW_AT_data_member_location: 60
 <2><2ec>: Abbrev Number: 3 (DW_TAG_member)
    <2ed>   DW_AT_name        : (indirect string, offset: 0x6ea07): APB1ENR
    <2f1>   DW_AT_decl_file   : 5
    <2f2>   DW_AT_decl_line   : 517
    <2f4>   DW_AT_decl_column : 17
    <2f5>   DW_AT_type        : <0xce>
    <2f9>   DW_AT_data_member_location: 64
 <2><2fa>: Abbrev Number: 3 (DW_TAG_member)
    <2fb>   DW_AT_name        : (indirect string, offset: 0x5d3b7): APB2ENR
    <2ff>   DW_AT_decl_file   : 5
    <300>   DW_AT_decl_line   : 518
    <302>   DW_AT_decl_column : 17
    <303>   DW_AT_type        : <0xce>
    <307>   DW_AT_data_member_location: 68
 <2><308>: Abbrev Number: 3 (DW_TAG_member)
    <309>   DW_AT_name        : (indirect string, offset: 0xb657a): RESERVED3
    <30d>   DW_AT_decl_file   : 5
    <30e>   DW_AT_decl_line   : 519
    <310>   DW_AT_decl_column : 17
    <311>   DW_AT_type        : <0xd3>
    <315>   DW_AT_data_member_location: 72
 <2><316>: Abbrev Number: 3 (DW_TAG_member)
    <317>   DW_AT_name        : (indirect string, offset: 0x9d7aa): AHB1LPENR
    <31b>   DW_AT_decl_file   : 5
    <31c>   DW_AT_decl_line   : 520
    <31e>   DW_AT_decl_column : 17
    <31f>   DW_AT_type        : <0xce>
    <323>   DW_AT_data_member_location: 80
 <2><324>: Abbrev Number: 3 (DW_TAG_member)
    <325>   DW_AT_name        : (indirect string, offset: 0x2bc3f): AHB2LPENR
    <329>   DW_AT_decl_file   : 5
    <32a>   DW_AT_decl_line   : 521
    <32c>   DW_AT_decl_column : 17
    <32d>   DW_AT_type        : <0xce>
    <331>   DW_AT_data_member_location: 84
 <2><332>: Abbrev Number: 3 (DW_TAG_member)
    <333>   DW_AT_name        : (indirect string, offset: 0x822a3): AHB3LPENR
    <337>   DW_AT_decl_file   : 5
    <338>   DW_AT_decl_line   : 522
    <33a>   DW_AT_decl_column : 17
    <33b>   DW_AT_type        : <0xce>
    <33f>   DW_AT_data_member_location: 88
 <2><340>: Abbrev Number: 3 (DW_TAG_member)
    <341>   DW_AT_name        : (indirect string, offset: 0xb6584): RESERVED4
    <345>   DW_AT_decl_file   : 5
    <346>   DW_AT_decl_line   : 523
    <348>   DW_AT_decl_column : 17
    <349>   DW_AT_type        : <0xc2>
    <34d>   DW_AT_data_member_location: 92
 <2><34e>: Abbrev Number: 3 (DW_TAG_member)
    <34f>   DW_AT_name        : (indirect string, offset: 0xa2067): APB1LPENR
    <353>   DW_AT_decl_file   : 5
    <354>   DW_AT_decl_line   : 524
    <356>   DW_AT_decl_column : 17
    <357>   DW_AT_type        : <0xce>
    <35b>   DW_AT_data_member_location: 96
 <2><35c>: Abbrev Number: 3 (DW_TAG_member)
    <35d>   DW_AT_name        : (indirect string, offset: 0x31903): APB2LPENR
    <361>   DW_AT_decl_file   : 5
    <362>   DW_AT_decl_line   : 525
    <364>   DW_AT_decl_column : 17
    <365>   DW_AT_type        : <0xce>
    <369>   DW_AT_data_member_location: 100
 <2><36a>: Abbrev Number: 3 (DW_TAG_member)
    <36b>   DW_AT_name        : (indirect string, offset: 0xb658e): RESERVED5
    <36f>   DW_AT_decl_file   : 5
    <370>   DW_AT_decl_line   : 526
    <372>   DW_AT_decl_column : 17
    <373>   DW_AT_type        : <0xd3>
    <377>   DW_AT_data_member_location: 104
 <2><378>: Abbrev Number: 3 (DW_TAG_member)
    <379>   DW_AT_name        : (indirect string, offset: 0x1b49b): BDCR
    <37d>   DW_AT_decl_file   : 5
    <37e>   DW_AT_decl_line   : 527
    <380>   DW_AT_decl_column : 17
    <381>   DW_AT_type        : <0xce>
    <385>   DW_AT_data_member_location: 112
 <2><386>: Abbrev Number: 8 (DW_TAG_member)
    <387>   DW_AT_name        : CSR
    <38b>   DW_AT_decl_file   : 5
    <38b>   DW_AT_decl_line   : 528
    <38d>   DW_AT_decl_column : 17
    <38d>   DW_AT_type        : <0xce>
    <391>   DW_AT_data_member_location: 116
 <2><392>: Abbrev Number: 3 (DW_TAG_member)
    <393>   DW_AT_name        : (indirect string, offset: 0x72eca): RESERVED6
    <397>   DW_AT_decl_file   : 5
    <398>   DW_AT_decl_line   : 529
    <39a>   DW_AT_decl_column : 17
    <39b>   DW_AT_type        : <0xd3>
    <39f>   DW_AT_data_member_location: 120
 <2><3a0>: Abbrev Number: 3 (DW_TAG_member)
    <3a1>   DW_AT_name        : (indirect string, offset: 0x661a9): SSCGR
    <3a5>   DW_AT_decl_file   : 5
    <3a6>   DW_AT_decl_line   : 530
    <3a8>   DW_AT_decl_column : 17
    <3a9>   DW_AT_type        : <0xce>
    <3ad>   DW_AT_data_member_location: 128
 <2><3ae>: Abbrev Number: 3 (DW_TAG_member)
    <3af>   DW_AT_name        : (indirect string, offset: 0x40828): PLLI2SCFGR
    <3b3>   DW_AT_decl_file   : 5
    <3b4>   DW_AT_decl_line   : 531
    <3b6>   DW_AT_decl_column : 17
    <3b7>   DW_AT_type        : <0xce>
    <3bb>   DW_AT_data_member_location: 132
 <2><3bc>: Abbrev Number: 0
 <1><3bd>: Abbrev Number: 14 (DW_TAG_typedef)
    <3be>   DW_AT_name        : (indirect string, offset: 0x59601): RCC_TypeDef
    <3c2>   DW_AT_decl_file   : 5
    <3c3>   DW_AT_decl_line   : 532
    <3c5>   DW_AT_decl_column : 3
    <3c5>   DW_AT_type        : <0x216>
 <1><3c9>: Abbrev Number: 19 (DW_TAG_structure_type)
    <3ca>   DW_AT_byte_size   : 84
    <3cb>   DW_AT_decl_file   : 5
    <3cc>   DW_AT_decl_line   : 632
    <3ce>   DW_AT_decl_column : 9
    <3ce>   DW_AT_sibling     : <0x4e3>
 <2><3d2>: Abbrev Number: 8 (DW_TAG_member)
    <3d3>   DW_AT_name        : CR1
    <3d7>   DW_AT_decl_file   : 5
    <3d7>   DW_AT_decl_line   : 634
    <3d9>   DW_AT_decl_column : 17
    <3d9>   DW_AT_type        : <0xce>
    <3dd>   DW_AT_data_member_location: 0
 <2><3de>: Abbrev Number: 8 (DW_TAG_member)
    <3df>   DW_AT_name        : CR2
    <3e3>   DW_AT_decl_file   : 5
    <3e3>   DW_AT_decl_line   : 635
    <3e5>   DW_AT_decl_column : 17
    <3e5>   DW_AT_type        : <0xce>
    <3e9>   DW_AT_data_member_location: 4
 <2><3ea>: Abbrev Number: 3 (DW_TAG_member)
    <3eb>   DW_AT_name        : (indirect string, offset: 0x39060): SMCR
    <3ef>   DW_AT_decl_file   : 5
    <3f0>   DW_AT_decl_line   : 636
    <3f2>   DW_AT_decl_column : 17
    <3f3>   DW_AT_type        : <0xce>
    <3f7>   DW_AT_data_member_location: 8
 <2><3f8>: Abbrev Number: 3 (DW_TAG_member)
    <3f9>   DW_AT_name        : (indirect string, offset: 0x3edfc): DIER
    <3fd>   DW_AT_decl_file   : 5
    <3fe>   DW_AT_decl_line   : 637
    <400>   DW_AT_decl_column : 17
    <401>   DW_AT_type        : <0xce>
    <405>   DW_AT_data_member_location: 12
 <2><406>: Abbrev Number: 8 (DW_TAG_member)
    <407>   DW_AT_name        : SR
    <40a>   DW_AT_decl_file   : 5
    <40a>   DW_AT_decl_line   : 638
    <40c>   DW_AT_decl_column : 17
    <40c>   DW_AT_type        : <0xce>
    <410>   DW_AT_data_member_location: 16
 <2><411>: Abbrev Number: 8 (DW_TAG_member)
    <412>   DW_AT_name        : EGR
    <416>   DW_AT_decl_file   : 5
    <416>   DW_AT_decl_line   : 639
    <418>   DW_AT_decl_column : 17
    <418>   DW_AT_type        : <0xce>
    <41c>   DW_AT_data_member_location: 20
 <2><41d>: Abbrev Number: 3 (DW_TAG_member)
    <41e>   DW_AT_name        : (indirect string, offset: 0xb0579): CCMR1
    <422>   DW_AT_decl_file   : 5
    <423>   DW_AT_decl_line   : 640
    <425>   DW_AT_decl_column : 17
    <426>   DW_AT_type        : <0xce>
    <42a>   DW_AT_data_member_location: 24
 <2><42b>: Abbrev Number: 3 (DW_TAG_member)
    <42c>   DW_AT_name        : (indirect string, offset: 0x4d515): CCMR2
    <430>   DW_AT_decl_file   : 5
    <431>   DW_AT_decl_line   : 641
    <433>   DW_AT_decl_column : 17
    <434>   DW_AT_type        : <0xce>
    <438>   DW_AT_data_member_location: 28
 <2><439>: Abbrev Number: 3 (DW_TAG_member)
    <43a>   DW_AT_name        : (indirect string, offset: 0x2f9aa): CCER
    <43e>   DW_AT_decl_file   : 5
    <43f>   DW_AT_decl_line   : 642
    <441>   DW_AT_decl_column : 17
    <442>   DW_AT_type        : <0xce>
    <446>   DW_AT_data_member_location: 32
 <2><447>: Abbrev Number: 8 (DW_TAG_member)
    <448>   DW_AT_name        : CNT
    <44c>   DW_AT_decl_file   : 5
    <44c>   DW_AT_decl_line   : 643
    <44e>   DW_AT_decl_column : 17
    <44e>   DW_AT_type        : <0xce>
    <452>   DW_AT_data_member_location: 36
 <2><453>: Abbrev Number: 8 (DW_TAG_member)
    <454>   DW_AT_name        : PSC
    <458>   DW_AT_decl_file   : 5
    <458>   DW_AT_decl_line   : 644
    <45a>   DW_AT_decl_column : 17
    <45a>   DW_AT_type        : <0xce>
    <45e>   DW_AT_data_member_location: 40
 <2><45f>: Abbrev Number: 8 (DW_TAG_member)
    <460>   DW_AT_name        : ARR
    <464>   DW_AT_decl_file   : 5
    <464>   DW_AT_decl_line   : 645
    <466>   DW_AT_decl_column : 17
    <466>   DW_AT_type        : <0xce>
    <46a>   DW_AT_data_member_location: 44
 <2><46b>: Abbrev Number: 8 (DW_TAG_member)
    <46c>   DW_AT_name        : RCR
    <470>   DW_AT_decl_file   : 5
    <470>   DW_AT_decl_line   : 646
    <472>   DW_AT_decl_column : 17
    <472>   DW_AT_type        : <0xce>
    <476>   DW_AT_data_member_location: 48
 <2><477>: Abbrev Number: 3 (DW_TAG_member)
    <478>   DW_AT_name        : (indirect string, offset: 0x1720c): CCR1
    <47c>   DW_AT_decl_file   : 5
    <47d>   DW_AT_decl_line   : 647
    <47f>   DW_AT_decl_column : 17
    <480>   DW_AT_type        : <0xce>
    <484>   DW_AT_data_member_location: 52
 <2><485>: Abbrev Number: 3 (DW_TAG_member)
    <486>   DW_AT_name        : (indirect string, offset: 0x511da): CCR2
    <48a>   DW_AT_decl_file   : 5
    <48b>   DW_AT_decl_line   : 648
    <48d>   DW_AT_decl_column : 17
    <48e>   DW_AT_type        : <0xce>
    <492>   DW_AT_data_member_location: 56
 <2><493>: Abbrev Number: 3 (DW_TAG_member)
    <494>   DW_AT_name        : (indirect string, offset: 0x93733): CCR3
    <498>   DW_AT_decl_file   : 5
    <499>   DW_AT_decl_line   : 649
    <49b>   DW_AT_decl_column : 17
    <49c>   DW_AT_type        : <0xce>
    <4a0>   DW_AT_data_member_location: 60
 <2><4a1>: Abbrev Number: 3 (DW_TAG_member)
    <4a2>   DW_AT_name        : (indirect string, offset: 0xbf11): CCR4
    <4a6>   DW_AT_decl_file   : 5
    <4a7>   DW_AT_decl_line   : 650
    <4a9>   DW_AT_decl_column : 17
    <4aa>   DW_AT_type        : <0xce>
    <4ae>   DW_AT_data_member_location: 64
 <2><4af>: Abbrev Number: 3 (DW_TAG_member)
    <4b0>   DW_AT_name        : (indirect string, offset: 0x83553): BDTR
    <4b4>   DW_AT_decl_file   : 5
    <4b5>   DW_AT_decl_line   : 651
    <4b7>   DW_AT_decl_column : 17
    <4b8>   DW_AT_type        : <0xce>
    <4bc>   DW_AT_data_member_location: 68
 <2><4bd>: Abbrev Number: 8 (DW_TAG_member)
    <4be>   DW_AT_name        : DCR
    <4c2>   DW_AT_decl_file   : 5
    <4c2>   DW_AT_decl_line   : 652
    <4c4>   DW_AT_decl_column : 17
    <4c4>   DW_AT_type        : <0xce>
    <4c8>   DW_AT_data_member_location: 72
 <2><4c9>: Abbrev Number: 3 (DW_TAG_member)
    <4ca>   DW_AT_name        : (indirect string, offset: 0xa5bd3): DMAR
    <4ce>   DW_AT_decl_file   : 5
    <4cf>   DW_AT_decl_line   : 653
    <4d1>   DW_AT_decl_column : 17
    <4d2>   DW_AT_type        : <0xce>
    <4d6>   DW_AT_data_member_location: 76
 <2><4d7>: Abbrev Number: 8 (DW_TAG_member)
    <4d8>   DW_AT_name        : OR
    <4db>   DW_AT_decl_file   : 5
    <4db>   DW_AT_decl_line   : 654
    <4dd>   DW_AT_decl_column : 17
    <4dd>   DW_AT_type        : <0xce>
    <4e1>   DW_AT_data_member_location: 80
 <2><4e2>: Abbrev Number: 0
 <1><4e3>: Abbrev Number: 14 (DW_TAG_typedef)
    <4e4>   DW_AT_name        : (indirect string, offset: 0xb6fed): TIM_TypeDef
    <4e8>   DW_AT_decl_file   : 5
    <4e9>   DW_AT_decl_line   : 655
    <4eb>   DW_AT_decl_column : 3
    <4eb>   DW_AT_type        : <0x3c9>
 <1><4ef>: Abbrev Number: 19 (DW_TAG_structure_type)
    <4f0>   DW_AT_byte_size   : 28
    <4f1>   DW_AT_decl_file   : 5
    <4f2>   DW_AT_decl_line   : 661
    <4f4>   DW_AT_decl_column : 9
    <4f4>   DW_AT_sibling     : <0x54d>
 <2><4f8>: Abbrev Number: 8 (DW_TAG_member)
    <4f9>   DW_AT_name        : SR
    <4fc>   DW_AT_decl_file   : 5
    <4fc>   DW_AT_decl_line   : 663
    <4fe>   DW_AT_decl_column : 17
    <4fe>   DW_AT_type        : <0xce>
    <502>   DW_AT_data_member_location: 0
 <2><503>: Abbrev Number: 8 (DW_TAG_member)
    <504>   DW_AT_name        : DR
    <507>   DW_AT_decl_file   : 5
    <507>   DW_AT_decl_line   : 664
    <509>   DW_AT_decl_column : 17
    <509>   DW_AT_type        : <0xce>
    <50d>   DW_AT_data_member_location: 4
 <2><50e>: Abbrev Number: 8 (DW_TAG_member)
    <50f>   DW_AT_name        : BRR
    <513>   DW_AT_decl_file   : 5
    <513>   DW_AT_decl_line   : 665
    <515>   DW_AT_decl_column : 17
    <515>   DW_AT_type        : <0xce>
    <519>   DW_AT_data_member_location: 8
 <2><51a>: Abbrev Number: 8 (DW_TAG_member)
    <51b>   DW_AT_name        : CR1
    <51f>   DW_AT_decl_file   : 5
    <51f>   DW_AT_decl_line   : 666
    <521>   DW_AT_decl_column : 17
    <521>   DW_AT_type        : <0xce>
    <525>   DW_AT_data_member_location: 12
 <2><526>: Abbrev Number: 8 (DW_TAG_member)
    <527>   DW_AT_name        : CR2
    <52b>   DW_AT_decl_file   : 5
    <52b>   DW_AT_decl_line   : 667
    <52d>   DW_AT_decl_column : 17
    <52d>   DW_AT_type        : <0xce>
    <531>   DW_AT_data_member_location: 16
 <2><532>: Abbrev Number: 8 (DW_TAG_member)
    <533>   DW_AT_name        : CR3
    <537>   DW_AT_decl_file   : 5
    <537>   DW_AT_decl_line   : 668
    <539>   DW_AT_decl_column : 17
    <539>   DW_AT_type        : <0xce>
    <53d>   DW_AT_data_member_location: 20
 <2><53e>: Abbrev Number: 3 (DW_TAG_member)
    <53f>   DW_AT_name        : (indirect string, offset: 0x35fe7): GTPR
    <543>   DW_AT_decl_file   : 5
    <544>   DW_AT_decl_line   : 669
    <546>   DW_AT_decl_column : 17
    <547>   DW_AT_type        : <0xce>
    <54b>   DW_AT_data_member_location: 24
 <2><54c>: Abbrev Number: 0
 <1><54d>: Abbrev Number: 14 (DW_TAG_typedef)
    <54e>   DW_AT_name        : (indirect string, offset: 0xbfacc): USART_TypeDef
    <552>   DW_AT_decl_file   : 5
    <553>   DW_AT_decl_line   : 670
    <555>   DW_AT_decl_column : 3
    <555>   DW_AT_type        : <0x4ef>
 <1><559>: Abbrev Number: 6 (DW_TAG_typedef)
    <55a>   DW_AT_name        : (indirect string, offset: 0x80fd): size_t
    <55e>   DW_AT_decl_file   : 6
    <55f>   DW_AT_decl_line   : 214
    <560>   DW_AT_decl_column : 23
    <561>   DW_AT_type        : <0x99>
 <1><565>: Abbrev Number: 16 (DW_TAG_base_type)
    <566>   DW_AT_byte_size   : 8
    <567>   DW_AT_encoding    : 4	(float)
    <568>   DW_AT_name        : (indirect string, offset: 0x24038): long double
 <1><56c>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <56d>   DW_AT_encoding    : 7	(unsigned)
    <56e>   DW_AT_byte_size   : 1
    <56f>   DW_AT_type        : <0x44>
    <573>   DW_AT_decl_file   : 7
    <574>   DW_AT_decl_line   : 39
    <575>   DW_AT_decl_column : 1
    <576>   DW_AT_sibling     : <0x593>
 <2><57a>: Abbrev Number: 2 (DW_TAG_enumerator)
    <57b>   DW_AT_name        : (indirect string, offset: 0x41862): HAL_OK
    <57f>   DW_AT_const_value : 0
 <2><580>: Abbrev Number: 2 (DW_TAG_enumerator)
    <581>   DW_AT_name        : (indirect string, offset: 0x7881c): HAL_ERROR
    <585>   DW_AT_const_value : 1
 <2><586>: Abbrev Number: 2 (DW_TAG_enumerator)
    <587>   DW_AT_name        : (indirect string, offset: 0x2260b): HAL_BUSY
    <58b>   DW_AT_const_value : 2
 <2><58c>: Abbrev Number: 2 (DW_TAG_enumerator)
    <58d>   DW_AT_name        : (indirect string, offset: 0x38e45): HAL_TIMEOUT
    <591>   DW_AT_const_value : 3
 <2><592>: Abbrev Number: 0
 <1><593>: Abbrev Number: 6 (DW_TAG_typedef)
    <594>   DW_AT_name        : (indirect string, offset: 0x21d6): HAL_StatusTypeDef
    <598>   DW_AT_decl_file   : 7
    <599>   DW_AT_decl_line   : 44
    <59a>   DW_AT_decl_column : 3
    <59b>   DW_AT_type        : <0x56c>
 <1><59f>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <5a0>   DW_AT_encoding    : 7	(unsigned)
    <5a1>   DW_AT_byte_size   : 1
    <5a2>   DW_AT_type        : <0x44>
    <5a6>   DW_AT_decl_file   : 7
    <5a7>   DW_AT_decl_line   : 50
    <5a8>   DW_AT_decl_column : 1
    <5a9>   DW_AT_sibling     : <0x5ba>
 <2><5ad>: Abbrev Number: 2 (DW_TAG_enumerator)
    <5ae>   DW_AT_name        : (indirect string, offset: 0x8e830): HAL_UNLOCKED
    <5b2>   DW_AT_const_value : 0
 <2><5b3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <5b4>   DW_AT_name        : (indirect string, offset: 0xc10d7): HAL_LOCKED
    <5b8>   DW_AT_const_value : 1
 <2><5b9>: Abbrev Number: 0
 <1><5ba>: Abbrev Number: 6 (DW_TAG_typedef)
    <5bb>   DW_AT_name        : (indirect string, offset: 0x71f0e): HAL_LockTypeDef
    <5bf>   DW_AT_decl_file   : 7
    <5c0>   DW_AT_decl_line   : 53
    <5c1>   DW_AT_decl_column : 3
    <5c2>   DW_AT_type        : <0x59f>
 <1><5c6>: Abbrev Number: 17 (DW_TAG_structure_type)
    <5c7>   DW_AT_byte_size   : 24
    <5c8>   DW_AT_decl_file   : 8
    <5c9>   DW_AT_decl_line   : 45
    <5ca>   DW_AT_decl_column : 9
    <5ca>   DW_AT_sibling     : <0x61d>
 <2><5ce>: Abbrev Number: 1 (DW_TAG_member)
    <5cf>   DW_AT_name        : (indirect string, offset: 0x81244): PLLState
    <5d3>   DW_AT_decl_file   : 8
    <5d4>   DW_AT_decl_line   : 47
    <5d5>   DW_AT_decl_column : 12
    <5d6>   DW_AT_type        : <0xc2>
    <5da>   DW_AT_data_member_location: 0
 <2><5db>: Abbrev Number: 1 (DW_TAG_member)
    <5dc>   DW_AT_name        : (indirect string, offset: 0x859f0): PLLSource
    <5e0>   DW_AT_decl_file   : 8
    <5e1>   DW_AT_decl_line   : 50
    <5e2>   DW_AT_decl_column : 12
    <5e3>   DW_AT_type        : <0xc2>
    <5e7>   DW_AT_data_member_location: 4
 <2><5e8>: Abbrev Number: 1 (DW_TAG_member)
    <5e9>   DW_AT_name        : (indirect string, offset: 0x9fdda): PLLM
    <5ed>   DW_AT_decl_file   : 8
    <5ee>   DW_AT_decl_line   : 53
    <5ef>   DW_AT_decl_column : 12
    <5f0>   DW_AT_type        : <0xc2>
    <5f4>   DW_AT_data_member_location: 8
 <2><5f5>: Abbrev Number: 1 (DW_TAG_member)
    <5f6>   DW_AT_name        : (indirect string, offset: 0x9fddf): PLLN
    <5fa>   DW_AT_decl_file   : 8
    <5fb>   DW_AT_decl_line   : 56
    <5fc>   DW_AT_decl_column : 12
    <5fd>   DW_AT_type        : <0xc2>
    <601>   DW_AT_data_member_location: 12
 <2><602>: Abbrev Number: 1 (DW_TAG_member)
    <603>   DW_AT_name        : (indirect string, offset: 0x9fdfc): PLLP
    <607>   DW_AT_decl_file   : 8
    <608>   DW_AT_decl_line   : 60
    <609>   DW_AT_decl_column : 12
    <60a>   DW_AT_type        : <0xc2>
    <60e>   DW_AT_data_member_location: 16
 <2><60f>: Abbrev Number: 1 (DW_TAG_member)
    <610>   DW_AT_name        : (indirect string, offset: 0x482a5): PLLQ
    <614>   DW_AT_decl_file   : 8
    <615>   DW_AT_decl_line   : 63
    <616>   DW_AT_decl_column : 12
    <617>   DW_AT_type        : <0xc2>
    <61b>   DW_AT_data_member_location: 20
 <2><61c>: Abbrev Number: 0
 <1><61d>: Abbrev Number: 6 (DW_TAG_typedef)
    <61e>   DW_AT_name        : (indirect string, offset: 0x74ada): RCC_PLLInitTypeDef
    <622>   DW_AT_decl_file   : 8
    <623>   DW_AT_decl_line   : 73
    <624>   DW_AT_decl_column : 3
    <625>   DW_AT_type        : <0x5c6>
 <1><629>: Abbrev Number: 17 (DW_TAG_structure_type)
    <62a>   DW_AT_byte_size   : 48
    <62b>   DW_AT_decl_file   : 9
    <62c>   DW_AT_decl_line   : 49
    <62d>   DW_AT_decl_column : 9
    <62d>   DW_AT_sibling     : <0x68d>
 <2><631>: Abbrev Number: 1 (DW_TAG_member)
    <632>   DW_AT_name        : (indirect string, offset: 0x9d2d5): OscillatorType
    <636>   DW_AT_decl_file   : 9
    <637>   DW_AT_decl_line   : 51
    <638>   DW_AT_decl_column : 12
    <639>   DW_AT_type        : <0xc2>
    <63d>   DW_AT_data_member_location: 0
 <2><63e>: Abbrev Number: 1 (DW_TAG_member)
    <63f>   DW_AT_name        : (indirect string, offset: 0x82891): HSEState
    <643>   DW_AT_decl_file   : 9
    <644>   DW_AT_decl_line   : 54
    <645>   DW_AT_decl_column : 12
    <646>   DW_AT_type        : <0xc2>
    <64a>   DW_AT_data_member_location: 4
 <2><64b>: Abbrev Number: 1 (DW_TAG_member)
    <64c>   DW_AT_name        : (indirect string, offset: 0x79125): LSEState
    <650>   DW_AT_decl_file   : 9
    <651>   DW_AT_decl_line   : 57
    <652>   DW_AT_decl_column : 12
    <653>   DW_AT_type        : <0xc2>
    <657>   DW_AT_data_member_location: 8
 <2><658>: Abbrev Number: 1 (DW_TAG_member)
    <659>   DW_AT_name        : (indirect string, offset: 0x5629d): HSIState
    <65d>   DW_AT_decl_file   : 9
    <65e>   DW_AT_decl_line   : 60
    <65f>   DW_AT_decl_column : 12
    <660>   DW_AT_type        : <0xc2>
    <664>   DW_AT_data_member_location: 12
 <2><665>: Abbrev Number: 1 (DW_TAG_member)
    <666>   DW_AT_name        : (indirect string, offset: 0xa5de8): HSICalibrationValue
    <66a>   DW_AT_decl_file   : 9
    <66b>   DW_AT_decl_line   : 63
    <66c>   DW_AT_decl_column : 12
    <66d>   DW_AT_type        : <0xc2>
    <671>   DW_AT_data_member_location: 16
 <2><672>: Abbrev Number: 1 (DW_TAG_member)
    <673>   DW_AT_name        : (indirect string, offset: 0x44054): LSIState
    <677>   DW_AT_decl_file   : 9
    <678>   DW_AT_decl_line   : 66
    <679>   DW_AT_decl_column : 12
    <67a>   DW_AT_type        : <0xc2>
    <67e>   DW_AT_data_member_location: 20
 <2><67f>: Abbrev Number: 35 (DW_TAG_member)
    <680>   DW_AT_name        : PLL
    <684>   DW_AT_decl_file   : 9
    <685>   DW_AT_decl_line   : 69
    <686>   DW_AT_decl_column : 22
    <687>   DW_AT_type        : <0x61d>
    <68b>   DW_AT_data_member_location: 24
 <2><68c>: Abbrev Number: 0
 <1><68d>: Abbrev Number: 6 (DW_TAG_typedef)
    <68e>   DW_AT_name        : (indirect string, offset: 0x666e6): RCC_OscInitTypeDef
    <692>   DW_AT_decl_file   : 9
    <693>   DW_AT_decl_line   : 70
    <694>   DW_AT_decl_column : 3
    <695>   DW_AT_type        : <0x629>
 <1><699>: Abbrev Number: 17 (DW_TAG_structure_type)
    <69a>   DW_AT_byte_size   : 20
    <69b>   DW_AT_decl_file   : 9
    <69c>   DW_AT_decl_line   : 75
    <69d>   DW_AT_decl_column : 9
    <69d>   DW_AT_sibling     : <0x6e3>
 <2><6a1>: Abbrev Number: 1 (DW_TAG_member)
    <6a2>   DW_AT_name        : (indirect string, offset: 0x3b765): ClockType
    <6a6>   DW_AT_decl_file   : 9
    <6a7>   DW_AT_decl_line   : 77
    <6a8>   DW_AT_decl_column : 12
    <6a9>   DW_AT_type        : <0xc2>
    <6ad>   DW_AT_data_member_location: 0
 <2><6ae>: Abbrev Number: 1 (DW_TAG_member)
    <6af>   DW_AT_name        : (indirect string, offset: 0x7458d): SYSCLKSource
    <6b3>   DW_AT_decl_file   : 9
    <6b4>   DW_AT_decl_line   : 80
    <6b5>   DW_AT_decl_column : 12
    <6b6>   DW_AT_type        : <0xc2>
    <6ba>   DW_AT_data_member_location: 4
 <2><6bb>: Abbrev Number: 1 (DW_TAG_member)
    <6bc>   DW_AT_name        : (indirect string, offset: 0x9f841): AHBCLKDivider
    <6c0>   DW_AT_decl_file   : 9
    <6c1>   DW_AT_decl_line   : 83
    <6c2>   DW_AT_decl_column : 12
    <6c3>   DW_AT_type        : <0xc2>
    <6c7>   DW_AT_data_member_location: 8
 <2><6c8>: Abbrev Number: 1 (DW_TAG_member)
    <6c9>   DW_AT_name        : (indirect string, offset: 0x73db): APB1CLKDivider
    <6cd>   DW_AT_decl_file   : 9
    <6ce>   DW_AT_decl_line   : 86
    <6cf>   DW_AT_decl_column : 12
    <6d0>   DW_AT_type        : <0xc2>
    <6d4>   DW_AT_data_member_location: 12
 <2><6d5>: Abbrev Number: 1 (DW_TAG_member)
    <6d6>   DW_AT_name        : (indirect string, offset: 0x587f9): APB2CLKDivider
    <6da>   DW_AT_decl_file   : 9
    <6db>   DW_AT_decl_line   : 89
    <6dc>   DW_AT_decl_column : 12
    <6dd>   DW_AT_type        : <0xc2>
    <6e1>   DW_AT_data_member_location: 16
 <2><6e2>: Abbrev Number: 0
 <1><6e3>: Abbrev Number: 6 (DW_TAG_typedef)
    <6e4>   DW_AT_name        : (indirect string, offset: 0x86cc2): RCC_ClkInitTypeDef
    <6e8>   DW_AT_decl_file   : 9
    <6e9>   DW_AT_decl_line   : 92
    <6ea>   DW_AT_decl_column : 3
    <6eb>   DW_AT_type        : <0x699>
 <1><6ef>: Abbrev Number: 17 (DW_TAG_structure_type)
    <6f0>   DW_AT_byte_size   : 20
    <6f1>   DW_AT_decl_file   : 10
    <6f2>   DW_AT_decl_line   : 46
    <6f3>   DW_AT_decl_column : 9
    <6f3>   DW_AT_sibling     : <0x739>
 <2><6f7>: Abbrev Number: 35 (DW_TAG_member)
    <6f8>   DW_AT_name        : Pin
    <6fc>   DW_AT_decl_file   : 10
    <6fd>   DW_AT_decl_line   : 48
    <6fe>   DW_AT_decl_column : 12
    <6ff>   DW_AT_type        : <0xc2>
    <703>   DW_AT_data_member_location: 0
 <2><704>: Abbrev Number: 1 (DW_TAG_member)
    <705>   DW_AT_name        : (indirect string, offset: 0xc5902): Mode
    <709>   DW_AT_decl_file   : 10
    <70a>   DW_AT_decl_line   : 51
    <70b>   DW_AT_decl_column : 12
    <70c>   DW_AT_type        : <0xc2>
    <710>   DW_AT_data_member_location: 4
 <2><711>: Abbrev Number: 1 (DW_TAG_member)
    <712>   DW_AT_name        : (indirect string, offset: 0x6330b): Pull
    <716>   DW_AT_decl_file   : 10
    <717>   DW_AT_decl_line   : 54
    <718>   DW_AT_decl_column : 12
    <719>   DW_AT_type        : <0xc2>
    <71d>   DW_AT_data_member_location: 8
 <2><71e>: Abbrev Number: 1 (DW_TAG_member)
    <71f>   DW_AT_name        : (indirect string, offset: 0x713c8): Speed
    <723>   DW_AT_decl_file   : 10
    <724>   DW_AT_decl_line   : 57
    <725>   DW_AT_decl_column : 12
    <726>   DW_AT_type        : <0xc2>
    <72a>   DW_AT_data_member_location: 12
 <2><72b>: Abbrev Number: 1 (DW_TAG_member)
    <72c>   DW_AT_name        : (indirect string, offset: 0x587ba): Alternate
    <730>   DW_AT_decl_file   : 10
    <731>   DW_AT_decl_line   : 60
    <732>   DW_AT_decl_column : 12
    <733>   DW_AT_type        : <0xc2>
    <737>   DW_AT_data_member_location: 16
 <2><738>: Abbrev Number: 0
 <1><739>: Abbrev Number: 6 (DW_TAG_typedef)
    <73a>   DW_AT_name        : (indirect string, offset: 0x970ee): GPIO_InitTypeDef
    <73e>   DW_AT_decl_file   : 10
    <73f>   DW_AT_decl_line   : 62
    <740>   DW_AT_decl_column : 2
    <741>   DW_AT_type        : <0x6ef>
 <1><745>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <746>   DW_AT_encoding    : 7	(unsigned)
    <747>   DW_AT_byte_size   : 1
    <748>   DW_AT_type        : <0x44>
    <74c>   DW_AT_decl_file   : 10
    <74d>   DW_AT_decl_line   : 68
    <74e>   DW_AT_decl_column : 1
    <74f>   DW_AT_sibling     : <0x760>
 <2><753>: Abbrev Number: 2 (DW_TAG_enumerator)
    <754>   DW_AT_name        : (indirect string, offset: 0x28914): GPIO_PIN_RESET
    <758>   DW_AT_const_value : 0
 <2><759>: Abbrev Number: 2 (DW_TAG_enumerator)
    <75a>   DW_AT_name        : (indirect string, offset: 0x313e8): GPIO_PIN_SET
    <75e>   DW_AT_const_value : 1
 <2><75f>: Abbrev Number: 0
 <1><760>: Abbrev Number: 6 (DW_TAG_typedef)
    <761>   DW_AT_name        : (indirect string, offset: 0xbdf5c): GPIO_PinState
    <765>   DW_AT_decl_file   : 10
    <766>   DW_AT_decl_line   : 71
    <767>   DW_AT_decl_column : 2
    <768>   DW_AT_type        : <0x745>
 <1><76c>: Abbrev Number: 17 (DW_TAG_structure_type)
    <76d>   DW_AT_byte_size   : 48
    <76e>   DW_AT_decl_file   : 11
    <76f>   DW_AT_decl_line   : 48
    <770>   DW_AT_decl_column : 9
    <770>   DW_AT_sibling     : <0x811>
 <2><774>: Abbrev Number: 1 (DW_TAG_member)
    <775>   DW_AT_name        : (indirect string, offset: 0x6442a): Channel
    <779>   DW_AT_decl_file   : 11
    <77a>   DW_AT_decl_line   : 50
    <77b>   DW_AT_decl_column : 12
    <77c>   DW_AT_type        : <0xc2>
    <780>   DW_AT_data_member_location: 0
 <2><781>: Abbrev Number: 1 (DW_TAG_member)
    <782>   DW_AT_name        : (indirect string, offset: 0x47ee7): Direction
    <786>   DW_AT_decl_file   : 11
    <787>   DW_AT_decl_line   : 53
    <788>   DW_AT_decl_column : 12
    <789>   DW_AT_type        : <0xc2>
    <78d>   DW_AT_data_member_location: 4
 <2><78e>: Abbrev Number: 1 (DW_TAG_member)
    <78f>   DW_AT_name        : (indirect string, offset: 0xca9c): PeriphInc
    <793>   DW_AT_decl_file   : 11
    <794>   DW_AT_decl_line   : 57
    <795>   DW_AT_decl_column : 12
    <796>   DW_AT_type        : <0xc2>
    <79a>   DW_AT_data_member_location: 8
 <2><79b>: Abbrev Number: 1 (DW_TAG_member)
    <79c>   DW_AT_name        : (indirect string, offset: 0x1ec38): MemInc
    <7a0>   DW_AT_decl_file   : 11
    <7a1>   DW_AT_decl_line   : 60
    <7a2>   DW_AT_decl_column : 12
    <7a3>   DW_AT_type        : <0xc2>
    <7a7>   DW_AT_data_member_location: 12
 <2><7a8>: Abbrev Number: 1 (DW_TAG_member)
    <7a9>   DW_AT_name        : (indirect string, offset: 0x5ff0b): PeriphDataAlignment
    <7ad>   DW_AT_decl_file   : 11
    <7ae>   DW_AT_decl_line   : 63
    <7af>   DW_AT_decl_column : 12
    <7b0>   DW_AT_type        : <0xc2>
    <7b4>   DW_AT_data_member_location: 16
 <2><7b5>: Abbrev Number: 1 (DW_TAG_member)
    <7b6>   DW_AT_name        : (indirect string, offset: 0xae8fd): MemDataAlignment
    <7ba>   DW_AT_decl_file   : 11
    <7bb>   DW_AT_decl_line   : 66
    <7bc>   DW_AT_decl_column : 12
    <7bd>   DW_AT_type        : <0xc2>
    <7c1>   DW_AT_data_member_location: 20
 <2><7c2>: Abbrev Number: 1 (DW_TAG_member)
    <7c3>   DW_AT_name        : (indirect string, offset: 0xc5902): Mode
    <7c7>   DW_AT_decl_file   : 11
    <7c8>   DW_AT_decl_line   : 69
    <7c9>   DW_AT_decl_column : 12
    <7ca>   DW_AT_type        : <0xc2>
    <7ce>   DW_AT_data_member_location: 24
 <2><7cf>: Abbrev Number: 1 (DW_TAG_member)
    <7d0>   DW_AT_name        : (indirect string, offset: 0xc4e4e): Priority
    <7d4>   DW_AT_decl_file   : 11
    <7d5>   DW_AT_decl_line   : 74
    <7d6>   DW_AT_decl_column : 12
    <7d7>   DW_AT_type        : <0xc2>
    <7db>   DW_AT_data_member_location: 28
 <2><7dc>: Abbrev Number: 1 (DW_TAG_member)
    <7dd>   DW_AT_name        : (indirect string, offset: 0x53790): FIFOMode
    <7e1>   DW_AT_decl_file   : 11
    <7e2>   DW_AT_decl_line   : 77
    <7e3>   DW_AT_decl_column : 12
    <7e4>   DW_AT_type        : <0xc2>
    <7e8>   DW_AT_data_member_location: 32
 <2><7e9>: Abbrev Number: 1 (DW_TAG_member)
    <7ea>   DW_AT_name        : (indirect string, offset: 0x92bec): FIFOThreshold
    <7ee>   DW_AT_decl_file   : 11
    <7ef>   DW_AT_decl_line   : 82
    <7f0>   DW_AT_decl_column : 12
    <7f1>   DW_AT_type        : <0xc2>
    <7f5>   DW_AT_data_member_location: 36
 <2><7f6>: Abbrev Number: 1 (DW_TAG_member)
    <7f7>   DW_AT_name        : (indirect string, offset: 0x90f59): MemBurst
    <7fb>   DW_AT_decl_file   : 11
    <7fc>   DW_AT_decl_line   : 85
    <7fd>   DW_AT_decl_column : 12
    <7fe>   DW_AT_type        : <0xc2>
    <802>   DW_AT_data_member_location: 40
 <2><803>: Abbrev Number: 1 (DW_TAG_member)
    <804>   DW_AT_name        : (indirect string, offset: 0x4277f): PeriphBurst
    <808>   DW_AT_decl_file   : 11
    <809>   DW_AT_decl_line   : 91
    <80a>   DW_AT_decl_column : 12
    <80b>   DW_AT_type        : <0xc2>
    <80f>   DW_AT_data_member_location: 44
 <2><810>: Abbrev Number: 0
 <1><811>: Abbrev Number: 6 (DW_TAG_typedef)
    <812>   DW_AT_name        : (indirect string, offset: 0x3450e): DMA_InitTypeDef
    <816>   DW_AT_decl_file   : 11
    <817>   DW_AT_decl_line   : 96
    <818>   DW_AT_decl_column : 2
    <819>   DW_AT_type        : <0x76c>
 <1><81d>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <81e>   DW_AT_encoding    : 7	(unsigned)
    <81f>   DW_AT_byte_size   : 1
    <820>   DW_AT_type        : <0x44>
    <824>   DW_AT_decl_file   : 11
    <825>   DW_AT_decl_line   : 103
    <826>   DW_AT_decl_column : 1
    <827>   DW_AT_sibling     : <0x850>
 <2><82b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <82c>   DW_AT_name        : (indirect string, offset: 0xc5d0): HAL_DMA_STATE_RESET
    <830>   DW_AT_const_value : 0
 <2><831>: Abbrev Number: 2 (DW_TAG_enumerator)
    <832>   DW_AT_name        : (indirect string, offset: 0x35793): HAL_DMA_STATE_READY
    <836>   DW_AT_const_value : 1
 <2><837>: Abbrev Number: 2 (DW_TAG_enumerator)
    <838>   DW_AT_name        : (indirect string, offset: 0x85381): HAL_DMA_STATE_BUSY
    <83c>   DW_AT_const_value : 2
 <2><83d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <83e>   DW_AT_name        : (indirect string, offset: 0xbe325): HAL_DMA_STATE_TIMEOUT
    <842>   DW_AT_const_value : 3
 <2><843>: Abbrev Number: 2 (DW_TAG_enumerator)
    <844>   DW_AT_name        : (indirect string, offset: 0x9269b): HAL_DMA_STATE_ERROR
    <848>   DW_AT_const_value : 4
 <2><849>: Abbrev Number: 2 (DW_TAG_enumerator)
    <84a>   DW_AT_name        : (indirect string, offset: 0x4bd5b): HAL_DMA_STATE_ABORT
    <84e>   DW_AT_const_value : 5
 <2><84f>: Abbrev Number: 0
 <1><850>: Abbrev Number: 6 (DW_TAG_typedef)
    <851>   DW_AT_name        : (indirect string, offset: 0xadc3b): HAL_DMA_StateTypeDef
    <855>   DW_AT_decl_file   : 11
    <856>   DW_AT_decl_line   : 110
    <857>   DW_AT_decl_column : 2
    <858>   DW_AT_type        : <0x81d>
 <1><85c>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <85d>   DW_AT_type        : <0x850>
 <1><861>: Abbrev Number: 31 (DW_TAG_structure_type)
    <862>   DW_AT_name        : (indirect string, offset: 0xa4217): __DMA_HandleTypeDef
    <866>   DW_AT_byte_size   : 96
    <867>   DW_AT_decl_file   : 11
    <868>   DW_AT_decl_line   : 138
    <869>   DW_AT_decl_column : 16
    <869>   DW_AT_sibling     : <0x924>
 <2><86d>: Abbrev Number: 1 (DW_TAG_member)
    <86e>   DW_AT_name        : (indirect string, offset: 0xbae4a): Instance
    <872>   DW_AT_decl_file   : 11
    <873>   DW_AT_decl_line   : 140
    <874>   DW_AT_decl_column : 31
    <875>   DW_AT_type        : <0x924>
    <879>   DW_AT_data_member_location: 0
 <2><87a>: Abbrev Number: 1 (DW_TAG_member)
    <87b>   DW_AT_name        : (indirect string, offset: 0x9ecb3): Init
    <87f>   DW_AT_decl_file   : 11
    <880>   DW_AT_decl_line   : 142
    <881>   DW_AT_decl_column : 30
    <882>   DW_AT_type        : <0x811>
    <886>   DW_AT_data_member_location: 4
 <2><887>: Abbrev Number: 1 (DW_TAG_member)
    <888>   DW_AT_name        : (indirect string, offset: 0x89444): Lock
    <88c>   DW_AT_decl_file   : 11
    <88d>   DW_AT_decl_line   : 144
    <88e>   DW_AT_decl_column : 30
    <88f>   DW_AT_type        : <0x5ba>
    <893>   DW_AT_data_member_location: 52
 <2><894>: Abbrev Number: 1 (DW_TAG_member)
    <895>   DW_AT_name        : (indirect string, offset: 0x82894): State
    <899>   DW_AT_decl_file   : 11
    <89a>   DW_AT_decl_line   : 146
    <89b>   DW_AT_decl_column : 30
    <89c>   DW_AT_type        : <0x85c>
    <8a0>   DW_AT_data_member_location: 53
 <2><8a1>: Abbrev Number: 1 (DW_TAG_member)
    <8a2>   DW_AT_name        : (indirect string, offset: 0xb7daa): Parent
    <8a6>   DW_AT_decl_file   : 11
    <8a7>   DW_AT_decl_line   : 148
    <8a8>   DW_AT_decl_column : 31
    <8a9>   DW_AT_type        : <0x929>
    <8ad>   DW_AT_data_member_location: 56
 <2><8ae>: Abbrev Number: 1 (DW_TAG_member)
    <8af>   DW_AT_name        : (indirect string, offset: 0xc06ba): XferCpltCallback
    <8b3>   DW_AT_decl_file   : 11
    <8b4>   DW_AT_decl_line   : 150
    <8b5>   DW_AT_decl_column : 33
    <8b6>   DW_AT_type        : <0x93b>
    <8ba>   DW_AT_data_member_location: 60
 <2><8bb>: Abbrev Number: 1 (DW_TAG_member)
    <8bc>   DW_AT_name        : (indirect string, offset: 0x961ef): XferHalfCpltCallback
    <8c0>   DW_AT_decl_file   : 11
    <8c1>   DW_AT_decl_line   : 152
    <8c2>   DW_AT_decl_column : 33
    <8c3>   DW_AT_type        : <0x93b>
    <8c7>   DW_AT_data_member_location: 64
 <2><8c8>: Abbrev Number: 1 (DW_TAG_member)
    <8c9>   DW_AT_name        : (indirect string, offset: 0x715f5): XferM1CpltCallback
    <8cd>   DW_AT_decl_file   : 11
    <8ce>   DW_AT_decl_line   : 154
    <8cf>   DW_AT_decl_column : 33
    <8d0>   DW_AT_type        : <0x93b>
    <8d4>   DW_AT_data_member_location: 68
 <2><8d5>: Abbrev Number: 1 (DW_TAG_member)
    <8d6>   DW_AT_name        : (indirect string, offset: 0x5cdaa): XferM1HalfCpltCallback
    <8da>   DW_AT_decl_file   : 11
    <8db>   DW_AT_decl_line   : 156
    <8dc>   DW_AT_decl_column : 33
    <8dd>   DW_AT_type        : <0x93b>
    <8e1>   DW_AT_data_member_location: 72
 <2><8e2>: Abbrev Number: 1 (DW_TAG_member)
    <8e3>   DW_AT_name        : (indirect string, offset: 0x1c415): XferErrorCallback
    <8e7>   DW_AT_decl_file   : 11
    <8e8>   DW_AT_decl_line   : 158
    <8e9>   DW_AT_decl_column : 33
    <8ea>   DW_AT_type        : <0x93b>
    <8ee>   DW_AT_data_member_location: 76
 <2><8ef>: Abbrev Number: 1 (DW_TAG_member)
    <8f0>   DW_AT_name        : (indirect string, offset: 0xb46dd): XferAbortCallback
    <8f4>   DW_AT_decl_file   : 11
    <8f5>   DW_AT_decl_line   : 160
    <8f6>   DW_AT_decl_column : 33
    <8f7>   DW_AT_type        : <0x93b>
    <8fb>   DW_AT_data_member_location: 80
 <2><8fc>: Abbrev Number: 1 (DW_TAG_member)
    <8fd>   DW_AT_name        : (indirect string, offset: 0xbd038): ErrorCode
    <901>   DW_AT_decl_file   : 11
    <902>   DW_AT_decl_line   : 162
    <903>   DW_AT_decl_column : 30
    <904>   DW_AT_type        : <0xce>
    <908>   DW_AT_data_member_location: 84
 <2><909>: Abbrev Number: 1 (DW_TAG_member)
    <90a>   DW_AT_name        : (indirect string, offset: 0x56610): StreamBaseAddress
    <90e>   DW_AT_decl_file   : 11
    <90f>   DW_AT_decl_line   : 164
    <910>   DW_AT_decl_column : 30
    <911>   DW_AT_type        : <0xc2>
    <915>   DW_AT_data_member_location: 88
 <2><916>: Abbrev Number: 1 (DW_TAG_member)
    <917>   DW_AT_name        : (indirect string, offset: 0xa236c): StreamIndex
    <91b>   DW_AT_decl_file   : 11
    <91c>   DW_AT_decl_line   : 166
    <91d>   DW_AT_decl_column : 30
    <91e>   DW_AT_type        : <0xc2>
    <922>   DW_AT_data_member_location: 92
 <2><923>: Abbrev Number: 0
 <1><924>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <925>   DW_AT_byte_size   : 4
    <925>   DW_AT_type        : <0x13a>
 <1><929>: Abbrev Number: 45 (DW_TAG_pointer_type)
    <92a>   DW_AT_byte_size   : 4
 <1><92b>: Abbrev Number: 36 (DW_TAG_subroutine_type)
    <92c>   DW_AT_prototyped  : 1
    <92c>   DW_AT_sibling     : <0x936>
 <2><930>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <931>   DW_AT_type        : <0x936>
 <2><935>: Abbrev Number: 0
 <1><936>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <937>   DW_AT_byte_size   : 4
    <937>   DW_AT_type        : <0x861>
 <1><93b>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <93c>   DW_AT_byte_size   : 4
    <93c>   DW_AT_type        : <0x92b>
 <1><940>: Abbrev Number: 6 (DW_TAG_typedef)
    <941>   DW_AT_name        : (indirect string, offset: 0xa4219): DMA_HandleTypeDef
    <945>   DW_AT_decl_file   : 11
    <946>   DW_AT_decl_line   : 168
    <947>   DW_AT_decl_column : 2
    <948>   DW_AT_type        : <0x861>
 <1><94c>: Abbrev Number: 17 (DW_TAG_structure_type)
    <94d>   DW_AT_byte_size   : 24
    <94e>   DW_AT_decl_file   : 12
    <94f>   DW_AT_decl_line   : 46
    <950>   DW_AT_decl_column : 9
    <950>   DW_AT_sibling     : <0x9a3>
 <2><954>: Abbrev Number: 1 (DW_TAG_member)
    <955>   DW_AT_name        : (indirect string, offset: 0xc24e9): Prescaler
    <959>   DW_AT_decl_file   : 12
    <95a>   DW_AT_decl_line   : 48
    <95b>   DW_AT_decl_column : 12
    <95c>   DW_AT_type        : <0xc2>
    <960>   DW_AT_data_member_location: 0
 <2><961>: Abbrev Number: 1 (DW_TAG_member)
    <962>   DW_AT_name        : (indirect string, offset: 0xaf8c9): CounterMode
    <966>   DW_AT_decl_file   : 12
    <967>   DW_AT_decl_line   : 51
    <968>   DW_AT_decl_column : 12
    <969>   DW_AT_type        : <0xc2>
    <96d>   DW_AT_data_member_location: 4
 <2><96e>: Abbrev Number: 1 (DW_TAG_member)
    <96f>   DW_AT_name        : (indirect string, offset: 0xcbb91): Period
    <973>   DW_AT_decl_file   : 12
    <974>   DW_AT_decl_line   : 54
    <975>   DW_AT_decl_column : 12
    <976>   DW_AT_type        : <0xc2>
    <97a>   DW_AT_data_member_location: 8
 <2><97b>: Abbrev Number: 1 (DW_TAG_member)
    <97c>   DW_AT_name        : (indirect string, offset: 0x4ebdb): ClockDivision
    <980>   DW_AT_decl_file   : 12
    <981>   DW_AT_decl_line   : 58
    <982>   DW_AT_decl_column : 12
    <983>   DW_AT_type        : <0xc2>
    <987>   DW_AT_data_member_location: 12
 <2><988>: Abbrev Number: 1 (DW_TAG_member)
    <989>   DW_AT_name        : (indirect string, offset: 0x869f5): RepetitionCounter
    <98d>   DW_AT_decl_file   : 12
    <98e>   DW_AT_decl_line   : 61
    <98f>   DW_AT_decl_column : 12
    <990>   DW_AT_type        : <0xc2>
    <994>   DW_AT_data_member_location: 16
 <2><995>: Abbrev Number: 1 (DW_TAG_member)
    <996>   DW_AT_name        : (indirect string, offset: 0xb2634): AutoReloadPreload
    <99a>   DW_AT_decl_file   : 12
    <99b>   DW_AT_decl_line   : 72
    <99c>   DW_AT_decl_column : 12
    <99d>   DW_AT_type        : <0xc2>
    <9a1>   DW_AT_data_member_location: 20
 <2><9a2>: Abbrev Number: 0
 <1><9a3>: Abbrev Number: 6 (DW_TAG_typedef)
    <9a4>   DW_AT_name        : (indirect string, offset: 0x4300b): TIM_Base_InitTypeDef
    <9a8>   DW_AT_decl_file   : 12
    <9a9>   DW_AT_decl_line   : 74
    <9aa>   DW_AT_decl_column : 3
    <9ab>   DW_AT_type        : <0x94c>
 <1><9af>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <9b0>   DW_AT_encoding    : 7	(unsigned)
    <9b0>   DW_AT_byte_size   : 1
    <9b0>   DW_AT_type        : <0x44>
    <9b4>   DW_AT_decl_file   : 12
    <9b4>   DW_AT_decl_line   : 291
    <9b6>   DW_AT_decl_column : 1
    <9b6>   DW_AT_sibling     : <0x9d9>
 <2><9ba>: Abbrev Number: 2 (DW_TAG_enumerator)
    <9bb>   DW_AT_name        : (indirect string, offset: 0xa7baa): HAL_TIM_STATE_RESET
    <9bf>   DW_AT_const_value : 0
 <2><9c0>: Abbrev Number: 2 (DW_TAG_enumerator)
    <9c1>   DW_AT_name        : (indirect string, offset: 0x6a8e): HAL_TIM_STATE_READY
    <9c5>   DW_AT_const_value : 1
 <2><9c6>: Abbrev Number: 2 (DW_TAG_enumerator)
    <9c7>   DW_AT_name        : (indirect string, offset: 0x31382): HAL_TIM_STATE_BUSY
    <9cb>   DW_AT_const_value : 2
 <2><9cc>: Abbrev Number: 2 (DW_TAG_enumerator)
    <9cd>   DW_AT_name        : (indirect string, offset: 0xa1599): HAL_TIM_STATE_TIMEOUT
    <9d1>   DW_AT_const_value : 3
 <2><9d2>: Abbrev Number: 2 (DW_TAG_enumerator)
    <9d3>   DW_AT_name        : (indirect string, offset: 0x76fbd): HAL_TIM_STATE_ERROR
    <9d7>   DW_AT_const_value : 4
 <2><9d8>: Abbrev Number: 0
 <1><9d9>: Abbrev Number: 14 (DW_TAG_typedef)
    <9da>   DW_AT_name        : (indirect string, offset: 0x7e753): HAL_TIM_StateTypeDef
    <9de>   DW_AT_decl_file   : 12
    <9df>   DW_AT_decl_line   : 297
    <9e1>   DW_AT_decl_column : 3
    <9e1>   DW_AT_type        : <0x9af>
 <1><9e5>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <9e6>   DW_AT_type        : <0x9d9>
 <1><9ea>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <9eb>   DW_AT_encoding    : 7	(unsigned)
    <9eb>   DW_AT_byte_size   : 1
    <9eb>   DW_AT_type        : <0x44>
    <9ef>   DW_AT_decl_file   : 12
    <9ef>   DW_AT_decl_line   : 303
    <9f1>   DW_AT_decl_column : 1
    <9f1>   DW_AT_sibling     : <0xa08>
 <2><9f5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <9f6>   DW_AT_name        : (indirect string, offset: 0x87de3): HAL_TIM_CHANNEL_STATE_RESET
    <9fa>   DW_AT_const_value : 0
 <2><9fb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <9fc>   DW_AT_name        : (indirect string, offset: 0x718bb): HAL_TIM_CHANNEL_STATE_READY
    <a00>   DW_AT_const_value : 1
 <2><a01>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a02>   DW_AT_name        : (indirect string, offset: 0x5cf35): HAL_TIM_CHANNEL_STATE_BUSY
    <a06>   DW_AT_const_value : 2
 <2><a07>: Abbrev Number: 0
 <1><a08>: Abbrev Number: 14 (DW_TAG_typedef)
    <a09>   DW_AT_name        : (indirect string, offset: 0x2925a): HAL_TIM_ChannelStateTypeDef
    <a0d>   DW_AT_decl_file   : 12
    <a0e>   DW_AT_decl_line   : 307
    <a10>   DW_AT_decl_column : 3
    <a10>   DW_AT_type        : <0x9ea>
 <1><a14>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <a15>   DW_AT_type        : <0xa08>
 <1><a19>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <a1a>   DW_AT_encoding    : 7	(unsigned)
    <a1a>   DW_AT_byte_size   : 1
    <a1a>   DW_AT_type        : <0x44>
    <a1e>   DW_AT_decl_file   : 12
    <a1e>   DW_AT_decl_line   : 313
    <a20>   DW_AT_decl_column : 1
    <a20>   DW_AT_sibling     : <0xa37>
 <2><a24>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a25>   DW_AT_name        : (indirect string, offset: 0x3bf9): HAL_DMA_BURST_STATE_RESET
    <a29>   DW_AT_const_value : 0
 <2><a2a>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a2b>   DW_AT_name        : (indirect string, offset: 0x6a569): HAL_DMA_BURST_STATE_READY
    <a2f>   DW_AT_const_value : 1
 <2><a30>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a31>   DW_AT_name        : (indirect string, offset: 0x417af): HAL_DMA_BURST_STATE_BUSY
    <a35>   DW_AT_const_value : 2
 <2><a36>: Abbrev Number: 0
 <1><a37>: Abbrev Number: 14 (DW_TAG_typedef)
    <a38>   DW_AT_name        : (indirect string, offset: 0x1ab3b): HAL_TIM_DMABurstStateTypeDef
    <a3c>   DW_AT_decl_file   : 12
    <a3d>   DW_AT_decl_line   : 317
    <a3f>   DW_AT_decl_column : 3
    <a3f>   DW_AT_type        : <0xa19>
 <1><a43>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <a44>   DW_AT_type        : <0xa37>
 <1><a48>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <a49>   DW_AT_encoding    : 7	(unsigned)
    <a49>   DW_AT_byte_size   : 1
    <a49>   DW_AT_type        : <0x44>
    <a4d>   DW_AT_decl_file   : 12
    <a4d>   DW_AT_decl_line   : 323
    <a4f>   DW_AT_decl_column : 1
    <a4f>   DW_AT_sibling     : <0xa72>
 <2><a53>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a54>   DW_AT_name        : (indirect string, offset: 0x6c5ae): HAL_TIM_ACTIVE_CHANNEL_1
    <a58>   DW_AT_const_value : 1
 <2><a59>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a5a>   DW_AT_name        : (indirect string, offset: 0x6c5c7): HAL_TIM_ACTIVE_CHANNEL_2
    <a5e>   DW_AT_const_value : 2
 <2><a5f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a60>   DW_AT_name        : (indirect string, offset: 0x6c5e0): HAL_TIM_ACTIVE_CHANNEL_3
    <a64>   DW_AT_const_value : 4
 <2><a65>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a66>   DW_AT_name        : (indirect string, offset: 0x6c5f9): HAL_TIM_ACTIVE_CHANNEL_4
    <a6a>   DW_AT_const_value : 8
 <2><a6b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a6c>   DW_AT_name        : (indirect string, offset: 0x4fcfd): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <a70>   DW_AT_const_value : 0
 <2><a71>: Abbrev Number: 0
 <1><a72>: Abbrev Number: 14 (DW_TAG_typedef)
    <a73>   DW_AT_name        : (indirect string, offset: 0x6441c): HAL_TIM_ActiveChannel
    <a77>   DW_AT_decl_file   : 12
    <a78>   DW_AT_decl_line   : 329
    <a7a>   DW_AT_decl_column : 3
    <a7a>   DW_AT_type        : <0xa48>
 <1><a7e>: Abbrev Number: 19 (DW_TAG_structure_type)
    <a7f>   DW_AT_byte_size   : 72
    <a80>   DW_AT_decl_file   : 12
    <a81>   DW_AT_decl_line   : 337
    <a83>   DW_AT_decl_column : 9
    <a83>   DW_AT_sibling     : <0xb06>
 <2><a87>: Abbrev Number: 3 (DW_TAG_member)
    <a88>   DW_AT_name        : (indirect string, offset: 0xbae4a): Instance
    <a8c>   DW_AT_decl_file   : 12
    <a8d>   DW_AT_decl_line   : 340
    <a8f>   DW_AT_decl_column : 39
    <a90>   DW_AT_type        : <0xb06>
    <a94>   DW_AT_data_member_location: 0
 <2><a95>: Abbrev Number: 3 (DW_TAG_member)
    <a96>   DW_AT_name        : (indirect string, offset: 0x9ecb3): Init
    <a9a>   DW_AT_decl_file   : 12
    <a9b>   DW_AT_decl_line   : 341
    <a9d>   DW_AT_decl_column : 38
    <a9e>   DW_AT_type        : <0x9a3>
    <aa2>   DW_AT_data_member_location: 4
 <2><aa3>: Abbrev Number: 3 (DW_TAG_member)
    <aa4>   DW_AT_name        : (indirect string, offset: 0x6442a): Channel
    <aa8>   DW_AT_decl_file   : 12
    <aa9>   DW_AT_decl_line   : 342
    <aab>   DW_AT_decl_column : 38
    <aac>   DW_AT_type        : <0xa72>
    <ab0>   DW_AT_data_member_location: 28
 <2><ab1>: Abbrev Number: 3 (DW_TAG_member)
    <ab2>   DW_AT_name        : (indirect string, offset: 0x73c77): hdma
    <ab6>   DW_AT_decl_file   : 12
    <ab7>   DW_AT_decl_line   : 343
    <ab9>   DW_AT_decl_column : 39
    <aba>   DW_AT_type        : <0xb0b>
    <abe>   DW_AT_data_member_location: 32
 <2><abf>: Abbrev Number: 3 (DW_TAG_member)
    <ac0>   DW_AT_name        : (indirect string, offset: 0x89444): Lock
    <ac4>   DW_AT_decl_file   : 12
    <ac5>   DW_AT_decl_line   : 345
    <ac7>   DW_AT_decl_column : 38
    <ac8>   DW_AT_type        : <0x5ba>
    <acc>   DW_AT_data_member_location: 60
 <2><acd>: Abbrev Number: 3 (DW_TAG_member)
    <ace>   DW_AT_name        : (indirect string, offset: 0x82894): State
    <ad2>   DW_AT_decl_file   : 12
    <ad3>   DW_AT_decl_line   : 346
    <ad5>   DW_AT_decl_column : 38
    <ad6>   DW_AT_type        : <0x9e5>
    <ada>   DW_AT_data_member_location: 61
 <2><adb>: Abbrev Number: 3 (DW_TAG_member)
    <adc>   DW_AT_name        : (indirect string, offset: 0xc5fca): ChannelState
    <ae0>   DW_AT_decl_file   : 12
    <ae1>   DW_AT_decl_line   : 347
    <ae3>   DW_AT_decl_column : 38
    <ae4>   DW_AT_type        : <0xb30>
    <ae8>   DW_AT_data_member_location: 62
 <2><ae9>: Abbrev Number: 3 (DW_TAG_member)
    <aea>   DW_AT_name        : (indirect string, offset: 0xc65fb): ChannelNState
    <aee>   DW_AT_decl_file   : 12
    <aef>   DW_AT_decl_line   : 348
    <af1>   DW_AT_decl_column : 38
    <af2>   DW_AT_type        : <0xb30>
    <af6>   DW_AT_data_member_location: 66
 <2><af7>: Abbrev Number: 3 (DW_TAG_member)
    <af8>   DW_AT_name        : (indirect string, offset: 0xc5b58): DMABurstState
    <afc>   DW_AT_decl_file   : 12
    <afd>   DW_AT_decl_line   : 349
    <aff>   DW_AT_decl_column : 38
    <b00>   DW_AT_type        : <0xa43>
    <b04>   DW_AT_data_member_location: 70
 <2><b05>: Abbrev Number: 0
 <1><b06>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <b07>   DW_AT_byte_size   : 4
    <b07>   DW_AT_type        : <0x4e3>
 <1><b0b>: Abbrev Number: 24 (DW_TAG_array_type)
    <b0c>   DW_AT_type        : <0xb1b>
    <b10>   DW_AT_sibling     : <0xb1b>
 <2><b14>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <b15>   DW_AT_type        : <0x99>
    <b19>   DW_AT_upper_bound : 6
 <2><b1a>: Abbrev Number: 0
 <1><b1b>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <b1c>   DW_AT_byte_size   : 4
    <b1c>   DW_AT_type        : <0x940>
 <1><b20>: Abbrev Number: 24 (DW_TAG_array_type)
    <b21>   DW_AT_type        : <0xa14>
    <b25>   DW_AT_sibling     : <0xb30>
 <2><b29>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <b2a>   DW_AT_type        : <0x99>
    <b2e>   DW_AT_upper_bound : 3
 <2><b2f>: Abbrev Number: 0
 <1><b30>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <b31>   DW_AT_type        : <0xb20>
 <1><b35>: Abbrev Number: 14 (DW_TAG_typedef)
    <b36>   DW_AT_name        : (indirect string, offset: 0x42a65): TIM_HandleTypeDef
    <b3a>   DW_AT_decl_file   : 12
    <b3b>   DW_AT_decl_line   : 380
    <b3d>   DW_AT_decl_column : 3
    <b3d>   DW_AT_type        : <0xa7e>
 <1><b41>: Abbrev Number: 17 (DW_TAG_structure_type)
    <b42>   DW_AT_byte_size   : 28
    <b43>   DW_AT_decl_file   : 13
    <b44>   DW_AT_decl_line   : 46
    <b45>   DW_AT_decl_column : 9
    <b45>   DW_AT_sibling     : <0xba5>
 <2><b49>: Abbrev Number: 1 (DW_TAG_member)
    <b4a>   DW_AT_name        : (indirect string, offset: 0xb0c59): BaudRate
    <b4e>   DW_AT_decl_file   : 13
    <b4f>   DW_AT_decl_line   : 48
    <b50>   DW_AT_decl_column : 12
    <b51>   DW_AT_type        : <0xc2>
    <b55>   DW_AT_data_member_location: 0
 <2><b56>: Abbrev Number: 1 (DW_TAG_member)
    <b57>   DW_AT_name        : (indirect string, offset: 0x50d59): WordLength
    <b5b>   DW_AT_decl_file   : 13
    <b5c>   DW_AT_decl_line   : 54
    <b5d>   DW_AT_decl_column : 12
    <b5e>   DW_AT_type        : <0xc2>
    <b62>   DW_AT_data_member_location: 4
 <2><b63>: Abbrev Number: 1 (DW_TAG_member)
    <b64>   DW_AT_name        : (indirect string, offset: 0xb104b): StopBits
    <b68>   DW_AT_decl_file   : 13
    <b69>   DW_AT_decl_line   : 57
    <b6a>   DW_AT_decl_column : 12
    <b6b>   DW_AT_type        : <0xc2>
    <b6f>   DW_AT_data_member_location: 8
 <2><b70>: Abbrev Number: 1 (DW_TAG_member)
    <b71>   DW_AT_name        : (indirect string, offset: 0x45c11): Parity
    <b75>   DW_AT_decl_file   : 13
    <b76>   DW_AT_decl_line   : 60
    <b77>   DW_AT_decl_column : 12
    <b78>   DW_AT_type        : <0xc2>
    <b7c>   DW_AT_data_member_location: 12
 <2><b7d>: Abbrev Number: 1 (DW_TAG_member)
    <b7e>   DW_AT_name        : (indirect string, offset: 0xc5902): Mode
    <b82>   DW_AT_decl_file   : 13
    <b83>   DW_AT_decl_line   : 67
    <b84>   DW_AT_decl_column : 12
    <b85>   DW_AT_type        : <0xc2>
    <b89>   DW_AT_data_member_location: 16
 <2><b8a>: Abbrev Number: 1 (DW_TAG_member)
    <b8b>   DW_AT_name        : (indirect string, offset: 0x167de): HwFlowCtl
    <b8f>   DW_AT_decl_file   : 13
    <b90>   DW_AT_decl_line   : 70
    <b91>   DW_AT_decl_column : 12
    <b92>   DW_AT_type        : <0xc2>
    <b96>   DW_AT_data_member_location: 20
 <2><b97>: Abbrev Number: 1 (DW_TAG_member)
    <b98>   DW_AT_name        : (indirect string, offset: 0xa1e3a): OverSampling
    <b9c>   DW_AT_decl_file   : 13
    <b9d>   DW_AT_decl_line   : 73
    <b9e>   DW_AT_decl_column : 12
    <b9f>   DW_AT_type        : <0xc2>
    <ba3>   DW_AT_data_member_location: 24
 <2><ba4>: Abbrev Number: 0
 <1><ba5>: Abbrev Number: 6 (DW_TAG_typedef)
    <ba6>   DW_AT_name        : (indirect string, offset: 0x36c48): UART_InitTypeDef
    <baa>   DW_AT_decl_file   : 13
    <bab>   DW_AT_decl_line   : 75
    <bac>   DW_AT_decl_column : 3
    <bad>   DW_AT_type        : <0xb41>
 <1><bb1>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <bb2>   DW_AT_encoding    : 7	(unsigned)
    <bb3>   DW_AT_byte_size   : 1
    <bb4>   DW_AT_type        : <0x44>
    <bb8>   DW_AT_decl_file   : 13
    <bb9>   DW_AT_decl_line   : 117
    <bba>   DW_AT_decl_column : 1
    <bbb>   DW_AT_sibling     : <0xbf0>
 <2><bbf>: Abbrev Number: 2 (DW_TAG_enumerator)
    <bc0>   DW_AT_name        : (indirect string, offset: 0x7156c): HAL_UART_STATE_RESET
    <bc4>   DW_AT_const_value : 0
 <2><bc5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <bc6>   DW_AT_name        : (indirect string, offset: 0x5dbb7): HAL_UART_STATE_READY
    <bca>   DW_AT_const_value : 32
 <2><bcb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <bcc>   DW_AT_name        : (indirect string, offset: 0xab01e): HAL_UART_STATE_BUSY
    <bd0>   DW_AT_const_value : 36
 <2><bd1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <bd2>   DW_AT_name        : (indirect string, offset: 0x2305): HAL_UART_STATE_BUSY_TX
    <bd6>   DW_AT_const_value : 33
 <2><bd7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <bd8>   DW_AT_name        : (indirect string, offset: 0x16f9): HAL_UART_STATE_BUSY_RX
    <bdc>   DW_AT_const_value : 34
 <2><bdd>: Abbrev Number: 2 (DW_TAG_enumerator)
    <bde>   DW_AT_name        : (indirect string, offset: 0x2bed3): HAL_UART_STATE_BUSY_TX_RX
    <be2>   DW_AT_const_value : 35
 <2><be3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <be4>   DW_AT_name        : (indirect string, offset: 0x5da4f): HAL_UART_STATE_TIMEOUT
    <be8>   DW_AT_const_value : 160
 <2><be9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <bea>   DW_AT_name        : (indirect string, offset: 0x7a3c8): HAL_UART_STATE_ERROR
    <bee>   DW_AT_const_value : 224
 <2><bef>: Abbrev Number: 0
 <1><bf0>: Abbrev Number: 6 (DW_TAG_typedef)
    <bf1>   DW_AT_name        : (indirect string, offset: 0x3b678): HAL_UART_StateTypeDef
    <bf5>   DW_AT_decl_file   : 13
    <bf6>   DW_AT_decl_line   : 135
    <bf7>   DW_AT_decl_column : 3
    <bf8>   DW_AT_type        : <0xbb1>
 <1><bfc>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <bfd>   DW_AT_type        : <0xbf0>
 <1><c01>: Abbrev Number: 6 (DW_TAG_typedef)
    <c02>   DW_AT_name        : (indirect string, offset: 0x4f4b7): HAL_UART_RxTypeTypeDef
    <c06>   DW_AT_decl_file   : 13
    <c07>   DW_AT_decl_line   : 144
    <c08>   DW_AT_decl_column : 18
    <c09>   DW_AT_type        : <0xc2>
 <1><c0d>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <c0e>   DW_AT_type        : <0xc01>
 <1><c12>: Abbrev Number: 6 (DW_TAG_typedef)
    <c13>   DW_AT_name        : (indirect string, offset: 0x18992): HAL_UART_RxEventTypeTypeDef
    <c17>   DW_AT_decl_file   : 13
    <c18>   DW_AT_decl_line   : 155
    <c19>   DW_AT_decl_column : 18
    <c1a>   DW_AT_type        : <0xc2>
 <1><c1e>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <c1f>   DW_AT_type        : <0xc12>
 <1><c23>: Abbrev Number: 31 (DW_TAG_structure_type)
    <c24>   DW_AT_name        : (indirect string, offset: 0x6fac9): __UART_HandleTypeDef
    <c28>   DW_AT_byte_size   : 72
    <c29>   DW_AT_decl_file   : 13
    <c2a>   DW_AT_decl_line   : 160
    <c2b>   DW_AT_decl_column : 16
    <c2b>   DW_AT_sibling     : <0xd00>
 <2><c2f>: Abbrev Number: 1 (DW_TAG_member)
    <c30>   DW_AT_name        : (indirect string, offset: 0xbae4a): Instance
    <c34>   DW_AT_decl_file   : 13
    <c35>   DW_AT_decl_line   : 162
    <c36>   DW_AT_decl_column : 34
    <c37>   DW_AT_type        : <0xd00>
    <c3b>   DW_AT_data_member_location: 0
 <2><c3c>: Abbrev Number: 1 (DW_TAG_member)
    <c3d>   DW_AT_name        : (indirect string, offset: 0x9ecb3): Init
    <c41>   DW_AT_decl_file   : 13
    <c42>   DW_AT_decl_line   : 164
    <c43>   DW_AT_decl_column : 33
    <c44>   DW_AT_type        : <0xba5>
    <c48>   DW_AT_data_member_location: 4
 <2><c49>: Abbrev Number: 1 (DW_TAG_member)
    <c4a>   DW_AT_name        : (indirect string, offset: 0x5c5ab): pTxBuffPtr
    <c4e>   DW_AT_decl_file   : 13
    <c4f>   DW_AT_decl_line   : 166
    <c50>   DW_AT_decl_column : 34
    <c51>   DW_AT_type        : <0xd05>
    <c55>   DW_AT_data_member_location: 32
 <2><c56>: Abbrev Number: 1 (DW_TAG_member)
    <c57>   DW_AT_name        : (indirect string, offset: 0x518f9): TxXferSize
    <c5b>   DW_AT_decl_file   : 13
    <c5c>   DW_AT_decl_line   : 168
    <c5d>   DW_AT_decl_column : 33
    <c5e>   DW_AT_type        : <0xb1>
    <c62>   DW_AT_data_member_location: 36
 <2><c63>: Abbrev Number: 1 (DW_TAG_member)
    <c64>   DW_AT_name        : (indirect string, offset: 0x5d8e6): TxXferCount
    <c68>   DW_AT_decl_file   : 13
    <c69>   DW_AT_decl_line   : 170
    <c6a>   DW_AT_decl_column : 33
    <c6b>   DW_AT_type        : <0xbd>
    <c6f>   DW_AT_data_member_location: 38
 <2><c70>: Abbrev Number: 1 (DW_TAG_member)
    <c71>   DW_AT_name        : (indirect string, offset: 0xb391b): pRxBuffPtr
    <c75>   DW_AT_decl_file   : 13
    <c76>   DW_AT_decl_line   : 172
    <c77>   DW_AT_decl_column : 34
    <c78>   DW_AT_type        : <0xd0a>
    <c7c>   DW_AT_data_member_location: 40
 <2><c7d>: Abbrev Number: 1 (DW_TAG_member)
    <c7e>   DW_AT_name        : (indirect string, offset: 0x5ffa2): RxXferSize
    <c82>   DW_AT_decl_file   : 13
    <c83>   DW_AT_decl_line   : 174
    <c84>   DW_AT_decl_column : 33
    <c85>   DW_AT_type        : <0xb1>
    <c89>   DW_AT_data_member_location: 44
 <2><c8a>: Abbrev Number: 1 (DW_TAG_member)
    <c8b>   DW_AT_name        : (indirect string, offset: 0x73e89): RxXferCount
    <c8f>   DW_AT_decl_file   : 13
    <c90>   DW_AT_decl_line   : 176
    <c91>   DW_AT_decl_column : 33
    <c92>   DW_AT_type        : <0xbd>
    <c96>   DW_AT_data_member_location: 46
 <2><c97>: Abbrev Number: 1 (DW_TAG_member)
    <c98>   DW_AT_name        : (indirect string, offset: 0x96d3f): ReceptionType
    <c9c>   DW_AT_decl_file   : 13
    <c9d>   DW_AT_decl_line   : 178
    <c9e>   DW_AT_decl_column : 31
    <c9f>   DW_AT_type        : <0xc0d>
    <ca3>   DW_AT_data_member_location: 48
 <2><ca4>: Abbrev Number: 1 (DW_TAG_member)
    <ca5>   DW_AT_name        : (indirect string, offset: 0xc67e7): RxEventType
    <ca9>   DW_AT_decl_file   : 13
    <caa>   DW_AT_decl_line   : 180
    <cab>   DW_AT_decl_column : 36
    <cac>   DW_AT_type        : <0xc1e>
    <cb0>   DW_AT_data_member_location: 52
 <2><cb1>: Abbrev Number: 1 (DW_TAG_member)
    <cb2>   DW_AT_name        : (indirect string, offset: 0xbc45c): hdmatx
    <cb6>   DW_AT_decl_file   : 13
    <cb7>   DW_AT_decl_line   : 182
    <cb8>   DW_AT_decl_column : 34
    <cb9>   DW_AT_type        : <0xb1b>
    <cbd>   DW_AT_data_member_location: 56
 <2><cbe>: Abbrev Number: 1 (DW_TAG_member)
    <cbf>   DW_AT_name        : (indirect string, offset: 0xbb786): hdmarx
    <cc3>   DW_AT_decl_file   : 13
    <cc4>   DW_AT_decl_line   : 184
    <cc5>   DW_AT_decl_column : 34
    <cc6>   DW_AT_type        : <0xb1b>
    <cca>   DW_AT_data_member_location: 60
 <2><ccb>: Abbrev Number: 1 (DW_TAG_member)
    <ccc>   DW_AT_name        : (indirect string, offset: 0x89444): Lock
    <cd0>   DW_AT_decl_file   : 13
    <cd1>   DW_AT_decl_line   : 186
    <cd2>   DW_AT_decl_column : 33
    <cd3>   DW_AT_type        : <0x5ba>
    <cd7>   DW_AT_data_member_location: 64
 <2><cd8>: Abbrev Number: 1 (DW_TAG_member)
    <cd9>   DW_AT_name        : (indirect string, offset: 0x4eb17): gState
    <cdd>   DW_AT_decl_file   : 13
    <cde>   DW_AT_decl_line   : 188
    <cdf>   DW_AT_decl_column : 33
    <ce0>   DW_AT_type        : <0xbfc>
    <ce4>   DW_AT_data_member_location: 65
 <2><ce5>: Abbrev Number: 1 (DW_TAG_member)
    <ce6>   DW_AT_name        : (indirect string, offset: 0x5965): RxState
    <cea>   DW_AT_decl_file   : 13
    <ceb>   DW_AT_decl_line   : 192
    <cec>   DW_AT_decl_column : 33
    <ced>   DW_AT_type        : <0xbfc>
    <cf1>   DW_AT_data_member_location: 66
 <2><cf2>: Abbrev Number: 1 (DW_TAG_member)
    <cf3>   DW_AT_name        : (indirect string, offset: 0xbd038): ErrorCode
    <cf7>   DW_AT_decl_file   : 13
    <cf8>   DW_AT_decl_line   : 195
    <cf9>   DW_AT_decl_column : 33
    <cfa>   DW_AT_type        : <0xce>
    <cfe>   DW_AT_data_member_location: 68
 <2><cff>: Abbrev Number: 0
 <1><d00>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <d01>   DW_AT_byte_size   : 4
    <d01>   DW_AT_type        : <0x54d>
 <1><d05>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <d06>   DW_AT_byte_size   : 4
    <d06>   DW_AT_type        : <0xac>
 <1><d0a>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <d0b>   DW_AT_byte_size   : 4
    <d0b>   DW_AT_type        : <0xa0>
 <1><d0f>: Abbrev Number: 6 (DW_TAG_typedef)
    <d10>   DW_AT_name        : (indirect string, offset: 0x6facb): UART_HandleTypeDef
    <d14>   DW_AT_decl_file   : 13
    <d15>   DW_AT_decl_line   : 213
    <d16>   DW_AT_decl_column : 3
    <d17>   DW_AT_type        : <0xc23>
 <1><d1b>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <d1c>   DW_AT_byte_size   : 4
    <d1c>   DW_AT_type        : <0xd20>
 <1><d20>: Abbrev Number: 36 (DW_TAG_subroutine_type)
    <d21>   DW_AT_prototyped  : 1
    <d21>   DW_AT_sibling     : <0xd2b>
 <2><d25>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <d26>   DW_AT_type        : <0x929>
 <2><d2a>: Abbrev Number: 0
 <1><d2b>: Abbrev Number: 6 (DW_TAG_typedef)
    <d2c>   DW_AT_name        : (indirect string, offset: 0x6a27c): StackType_t
    <d30>   DW_AT_decl_file   : 14
    <d31>   DW_AT_decl_line   : 55
    <d32>   DW_AT_decl_column : 24
    <d33>   DW_AT_type        : <0xc2>
 <1><d37>: Abbrev Number: 6 (DW_TAG_typedef)
    <d38>   DW_AT_name        : (indirect string, offset: 0x1536): UBaseType_t
    <d3c>   DW_AT_decl_file   : 14
    <d3d>   DW_AT_decl_line   : 57
    <d3e>   DW_AT_decl_column : 23
    <d3f>   DW_AT_type        : <0x78>
 <1><d43>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <d44>   DW_AT_type        : <0xd37>
 <1><d48>: Abbrev Number: 18 (DW_TAG_const_type)
    <d49>   DW_AT_type        : <0xd37>
 <1><d4d>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <d4e>   DW_AT_byte_size   : 4
    <d4e>   DW_AT_type        : <0xd52>
 <1><d52>: Abbrev Number: 16 (DW_TAG_base_type)
    <d53>   DW_AT_byte_size   : 1
    <d54>   DW_AT_encoding    : 8	(unsigned char)
    <d55>   DW_AT_name        : (indirect string, offset: 0x3ef92): char
 <1><d59>: Abbrev Number: 18 (DW_TAG_const_type)
    <d5a>   DW_AT_type        : <0xd52>
 <1><d5e>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <d5f>   DW_AT_byte_size   : 4
    <d5f>   DW_AT_type        : <0xd59>
 <1><d63>: Abbrev Number: 6 (DW_TAG_typedef)
    <d64>   DW_AT_name        : (indirect string, offset: 0x96255): TaskHandle_t
    <d68>   DW_AT_decl_file   : 15
    <d69>   DW_AT_decl_line   : 70
    <d6a>   DW_AT_decl_column : 37
    <d6b>   DW_AT_type        : <0xd6f>
 <1><d6f>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <d70>   DW_AT_byte_size   : 4
    <d70>   DW_AT_type        : <0xd74>
 <1><d74>: Abbrev Number: 46 (DW_TAG_structure_type)
    <d75>   DW_AT_name        : (indirect string, offset: 0xa3db6): tskTaskControlBlock
    <d79>   DW_AT_declaration : 1
 <1><d79>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <d7a>   DW_AT_encoding    : 7	(unsigned)
    <d7b>   DW_AT_byte_size   : 1
    <d7c>   DW_AT_type        : <0x44>
    <d80>   DW_AT_decl_file   : 15
    <d81>   DW_AT_decl_line   : 80
    <d82>   DW_AT_decl_column : 1
    <d83>   DW_AT_sibling     : <0xdac>
 <2><d87>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d88>   DW_AT_name        : (indirect string, offset: 0x57a62): eRunning
    <d8c>   DW_AT_const_value : 0
 <2><d8d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d8e>   DW_AT_name        : (indirect string, offset: 0x4b898): eReady
    <d92>   DW_AT_const_value : 1
 <2><d93>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d94>   DW_AT_name        : (indirect string, offset: 0x41d89): eBlocked
    <d98>   DW_AT_const_value : 2
 <2><d99>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d9a>   DW_AT_name        : (indirect string, offset: 0x6ff91): eSuspended
    <d9e>   DW_AT_const_value : 3
 <2><d9f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <da0>   DW_AT_name        : (indirect string, offset: 0x8e48f): eDeleted
    <da4>   DW_AT_const_value : 4
 <2><da5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <da6>   DW_AT_name        : (indirect string, offset: 0x1fa15): eInvalid
    <daa>   DW_AT_const_value : 5
 <2><dab>: Abbrev Number: 0
 <1><dac>: Abbrev Number: 6 (DW_TAG_typedef)
    <dad>   DW_AT_name        : (indirect string, offset: 0x4300): eTaskState
    <db1>   DW_AT_decl_file   : 15
    <db2>   DW_AT_decl_line   : 87
    <db3>   DW_AT_decl_column : 3
    <db4>   DW_AT_type        : <0xd79>
 <1><db8>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <db9>   DW_AT_byte_size   : 4
    <db9>   DW_AT_type        : <0xd2b>
 <1><dbd>: Abbrev Number: 31 (DW_TAG_structure_type)
    <dbe>   DW_AT_name        : (indirect string, offset: 0x85394): xTASK_STATUS
    <dc2>   DW_AT_byte_size   : 36
    <dc3>   DW_AT_decl_file   : 15
    <dc4>   DW_AT_decl_line   : 137
    <dc5>   DW_AT_decl_column : 16
    <dc5>   DW_AT_sibling     : <0xe3f>
 <2><dc9>: Abbrev Number: 1 (DW_TAG_member)
    <dca>   DW_AT_name        : (indirect string, offset: 0x7edde): xHandle
    <dce>   DW_AT_decl_file   : 15
    <dcf>   DW_AT_decl_line   : 139
    <dd0>   DW_AT_decl_column : 15
    <dd1>   DW_AT_type        : <0xd63>
    <dd5>   DW_AT_data_member_location: 0
 <2><dd6>: Abbrev Number: 1 (DW_TAG_member)
    <dd7>   DW_AT_name        : (indirect string, offset: 0x427c7): pcTaskName
    <ddb>   DW_AT_decl_file   : 15
    <ddc>   DW_AT_decl_line   : 140
    <ddd>   DW_AT_decl_column : 14
    <dde>   DW_AT_type        : <0xd5e>
    <de2>   DW_AT_data_member_location: 4
 <2><de3>: Abbrev Number: 1 (DW_TAG_member)
    <de4>   DW_AT_name        : (indirect string, offset: 0xcaf7c): xTaskNumber
    <de8>   DW_AT_decl_file   : 15
    <de9>   DW_AT_decl_line   : 141
    <dea>   DW_AT_decl_column : 14
    <deb>   DW_AT_type        : <0xd37>
    <def>   DW_AT_data_member_location: 8
 <2><df0>: Abbrev Number: 1 (DW_TAG_member)
    <df1>   DW_AT_name        : (indirect string, offset: 0x1b88): eCurrentState
    <df5>   DW_AT_decl_file   : 15
    <df6>   DW_AT_decl_line   : 142
    <df7>   DW_AT_decl_column : 13
    <df8>   DW_AT_type        : <0xdac>
    <dfc>   DW_AT_data_member_location: 12
 <2><dfd>: Abbrev Number: 1 (DW_TAG_member)
    <dfe>   DW_AT_name        : (indirect string, offset: 0x8fd0): uxCurrentPriority
    <e02>   DW_AT_decl_file   : 15
    <e03>   DW_AT_decl_line   : 143
    <e04>   DW_AT_decl_column : 14
    <e05>   DW_AT_type        : <0xd37>
    <e09>   DW_AT_data_member_location: 16
 <2><e0a>: Abbrev Number: 1 (DW_TAG_member)
    <e0b>   DW_AT_name        : (indirect string, offset: 0x7780a): uxBasePriority
    <e0f>   DW_AT_decl_file   : 15
    <e10>   DW_AT_decl_line   : 144
    <e11>   DW_AT_decl_column : 14
    <e12>   DW_AT_type        : <0xd37>
    <e16>   DW_AT_data_member_location: 20
 <2><e17>: Abbrev Number: 1 (DW_TAG_member)
    <e18>   DW_AT_name        : (indirect string, offset: 0x844f9): ulRunTimeCounter
    <e1c>   DW_AT_decl_file   : 15
    <e1d>   DW_AT_decl_line   : 145
    <e1e>   DW_AT_decl_column : 11
    <e1f>   DW_AT_type        : <0xc2>
    <e23>   DW_AT_data_member_location: 24
 <2><e24>: Abbrev Number: 1 (DW_TAG_member)
    <e25>   DW_AT_name        : (indirect string, offset: 0x5d337): pxStackBase
    <e29>   DW_AT_decl_file   : 15
    <e2a>   DW_AT_decl_line   : 146
    <e2b>   DW_AT_decl_column : 15
    <e2c>   DW_AT_type        : <0xdb8>
    <e30>   DW_AT_data_member_location: 28
 <2><e31>: Abbrev Number: 1 (DW_TAG_member)
    <e32>   DW_AT_name        : (indirect string, offset: 0x3fc4b): usStackHighWaterMark
    <e36>   DW_AT_decl_file   : 15
    <e37>   DW_AT_decl_line   : 147
    <e38>   DW_AT_decl_column : 25
    <e39>   DW_AT_type        : <0xb1>
    <e3d>   DW_AT_data_member_location: 32
 <2><e3e>: Abbrev Number: 0
 <1><e3f>: Abbrev Number: 6 (DW_TAG_typedef)
    <e40>   DW_AT_name        : (indirect string, offset: 0x5b703): TaskStatus_t
    <e44>   DW_AT_decl_file   : 15
    <e45>   DW_AT_decl_line   : 148
    <e46>   DW_AT_decl_column : 3
    <e47>   DW_AT_type        : <0xdbd>
 <1><e4b>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <e4c>   DW_AT_encoding    : 5	(signed)
    <e4d>   DW_AT_byte_size   : 4
    <e4e>   DW_AT_type        : <0x92>
    <e52>   DW_AT_decl_file   : 16
    <e53>   DW_AT_decl_line   : 82
    <e54>   DW_AT_decl_column : 14
    <e55>   DW_AT_sibling     : <0xf97>
 <2><e59>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e5a>   DW_AT_name        : (indirect string, offset: 0x39d63): osPriorityNone
    <e5e>   DW_AT_const_value : 0
 <2><e5f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e60>   DW_AT_name        : (indirect string, offset: 0xa7774): osPriorityIdle
    <e64>   DW_AT_const_value : 1
 <2><e65>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e66>   DW_AT_name        : (indirect string, offset: 0xb21cd): osPriorityLow
    <e6a>   DW_AT_const_value : 8
 <2><e6b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e6c>   DW_AT_name        : (indirect string, offset: 0xb7710): osPriorityLow1
    <e70>   DW_AT_const_value : 9
 <2><e71>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e72>   DW_AT_name        : (indirect string, offset: 0xb771f): osPriorityLow2
    <e76>   DW_AT_const_value : 10
 <2><e77>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e78>   DW_AT_name        : (indirect string, offset: 0xb772e): osPriorityLow3
    <e7c>   DW_AT_const_value : 11
 <2><e7d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e7e>   DW_AT_name        : (indirect string, offset: 0xb773d): osPriorityLow4
    <e82>   DW_AT_const_value : 12
 <2><e83>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e84>   DW_AT_name        : (indirect string, offset: 0xb774c): osPriorityLow5
    <e88>   DW_AT_const_value : 13
 <2><e89>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e8a>   DW_AT_name        : (indirect string, offset: 0xb775b): osPriorityLow6
    <e8e>   DW_AT_const_value : 14
 <2><e8f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e90>   DW_AT_name        : (indirect string, offset: 0xb776a): osPriorityLow7
    <e94>   DW_AT_const_value : 15
 <2><e95>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e96>   DW_AT_name        : (indirect string, offset: 0xb9d13): osPriorityBelowNormal
    <e9a>   DW_AT_const_value : 16
 <2><e9b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e9c>   DW_AT_name        : (indirect string, offset: 0x831b5): osPriorityBelowNormal1
    <ea0>   DW_AT_const_value : 17
 <2><ea1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ea2>   DW_AT_name        : (indirect string, offset: 0xa384b): osPriorityBelowNormal2
    <ea6>   DW_AT_const_value : 18
 <2><ea7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ea8>   DW_AT_name        : (indirect string, offset: 0x73cfb): osPriorityBelowNormal3
    <eac>   DW_AT_const_value : 19
 <2><ead>: Abbrev Number: 2 (DW_TAG_enumerator)
    <eae>   DW_AT_name        : (indirect string, offset: 0xa3884): osPriorityBelowNormal4
    <eb2>   DW_AT_const_value : 20
 <2><eb3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <eb4>   DW_AT_name        : (indirect string, offset: 0xa389b): osPriorityBelowNormal5
    <eb8>   DW_AT_const_value : 21
 <2><eb9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <eba>   DW_AT_name        : (indirect string, offset: 0xa38b2): osPriorityBelowNormal6
    <ebe>   DW_AT_const_value : 22
 <2><ebf>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ec0>   DW_AT_name        : (indirect string, offset: 0xa38c9): osPriorityBelowNormal7
    <ec4>   DW_AT_const_value : 23
 <2><ec5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ec6>   DW_AT_name        : (indirect string, offset: 0x9d34a): osPriorityNormal
    <eca>   DW_AT_const_value : 24
 <2><ecb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ecc>   DW_AT_name        : (indirect string, offset: 0x1f7a0): osPriorityNormal1
    <ed0>   DW_AT_const_value : 25
 <2><ed1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ed2>   DW_AT_name        : (indirect string, offset: 0x1f7b2): osPriorityNormal2
    <ed6>   DW_AT_const_value : 26
 <2><ed7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ed8>   DW_AT_name        : (indirect string, offset: 0x1f7c4): osPriorityNormal3
    <edc>   DW_AT_const_value : 27
 <2><edd>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ede>   DW_AT_name        : (indirect string, offset: 0x1f7d6): osPriorityNormal4
    <ee2>   DW_AT_const_value : 28
 <2><ee3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ee4>   DW_AT_name        : (indirect string, offset: 0x924e5): osPriorityNormal5
    <ee8>   DW_AT_const_value : 29
 <2><ee9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <eea>   DW_AT_name        : (indirect string, offset: 0x1f806): osPriorityNormal6
    <eee>   DW_AT_const_value : 30
 <2><eef>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ef0>   DW_AT_name        : (indirect string, offset: 0x1f818): osPriorityNormal7
    <ef4>   DW_AT_const_value : 31
 <2><ef5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ef6>   DW_AT_name        : (indirect string, offset: 0x7b784): osPriorityAboveNormal
    <efa>   DW_AT_const_value : 32
 <2><efb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <efc>   DW_AT_name        : (indirect string, offset: 0xc0dc3): osPriorityAboveNormal1
    <f00>   DW_AT_const_value : 33
 <2><f01>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f02>   DW_AT_name        : (indirect string, offset: 0xc0dda): osPriorityAboveNormal2
    <f06>   DW_AT_const_value : 34
 <2><f07>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f08>   DW_AT_name        : (indirect string, offset: 0xc0df1): osPriorityAboveNormal3
    <f0c>   DW_AT_const_value : 35
 <2><f0d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f0e>   DW_AT_name        : (indirect string, offset: 0xc0e08): osPriorityAboveNormal4
    <f12>   DW_AT_const_value : 36
 <2><f13>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f14>   DW_AT_name        : (indirect string, offset: 0xaae94): osPriorityAboveNormal5
    <f18>   DW_AT_const_value : 37
 <2><f19>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f1a>   DW_AT_name        : (indirect string, offset: 0xc0e35): osPriorityAboveNormal6
    <f1e>   DW_AT_const_value : 38
 <2><f1f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f20>   DW_AT_name        : (indirect string, offset: 0xc0e4c): osPriorityAboveNormal7
    <f24>   DW_AT_const_value : 39
 <2><f25>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f26>   DW_AT_name        : (indirect string, offset: 0x25f7a): osPriorityHigh
    <f2a>   DW_AT_const_value : 40
 <2><f2b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f2c>   DW_AT_name        : (indirect string, offset: 0x7f8aa): osPriorityHigh1
    <f30>   DW_AT_const_value : 41
 <2><f31>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f32>   DW_AT_name        : (indirect string, offset: 0x7f8ba): osPriorityHigh2
    <f36>   DW_AT_const_value : 42
 <2><f37>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f38>   DW_AT_name        : (indirect string, offset: 0x7f8ca): osPriorityHigh3
    <f3c>   DW_AT_const_value : 43
 <2><f3d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f3e>   DW_AT_name        : (indirect string, offset: 0x7f8da): osPriorityHigh4
    <f42>   DW_AT_const_value : 44
 <2><f43>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f44>   DW_AT_name        : (indirect string, offset: 0x3a97): osPriorityHigh5
    <f48>   DW_AT_const_value : 45
 <2><f49>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f4a>   DW_AT_name        : (indirect string, offset: 0x7f916): osPriorityHigh6
    <f4e>   DW_AT_const_value : 46
 <2><f4f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f50>   DW_AT_name        : (indirect string, offset: 0x7f926): osPriorityHigh7
    <f54>   DW_AT_const_value : 47
 <2><f55>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f56>   DW_AT_name        : (indirect string, offset: 0xaf39c): osPriorityRealtime
    <f5a>   DW_AT_const_value : 48
 <2><f5b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f5c>   DW_AT_name        : (indirect string, offset: 0x78da4): osPriorityRealtime1
    <f60>   DW_AT_const_value : 49
 <2><f61>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f62>   DW_AT_name        : (indirect string, offset: 0x78db8): osPriorityRealtime2
    <f66>   DW_AT_const_value : 50
 <2><f67>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f68>   DW_AT_name        : (indirect string, offset: 0x78dcc): osPriorityRealtime3
    <f6c>   DW_AT_const_value : 51
 <2><f6d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f6e>   DW_AT_name        : (indirect string, offset: 0x78de0): osPriorityRealtime4
    <f72>   DW_AT_const_value : 52
 <2><f73>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f74>   DW_AT_name        : (indirect string, offset: 0x78df4): osPriorityRealtime5
    <f78>   DW_AT_const_value : 53
 <2><f79>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f7a>   DW_AT_name        : (indirect string, offset: 0x78e08): osPriorityRealtime6
    <f7e>   DW_AT_const_value : 54
 <2><f7f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f80>   DW_AT_name        : (indirect string, offset: 0x78e1c): osPriorityRealtime7
    <f84>   DW_AT_const_value : 55
 <2><f85>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f86>   DW_AT_name        : (indirect string, offset: 0x6b9f4): osPriorityISR
    <f8a>   DW_AT_const_value : 56
 <2><f8b>: Abbrev Number: 21 (DW_TAG_enumerator)
    <f8c>   DW_AT_name        : (indirect string, offset: 0xaab2f): osPriorityError
    <f90>   DW_AT_const_value : -1
 <2><f91>: Abbrev Number: 37 (DW_TAG_enumerator)
    <f92>   DW_AT_name        : (indirect string, offset: 0xb7d7d): osPriorityReserved
    <f96>   DW_AT_const_value : 2147483647
 <2><f96>: Abbrev Number: 0
 <1><f97>: Abbrev Number: 6 (DW_TAG_typedef)
    <f98>   DW_AT_name        : (indirect string, offset: 0x8e0db): osPriority_t
    <f9c>   DW_AT_decl_file   : 16
    <f9d>   DW_AT_decl_line   : 136
    <f9e>   DW_AT_decl_column : 3
    <f9f>   DW_AT_type        : <0xe4b>
 <1><fa3>: Abbrev Number: 6 (DW_TAG_typedef)
    <fa4>   DW_AT_name        : (indirect string, offset: 0x6856f): osThreadFunc_t
    <fa8>   DW_AT_decl_file   : 16
    <fa9>   DW_AT_decl_line   : 139
    <faa>   DW_AT_decl_column : 16
    <fab>   DW_AT_type        : <0xd1b>
 <1><faf>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <fb0>   DW_AT_encoding    : 5	(signed)
    <fb1>   DW_AT_byte_size   : 4
    <fb2>   DW_AT_type        : <0x92>
    <fb6>   DW_AT_decl_file   : 16
    <fb7>   DW_AT_decl_line   : 176
    <fb8>   DW_AT_decl_column : 14
    <fb9>   DW_AT_sibling     : <0xfed>
 <2><fbd>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fbe>   DW_AT_name        : (indirect string, offset: 0x94a3c): osOK
    <fc2>   DW_AT_const_value : 0
 <2><fc3>: Abbrev Number: 21 (DW_TAG_enumerator)
    <fc4>   DW_AT_name        : (indirect string, offset: 0x592e2): osError
    <fc8>   DW_AT_const_value : -1
 <2><fc9>: Abbrev Number: 21 (DW_TAG_enumerator)
    <fca>   DW_AT_name        : (indirect string, offset: 0x1c28a): osErrorTimeout
    <fce>   DW_AT_const_value : -2
 <2><fcf>: Abbrev Number: 21 (DW_TAG_enumerator)
    <fd0>   DW_AT_name        : (indirect string, offset: 0x7dc34): osErrorResource
    <fd4>   DW_AT_const_value : -3
 <2><fd5>: Abbrev Number: 21 (DW_TAG_enumerator)
    <fd6>   DW_AT_name        : (indirect string, offset: 0x32bb0): osErrorParameter
    <fda>   DW_AT_const_value : -4
 <2><fdb>: Abbrev Number: 21 (DW_TAG_enumerator)
    <fdc>   DW_AT_name        : (indirect string, offset: 0x2213e): osErrorNoMemory
    <fe0>   DW_AT_const_value : -5
 <2><fe1>: Abbrev Number: 21 (DW_TAG_enumerator)
    <fe2>   DW_AT_name        : (indirect string, offset: 0x348d5): osErrorISR
    <fe6>   DW_AT_const_value : -6
 <2><fe7>: Abbrev Number: 37 (DW_TAG_enumerator)
    <fe8>   DW_AT_name        : (indirect string, offset: 0x6147c): osStatusReserved
    <fec>   DW_AT_const_value : 2147483647
 <2><fec>: Abbrev Number: 0
 <1><fed>: Abbrev Number: 6 (DW_TAG_typedef)
    <fee>   DW_AT_name        : (indirect string, offset: 0x422ab): osStatus_t
    <ff2>   DW_AT_decl_file   : 16
    <ff3>   DW_AT_decl_line   : 185
    <ff4>   DW_AT_decl_column : 3
    <ff5>   DW_AT_type        : <0xfaf>
 <1><ff9>: Abbrev Number: 6 (DW_TAG_typedef)
    <ffa>   DW_AT_name        : (indirect string, offset: 0xa05d0): osThreadId_t
    <ffe>   DW_AT_decl_file   : 16
    <fff>   DW_AT_decl_line   : 189
    <1000>   DW_AT_decl_column : 15
    <1001>   DW_AT_type        : <0x929>
 <1><1005>: Abbrev Number: 6 (DW_TAG_typedef)
    <1006>   DW_AT_name        : (indirect string, offset: 0x1884a): osMutexId_t
    <100a>   DW_AT_decl_file   : 16
    <100b>   DW_AT_decl_line   : 198
    <100c>   DW_AT_decl_column : 15
    <100d>   DW_AT_type        : <0x929>
 <1><1011>: Abbrev Number: 6 (DW_TAG_typedef)
    <1012>   DW_AT_name        : (indirect string, offset: 0x941fb): osSemaphoreId_t
    <1016>   DW_AT_decl_file   : 16
    <1017>   DW_AT_decl_line   : 201
    <1018>   DW_AT_decl_column : 15
    <1019>   DW_AT_type        : <0x929>
 <1><101d>: Abbrev Number: 6 (DW_TAG_typedef)
    <101e>   DW_AT_name        : (indirect string, offset: 0x570b5): osMessageQueueId_t
    <1022>   DW_AT_decl_file   : 16
    <1023>   DW_AT_decl_line   : 207
    <1024>   DW_AT_decl_column : 15
    <1025>   DW_AT_type        : <0x929>
 <1><1029>: Abbrev Number: 6 (DW_TAG_typedef)
    <102a>   DW_AT_name        : (indirect string, offset: 0x8fc83): TZ_ModuleId_t
    <102e>   DW_AT_decl_file   : 16
    <102f>   DW_AT_decl_line   : 213
    <1030>   DW_AT_decl_column : 18
    <1031>   DW_AT_type        : <0xc2>
 <1><1035>: Abbrev Number: 17 (DW_TAG_structure_type)
    <1036>   DW_AT_byte_size   : 36
    <1037>   DW_AT_decl_file   : 16
    <1038>   DW_AT_decl_line   : 218
    <1039>   DW_AT_decl_column : 9
    <1039>   DW_AT_sibling     : <0x10b3>
 <2><103d>: Abbrev Number: 1 (DW_TAG_member)
    <103e>   DW_AT_name        : (indirect string, offset: 0x1660d): name
    <1042>   DW_AT_decl_file   : 16
    <1043>   DW_AT_decl_line   : 219
    <1044>   DW_AT_decl_column : 33
    <1045>   DW_AT_type        : <0xd5e>
    <1049>   DW_AT_data_member_location: 0
