Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x2b7a (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 45 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x2f92d): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -Og -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0xae615): ../Core/Src/main.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x2b3cf): /home/lth/src/stm32fun/stm32world_freertos/Debug
    <1a>   DW_AT_ranges      : 0x27
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 19 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 4	(float)
    <2d>   DW_AT_name        : (indirect string, offset: 0x29511): float
 <1><31>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <32>   DW_AT_encoding    : 5	(signed)
    <33>   DW_AT_byte_size   : 1
    <34>   DW_AT_type        : <0x244>
    <38>   DW_AT_decl_file   : 3
    <39>   DW_AT_decl_line   : 66
    <3a>   DW_AT_decl_column : 1
    <3b>   DW_AT_sibling     : <0x244>
 <2><3f>: Abbrev Number: 14 (DW_TAG_enumerator)

    <224>   DW_AT_const_value : 74
 <2><225>: Abbrev Number: 1 (DW_TAG_enumerator)
    <226>   DW_AT_name        : (indirect string, offset: 0x69102): OTG_HS_EP1_IN_IRQn
    <22a>   DW_AT_const_value : 75
 <2><22b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <22c>   DW_AT_name        : (indirect string, offset: 0x6e58e): OTG_HS_WKUP_IRQn
    <230>   DW_AT_const_value : 76
 <2><231>: Abbrev Number: 1 (DW_TAG_enumerator)
    <232>   DW_AT_name        : (indirect string, offset: 0x5041f): OTG_HS_IRQn
    <236>   DW_AT_const_value : 77
 <2><237>: Abbrev Number: 1 (DW_TAG_enumerator)
    <238>   DW_AT_name        : (indirect string, offset: 0xb0547): RNG_IRQn
    <23c>   DW_AT_const_value : 80
 <2><23d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <23e>   DW_AT_name        : (indirect string, offset: 0x3fb45): FPU_IRQn
    <242>   DW_AT_const_value : 81
 <2><243>: Abbrev Number: 0
 <1><244>: Abbrev Number: 19 (DW_TAG_base_type)
    <245>   DW_AT_byte_size   : 1
    <246>   DW_AT_encoding    : 6	(signed char)
    <247>   DW_AT_name        : (indirect string, offset: 0x61f48): signed char
 <1><24b>: Abbrev Number: 7 (DW_TAG_typedef)
    <24c>   DW_AT_name        : (indirect string, offset: 0xab031): IRQn_Type
    <250>   DW_AT_decl_file   : 3
    <251>   DW_AT_decl_line   : 155
    <252>   DW_AT_decl_column : 3
    <253>   DW_AT_type        : <0x31>
 <1><257>: Abbrev Number: 7 (DW_TAG_typedef)
    <258>   DW_AT_name        : (indirect string, offset: 0x392cf): __uint8_t
    <25c>   DW_AT_decl_file   : 4
    <25d>   DW_AT_decl_line   : 43
    <25e>   DW_AT_decl_column : 24
    <25f>   DW_AT_type        : <0x263>
 <1><263>: Abbrev Number: 19 (DW_TAG_base_type)
    <264>   DW_AT_byte_size   : 1
    <265>   DW_AT_encoding    : 8	(unsigned char)
    <266>   DW_AT_name        : (indirect string, offset: 0xbd85f): unsigned char
 <1><26a>: Abbrev Number: 19 (DW_TAG_base_type)
    <26b>   DW_AT_byte_size   : 2
    <26c>   DW_AT_encoding    : 5	(signed)
    <26d>   DW_AT_name        : (indirect string, offset: 0x91a47): short int
 <1><271>: Abbrev Number: 7 (DW_TAG_typedef)
    <272>   DW_AT_name        : (indirect string, offset: 0x9fc1d): __uint16_t
    <276>   DW_AT_decl_file   : 4
    <277>   DW_AT_decl_line   : 57
    <278>   DW_AT_decl_column : 25
    <279>   DW_AT_type        : <0x27d>
 <1><27d>: Abbrev Number: 19 (DW_TAG_base_type)
    <27e>   DW_AT_byte_size   : 2
    <27f>   DW_AT_encoding    : 7	(unsigned)
    <280>   DW_AT_name        : (indirect string, offset: 0xbbfc1): short unsigned int
 <1><284>: Abbrev Number: 19 (DW_TAG_base_type)
    <285>   DW_AT_byte_size   : 4
    <286>   DW_AT_encoding    : 5	(signed)
    <287>   DW_AT_name        : (indirect string, offset: 0x10492): long int
 <1><28b>: Abbrev Number: 7 (DW_TAG_typedef)
    <28c>   DW_AT_name        : (indirect string, offset: 0x7c645): __uint32_t
    <290>   DW_AT_decl_file   : 4
    <291>   DW_AT_decl_line   : 79
    <292>   DW_AT_decl_column : 25
    <293>   DW_AT_type        : <0x297>
 <1><297>: Abbrev Number: 19 (DW_TAG_base_type)
    <298>   DW_AT_byte_size   : 4
    <299>   DW_AT_encoding    : 7	(unsigned)
    <29a>   DW_AT_name        : (indirect string, offset: 0x4b15a): long unsigned int
 <1><29e>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <29f>   DW_AT_type        : <0x297>
 <1><2a3>: Abbrev Number: 19 (DW_TAG_base_type)
    <2a4>   DW_AT_byte_size   : 8
    <2a5>   DW_AT_encoding    : 5	(signed)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x59396): long long int
 <1><2aa>: Abbrev Number: 19 (DW_TAG_base_type)
    <2ab>   DW_AT_byte_size   : 8
    <2ac>   DW_AT_encoding    : 7	(unsigned)
    <2ad>   DW_AT_name        : (indirect string, offset: 0x293e6): long long unsigned int
 <1><2b1>: Abbrev Number: 46 (DW_TAG_base_type)
    <2b2>   DW_AT_byte_size   : 4
    <2b3>   DW_AT_encoding    : 5	(signed)
    <2b4>   DW_AT_name        : int
 <1><2b8>: Abbrev Number: 19 (DW_TAG_base_type)
    <2b9>   DW_AT_byte_size   : 4
    <2ba>   DW_AT_encoding    : 7	(unsigned)
    <2bb>   DW_AT_name        : (indirect string, offset: 0xfb4d): unsigned int
 <1><2bf>: Abbrev Number: 7 (DW_TAG_typedef)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x392d1): uint8_t
    <2c4>   DW_AT_decl_file   : 5
    <2c5>   DW_AT_decl_line   : 24
    <2c6>   DW_AT_decl_column : 19
    <2c7>   DW_AT_type        : <0x257>
 <1><2cb>: Abbrev Number: 18 (DW_TAG_const_type)
    <2cc>   DW_AT_type        : <0x2bf>
 <1><2d0>: Abbrev Number: 7 (DW_TAG_typedef)
    <2d1>   DW_AT_name        : (indirect string, offset: 0x8e869): uint16_t
    <2d5>   DW_AT_decl_file   : 5
    <2d6>   DW_AT_decl_line   : 36
    <2d7>   DW_AT_decl_column : 20
    <2d8>   DW_AT_type        : <0x271>
 <1><2dc>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <2dd>   DW_AT_type        : <0x2d0>
 <1><2e1>: Abbrev Number: 7 (DW_TAG_typedef)
    <2e2>   DW_AT_name        : (indirect string, offset: 0xa46fe): uint32_t
    <2e6>   DW_AT_decl_file   : 5
    <2e7>   DW_AT_decl_line   : 48
    <2e8>   DW_AT_decl_column : 20
    <2e9>   DW_AT_type        : <0x28b>
 <1><2ed>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <2ee>   DW_AT_type        : <0x2e1>
 <1><2f2>: Abbrev Number: 18 (DW_TAG_const_type)
    <2f3>   DW_AT_type        : <0x2e1>
 <1><2f7>: Abbrev Number: 25 (DW_TAG_array_type)
    <2f8>   DW_AT_type        : <0x2e1>
    <2fc>   DW_AT_sibling     : <0x307>
 <2><300>: Abbrev Number: 28 (DW_TAG_subrange_type)
    <301>   DW_AT_type        : <0x2b8>
    <305>   DW_AT_upper_bound : 1
 <2><306>: Abbrev Number: 0
 <1><307>: Abbrev Number: 22 (DW_TAG_structure_type)
    <308>   DW_AT_byte_size   : 56
    <309>   DW_AT_decl_file   : 3
    <30a>   DW_AT_decl_line   : 289
    <30c>   DW_AT_decl_column : 9
    <30c>   DW_AT_sibling     : <0x3cf>
 <2><310>: Abbrev Number: 11 (DW_TAG_member)
    <311>   DW_AT_name        : CR
    <314>   DW_AT_decl_file   : 3
    <314>   DW_AT_decl_line   : 291
    <316>   DW_AT_decl_column : 17
    <316>   DW_AT_type        : <0x2ed>
    <31a>   DW_AT_data_member_location: 0
 <2><31b>: Abbrev Number: 4 (DW_TAG_member)
    <31c>   DW_AT_name        : (indirect string, offset: 0x6a332): SWTRIGR
    <320>   DW_AT_decl_file   : 3
    <321>   DW_AT_decl_line   : 292
    <323>   DW_AT_decl_column : 17
    <324>   DW_AT_type        : <0x2ed>
    <328>   DW_AT_data_member_location: 4
 <2><329>: Abbrev Number: 4 (DW_TAG_member)
    <32a>   DW_AT_name        : (indirect string, offset: 0x2992d): DHR12R1
    <32e>   DW_AT_decl_file   : 3
    <32f>   DW_AT_decl_line   : 293
    <331>   DW_AT_decl_column : 17
    <332>   DW_AT_type        : <0x2ed>
    <336>   DW_AT_data_member_location: 8
 <2><337>: Abbrev Number: 4 (DW_TAG_member)
    <338>   DW_AT_name        : (indirect string, offset: 0x9f273): DHR12L1
    <33c>   DW_AT_decl_file   : 3
    <33d>   DW_AT_decl_line   : 294
    <33f>   DW_AT_decl_column : 17
    <340>   DW_AT_type        : <0x2ed>
    <344>   DW_AT_data_member_location: 12
 <2><345>: Abbrev Number: 4 (DW_TAG_member)
    <346>   DW_AT_name        : (indirect string, offset: 0x70380): DHR8R1
    <34a>   DW_AT_decl_file   : 3
    <34b>   DW_AT_decl_line   : 295
    <34d>   DW_AT_decl_column : 17
    <34e>   DW_AT_type        : <0x2ed>
    <352>   DW_AT_data_member_location: 16
 <2><353>: Abbrev Number: 4 (DW_TAG_member)
    <354>   DW_AT_name        : (indirect string, offset: 0xa1779): DHR12R2
    <358>   DW_AT_decl_file   : 3
    <359>   DW_AT_decl_line   : 296
    <35b>   DW_AT_decl_column : 17
    <35c>   DW_AT_type        : <0x2ed>
    <360>   DW_AT_data_member_location: 20
 <2><361>: Abbrev Number: 4 (DW_TAG_member)
    <362>   DW_AT_name        : (indirect string, offset: 0x9f27b): DHR12L2
    <366>   DW_AT_decl_file   : 3
    <367>   DW_AT_decl_line   : 297
    <369>   DW_AT_decl_column : 17
    <36a>   DW_AT_type        : <0x2ed>
    <36e>   DW_AT_data_member_location: 24
 <2><36f>: Abbrev Number: 4 (DW_TAG_member)
    <370>   DW_AT_name        : (indirect string, offset: 0x70387): DHR8R2
    <374>   DW_AT_decl_file   : 3
    <375>   DW_AT_decl_line   : 298
    <377>   DW_AT_decl_column : 17
    <378>   DW_AT_type        : <0x2ed>
    <37c>   DW_AT_data_member_location: 28
 <2><37d>: Abbrev Number: 4 (DW_TAG_member)
    <37e>   DW_AT_name        : (indirect string, offset: 0xa17ea): DHR12RD
    <382>   DW_AT_decl_file   : 3
    <383>   DW_AT_decl_line   : 299
    <385>   DW_AT_decl_column : 17
    <386>   DW_AT_type        : <0x2ed>
    <38a>   DW_AT_data_member_location: 32
 <2><38b>: Abbrev Number: 4 (DW_TAG_member)
    <38c>   DW_AT_name        : (indirect string, offset: 0x9f4de): DHR12LD
    <390>   DW_AT_decl_file   : 3
    <391>   DW_AT_decl_line   : 300
    <393>   DW_AT_decl_column : 17
    <394>   DW_AT_type        : <0x2ed>
    <398>   DW_AT_data_member_location: 36
 <2><399>: Abbrev Number: 4 (DW_TAG_member)
    <39a>   DW_AT_name        : (indirect string, offset: 0x704e6): DHR8RD
    <39e>   DW_AT_decl_file   : 3
    <39f>   DW_AT_decl_line   : 301
    <3a1>   DW_AT_decl_column : 17
    <3a2>   DW_AT_type        : <0x2ed>
    <3a6>   DW_AT_data_member_location: 40
 <2><3a7>: Abbrev Number: 4 (DW_TAG_member)
    <3a8>   DW_AT_name        : (indirect string, offset: 0xdddf): DOR1
    <3ac>   DW_AT_decl_file   : 3
    <3ad>   DW_AT_decl_line   : 302
    <3af>   DW_AT_decl_column : 17
    <3b0>   DW_AT_type        : <0x2ed>
    <3b4>   DW_AT_data_member_location: 44
 <2><3b5>: Abbrev Number: 4 (DW_TAG_member)
    <3b6>   DW_AT_name        : (indirect string, offset: 0x86a4): DOR2
    <3ba>   DW_AT_decl_file   : 3
    <3bb>   DW_AT_decl_line   : 303
    <3bd>   DW_AT_decl_column : 17
    <3be>   DW_AT_type        : <0x2ed>
    <3c2>   DW_AT_data_member_location: 48
 <2><3c3>: Abbrev Number: 11 (DW_TAG_member)
    <3c4>   DW_AT_name        : SR
    <3c7>   DW_AT_decl_file   : 3
    <3c7>   DW_AT_decl_line   : 304
    <3c9>   DW_AT_decl_column : 17
    <3c9>   DW_AT_type        : <0x2ed>
    <3cd>   DW_AT_data_member_location: 52
 <2><3ce>: Abbrev Number: 0
 <1><3cf>: Abbrev Number: 15 (DW_TAG_typedef)
    <3d0>   DW_AT_name        : (indirect string, offset: 0x8064d): DAC_TypeDef
    <3d4>   DW_AT_decl_file   : 3
    <3d5>   DW_AT_decl_line   : 305
    <3d7>   DW_AT_decl_column : 3
    <3d8>   DW_AT_type        : <0x307>
 <1><3dc>: Abbrev Number: 22 (DW_TAG_structure_type)
    <3dd>   DW_AT_byte_size   : 24
    <3de>   DW_AT_decl_file   : 3
    <3df>   DW_AT_decl_line   : 324
    <3e1>   DW_AT_decl_column : 9
    <3e1>   DW_AT_sibling     : <0x433>
 <2><3e5>: Abbrev Number: 11 (DW_TAG_member)
    <3e6>   DW_AT_name        : CR
    <3e9>   DW_AT_decl_file   : 3
    <3e9>   DW_AT_decl_line   : 326
    <3eb>   DW_AT_decl_column : 17
    <3eb>   DW_AT_type        : <0x2ed>
    <3ef>   DW_AT_data_member_location: 0
 <2><3f0>: Abbrev Number: 4 (DW_TAG_member)
    <3f1>   DW_AT_name        : (indirect string, offset: 0x16f8a): NDTR
    <3f5>   DW_AT_decl_file   : 3
    <3f6>   DW_AT_decl_line   : 327
    <3f8>   DW_AT_decl_column : 17
    <3f9>   DW_AT_type        : <0x2ed>
    <3fd>   DW_AT_data_member_location: 4
 <2><3fe>: Abbrev Number: 11 (DW_TAG_member)
    <3ff>   DW_AT_name        : PAR
    <403>   DW_AT_decl_file   : 3
    <403>   DW_AT_decl_line   : 328
    <405>   DW_AT_decl_column : 17
    <405>   DW_AT_type        : <0x2ed>
    <409>   DW_AT_data_member_location: 8
 <2><40a>: Abbrev Number: 4 (DW_TAG_member)
    <40b>   DW_AT_name        : (indirect string, offset: 0x515d0): M0AR
    <40f>   DW_AT_decl_file   : 3
    <410>   DW_AT_decl_line   : 329
    <412>   DW_AT_decl_column : 17
    <413>   DW_AT_type        : <0x2ed>
    <417>   DW_AT_data_member_location: 12
 <2><418>: Abbrev Number: 4 (DW_TAG_member)
    <419>   DW_AT_name        : (indirect string, offset: 0x6c231): M1AR
    <41d>   DW_AT_decl_file   : 3
    <41e>   DW_AT_decl_line   : 330
    <420>   DW_AT_decl_column : 17
    <421>   DW_AT_type        : <0x2ed>
    <425>   DW_AT_data_member_location: 16
 <2><426>: Abbrev Number: 11 (DW_TAG_member)
    <427>   DW_AT_name        : FCR
    <42b>   DW_AT_decl_file   : 3
    <42b>   DW_AT_decl_line   : 331
    <42d>   DW_AT_decl_column : 17
    <42d>   DW_AT_type        : <0x2ed>
    <431>   DW_AT_data_member_location: 20
 <2><432>: Abbrev Number: 0
 <1><433>: Abbrev Number: 15 (DW_TAG_typedef)
    <434>   DW_AT_name        : (indirect string, offset: 0xb1e90): DMA_Stream_TypeDef
    <438>   DW_AT_decl_file   : 3
    <439>   DW_AT_decl_line   : 332
    <43b>   DW_AT_decl_column : 3
    <43c>   DW_AT_type        : <0x3dc>
 <1><440>: Abbrev Number: 22 (DW_TAG_structure_type)
    <441>   DW_AT_byte_size   : 40
    <442>   DW_AT_decl_file   : 3
    <443>   DW_AT_decl_line   : 430
    <445>   DW_AT_decl_column : 9
    <445>   DW_AT_sibling     : <0x4c2>
 <2><449>: Abbrev Number: 4 (DW_TAG_member)
    <44a>   DW_AT_name        : (indirect string, offset: 0x7efad): MODER
    <44e>   DW_AT_decl_file   : 3
    <44f>   DW_AT_decl_line   : 432
    <451>   DW_AT_decl_column : 17
    <452>   DW_AT_type        : <0x2ed>
    <456>   DW_AT_data_member_location: 0
 <2><457>: Abbrev Number: 4 (DW_TAG_member)
    <458>   DW_AT_name        : (indirect string, offset: 0x9772b): OTYPER
    <45c>   DW_AT_decl_file   : 3
    <45d>   DW_AT_decl_line   : 433
    <45f>   DW_AT_decl_column : 17
    <460>   DW_AT_type        : <0x2ed>
    <464>   DW_AT_data_member_location: 4
 <2><465>: Abbrev Number: 4 (DW_TAG_member)
    <466>   DW_AT_name        : (indirect string, offset: 0xaa414): OSPEEDR
    <46a>   DW_AT_decl_file   : 3
    <46b>   DW_AT_decl_line   : 434
    <46d>   DW_AT_decl_column : 17
    <46e>   DW_AT_type        : <0x2ed>
    <472>   DW_AT_data_member_location: 8
 <2><473>: Abbrev Number: 4 (DW_TAG_member)
    <474>   DW_AT_name        : (indirect string, offset: 0x71184): PUPDR
    <478>   DW_AT_decl_file   : 3
    <479>   DW_AT_decl_line   : 435
    <47b>   DW_AT_decl_column : 17
    <47c>   DW_AT_type        : <0x2ed>
    <480>   DW_AT_data_member_location: 12
 <2><481>: Abbrev Number: 11 (DW_TAG_member)
    <482>   DW_AT_name        : IDR
    <486>   DW_AT_decl_file   : 3
    <486>   DW_AT_decl_line   : 436
    <488>   DW_AT_decl_column : 17
    <488>   DW_AT_type        : <0x2ed>
    <48c>   DW_AT_data_member_location: 16
 <2><48d>: Abbrev Number: 11 (DW_TAG_member)
    <48e>   DW_AT_name        : ODR
    <492>   DW_AT_decl_file   : 3
    <492>   DW_AT_decl_line   : 437
    <494>   DW_AT_decl_column : 17
    <494>   DW_AT_type        : <0x2ed>
    <498>   DW_AT_data_member_location: 20
 <2><499>: Abbrev Number: 4 (DW_TAG_member)
    <49a>   DW_AT_name        : (indirect string, offset: 0x2c7b7): BSRR
    <49e>   DW_AT_decl_file   : 3
    <49f>   DW_AT_decl_line   : 438
    <4a1>   DW_AT_decl_column : 17
    <4a2>   DW_AT_type        : <0x2ed>
    <4a6>   DW_AT_data_member_location: 24
 <2><4a7>: Abbrev Number: 4 (DW_TAG_member)
    <4a8>   DW_AT_name        : (indirect string, offset: 0xa7afc): LCKR
    <4ac>   DW_AT_decl_file   : 3
    <4ad>   DW_AT_decl_line   : 439
    <4af>   DW_AT_decl_column : 17
    <4b0>   DW_AT_type        : <0x2ed>
    <4b4>   DW_AT_data_member_location: 28
 <2><4b5>: Abbrev Number: 11 (DW_TAG_member)
    <4b6>   DW_AT_name        : AFR
    <4ba>   DW_AT_decl_file   : 3
    <4ba>   DW_AT_decl_line   : 440
    <4bc>   DW_AT_decl_column : 17
    <4bc>   DW_AT_type        : <0x4d2>
    <4c0>   DW_AT_data_member_location: 32
 <2><4c1>: Abbrev Number: 0
 <1><4c2>: Abbrev Number: 25 (DW_TAG_array_type)
    <4c3>   DW_AT_type        : <0x2ed>
    <4c7>   DW_AT_sibling     : <0x4d2>
 <2><4cb>: Abbrev Number: 28 (DW_TAG_subrange_type)
    <4cc>   DW_AT_type        : <0x2b8>
    <4d0>   DW_AT_upper_bound : 1
 <2><4d1>: Abbrev Number: 0
 <1><4d2>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <4d3>   DW_AT_type        : <0x4c2>
 <1><4d7>: Abbrev Number: 15 (DW_TAG_typedef)
    <4d8>   DW_AT_name        : (indirect string, offset: 0xbe9c2): GPIO_TypeDef
    <4dc>   DW_AT_decl_file   : 3
    <4dd>   DW_AT_decl_line   : 441
    <4df>   DW_AT_decl_column : 3
    <4e0>   DW_AT_type        : <0x440>
 <1><4e4>: Abbrev Number: 22 (DW_TAG_structure_type)
    <4e5>   DW_AT_byte_size   : 8
    <4e6>   DW_AT_decl_file   : 3
    <4e7>   DW_AT_decl_line   : 490
    <4e9>   DW_AT_decl_column : 9
    <4e9>   DW_AT_sibling     : <0x505>
 <2><4ed>: Abbrev Number: 11 (DW_TAG_member)
    <4ee>   DW_AT_name        : CR
    <4f1>   DW_AT_decl_file   : 3
    <4f1>   DW_AT_decl_line   : 492
    <4f3>   DW_AT_decl_column : 17
    <4f3>   DW_AT_type        : <0x2ed>
    <4f7>   DW_AT_data_member_location: 0
 <2><4f8>: Abbrev Number: 11 (DW_TAG_member)
    <4f9>   DW_AT_name        : CSR
    <4fd>   DW_AT_decl_file   : 3
    <4fd>   DW_AT_decl_line   : 493
    <4ff>   DW_AT_decl_column : 17
    <4ff>   DW_AT_type        : <0x2ed>
    <503>   DW_AT_data_member_location: 4
 <2><504>: Abbrev Number: 0
 <1><505>: Abbrev Number: 15 (DW_TAG_typedef)
    <506>   DW_AT_name        : (indirect string, offset: 0x8d345): PWR_TypeDef
    <50a>   DW_AT_decl_file   : 3
    <50b>   DW_AT_decl_line   : 494
    <50d>   DW_AT_decl_column : 3
    <50e>   DW_AT_type        : <0x4e4>
 <1><512>: Abbrev Number: 22 (DW_TAG_structure_type)
    <513>   DW_AT_byte_size   : 136
    <514>   DW_AT_decl_file   : 3
    <515>   DW_AT_decl_line   : 500
    <517>   DW_AT_decl_column : 9
    <517>   DW_AT_sibling     : <0x6b9>
 <2><51b>: Abbrev Number: 11 (DW_TAG_member)
    <51c>   DW_AT_name        : CR
    <51f>   DW_AT_decl_file   : 3
    <51f>   DW_AT_decl_line   : 502
    <521>   DW_AT_decl_column : 17
    <521>   DW_AT_type        : <0x2ed>
    <525>   DW_AT_data_member_location: 0
 <2><526>: Abbrev Number: 4 (DW_TAG_member)
    <527>   DW_AT_name        : (indirect string, offset: 0x88b09): PLLCFGR
    <52b>   DW_AT_decl_file   : 3
    <52c>   DW_AT_decl_line   : 503
    <52e>   DW_AT_decl_column : 17
    <52f>   DW_AT_type        : <0x2ed>
    <533>   DW_AT_data_member_location: 4
 <2><534>: Abbrev Number: 4 (DW_TAG_member)
    <535>   DW_AT_name        : (indirect string, offset: 0x88b0c): CFGR
    <539>   DW_AT_decl_file   : 3
    <53a>   DW_AT_decl_line   : 504
    <53c>   DW_AT_decl_column : 17
    <53d>   DW_AT_type        : <0x2ed>
    <541>   DW_AT_data_member_location: 8
 <2><542>: Abbrev Number: 11 (DW_TAG_member)
    <543>   DW_AT_name        : CIR
    <547>   DW_AT_decl_file   : 3
    <547>   DW_AT_decl_line   : 505
    <549>   DW_AT_decl_column : 17
    <549>   DW_AT_type        : <0x2ed>
    <54d>   DW_AT_data_member_location: 12
 <2><54e>: Abbrev Number: 4 (DW_TAG_member)
    <54f>   DW_AT_name        : (indirect string, offset: 0x9bcce): AHB1RSTR
    <553>   DW_AT_decl_file   : 3
    <554>   DW_AT_decl_line   : 506
    <556>   DW_AT_decl_column : 17
    <557>   DW_AT_type        : <0x2ed>
    <55b>   DW_AT_data_member_location: 16
 <2><55c>: Abbrev Number: 4 (DW_TAG_member)
    <55d>   DW_AT_name        : (indirect string, offset: 0x16708): AHB2RSTR
    <561>   DW_AT_decl_file   : 3
    <562>   DW_AT_decl_line   : 507
    <564>   DW_AT_decl_column : 17
    <565>   DW_AT_type        : <0x2ed>
    <569>   DW_AT_data_member_location: 20
 <2><56a>: Abbrev Number: 4 (DW_TAG_member)
    <56b>   DW_AT_name        : (indirect string, offset: 0x40b8c): AHB3RSTR
    <56f>   DW_AT_decl_file   : 3
    <570>   DW_AT_decl_line   : 508
    <572>   DW_AT_decl_column : 17
    <573>   DW_AT_type        : <0x2ed>
    <577>   DW_AT_data_member_location: 24
 <2><578>: Abbrev Number: 4 (DW_TAG_member)
    <579>   DW_AT_name        : (indirect string, offset: 0xb8ccd): RESERVED0
    <57d>   DW_AT_decl_file   : 3
    <57e>   DW_AT_decl_line   : 509
    <580>   DW_AT_decl_column : 17
    <581>   DW_AT_type        : <0x2e1>
    <585>   DW_AT_data_member_location: 28
 <2><586>: Abbrev Number: 4 (DW_TAG_member)
    <587>   DW_AT_name        : (indirect string, offset: 0x16180): APB1RSTR
    <58b>   DW_AT_decl_file   : 3
    <58c>   DW_AT_decl_line   : 510
    <58e>   DW_AT_decl_column : 17
    <58f>   DW_AT_type        : <0x2ed>
    <593>   DW_AT_data_member_location: 32
 <2><594>: Abbrev Number: 4 (DW_TAG_member)
    <595>   DW_AT_name        : (indirect string, offset: 0x54ea8): APB2RSTR
    <599>   DW_AT_decl_file   : 3
    <59a>   DW_AT_decl_line   : 511
    <59c>   DW_AT_decl_column : 17
    <59d>   DW_AT_type        : <0x2ed>
    <5a1>   DW_AT_data_member_location: 36
 <2><5a2>: Abbrev Number: 4 (DW_TAG_member)
    <5a3>   DW_AT_name        : (indirect string, offset: 0xb8cd7): RESERVED1
    <5a7>   DW_AT_decl_file   : 3
    <5a8>   DW_AT_decl_line   : 512
    <5aa>   DW_AT_decl_column : 17
    <5ab>   DW_AT_type        : <0x2f7>
    <5af>   DW_AT_data_member_location: 40
 <2><5b0>: Abbrev Number: 4 (DW_TAG_member)
    <5b1>   DW_AT_name        : (indirect string, offset: 0xfae2): AHB1ENR
    <5b5>   DW_AT_decl_file   : 3
    <5b6>   DW_AT_decl_line   : 513
    <5b8>   DW_AT_decl_column : 17
    <5b9>   DW_AT_type        : <0x2ed>
    <5bd>   DW_AT_data_member_location: 48
 <2><5be>: Abbrev Number: 4 (DW_TAG_member)
    <5bf>   DW_AT_name        : (indirect string, offset: 0x345ad): AHB2ENR
    <5c3>   DW_AT_decl_file   : 3
    <5c4>   DW_AT_decl_line   : 514
    <5c6>   DW_AT_decl_column : 17
    <5c7>   DW_AT_type        : <0x2ed>
    <5cb>   DW_AT_data_member_location: 52
 <2><5cc>: Abbrev Number: 4 (DW_TAG_member)
    <5cd>   DW_AT_name        : (indirect string, offset: 0x57cf3): AHB3ENR
    <5d1>   DW_AT_decl_file   : 3
    <5d2>   DW_AT_decl_line   : 515
    <5d4>   DW_AT_decl_column : 17
    <5d5>   DW_AT_type        : <0x2ed>
    <5d9>   DW_AT_data_member_location: 56
 <2><5da>: Abbrev Number: 4 (DW_TAG_member)
    <5db>   DW_AT_name        : (indirect string, offset: 0xb8ce1): RESERVED2
    <5df>   DW_AT_decl_file   : 3
    <5e0>   DW_AT_decl_line   : 516
    <5e2>   DW_AT_decl_column : 17
    <5e3>   DW_AT_type        : <0x2e1>
    <5e7>   DW_AT_data_member_location: 60
 <2><5e8>: Abbrev Number: 4 (DW_TAG_member)
    <5e9>   DW_AT_name        : (indirect string, offset: 0x7034d): APB1ENR
    <5ed>   DW_AT_decl_file   : 3
    <5ee>   DW_AT_decl_line   : 517
    <5f0>   DW_AT_decl_column : 17
    <5f1>   DW_AT_type        : <0x2ed>
    <5f5>   DW_AT_data_member_location: 64
 <2><5f6>: Abbrev Number: 4 (DW_TAG_member)
    <5f7>   DW_AT_name        : (indirect string, offset: 0x177af): APB2ENR
    <5fb>   DW_AT_decl_file   : 3
    <5fc>   DW_AT_decl_line   : 518
    <5fe>   DW_AT_decl_column : 17
    <5ff>   DW_AT_type        : <0x2ed>
    <603>   DW_AT_data_member_location: 68
 <2><604>: Abbrev Number: 4 (DW_TAG_member)
    <605>   DW_AT_name        : (indirect string, offset: 0xb8ceb): RESERVED3
    <609>   DW_AT_decl_file   : 3
    <60a>   DW_AT_decl_line   : 519
    <60c>   DW_AT_decl_column : 17
    <60d>   DW_AT_type        : <0x2f7>
    <611>   DW_AT_data_member_location: 72
 <2><612>: Abbrev Number: 4 (DW_TAG_member)
    <613>   DW_AT_name        : (indirect string, offset: 0x9faa2): AHB1LPENR
    <617>   DW_AT_decl_file   : 3
    <618>   DW_AT_decl_line   : 520
    <61a>   DW_AT_decl_column : 17
    <61b>   DW_AT_type        : <0x2ed>
    <61f>   DW_AT_data_member_location: 80
 <2><620>: Abbrev Number: 4 (DW_TAG_member)
    <621>   DW_AT_name        : (indirect string, offset: 0x2c425): AHB2LPENR
    <625>   DW_AT_decl_file   : 3
    <626>   DW_AT_decl_line   : 521
    <628>   DW_AT_decl_column : 17
    <629>   DW_AT_type        : <0x2ed>
    <62d>   DW_AT_data_member_location: 84
 <2><62e>: Abbrev Number: 4 (DW_TAG_member)
    <62f>   DW_AT_name        : (indirect string, offset: 0x83fdc): AHB3LPENR
    <633>   DW_AT_decl_file   : 3
    <634>   DW_AT_decl_line   : 522
    <636>   DW_AT_decl_column : 17
    <637>   DW_AT_type        : <0x2ed>
    <63b>   DW_AT_data_member_location: 88
 <2><63c>: Abbrev Number: 4 (DW_TAG_member)
    <63d>   DW_AT_name        : (indirect string, offset: 0xb8cf5): RESERVED4
    <641>   DW_AT_decl_file   : 3
    <642>   DW_AT_decl_line   : 523
    <644>   DW_AT_decl_column : 17
    <645>   DW_AT_type        : <0x2e1>
    <649>   DW_AT_data_member_location: 92
 <2><64a>: Abbrev Number: 4 (DW_TAG_member)
    <64b>   DW_AT_name        : (indirect string, offset: 0xa43ca): APB1LPENR
    <64f>   DW_AT_decl_file   : 3
    <650>   DW_AT_decl_line   : 524
    <652>   DW_AT_decl_column : 17
    <653>   DW_AT_type        : <0x2ed>
    <657>   DW_AT_data_member_location: 96
 <2><658>: Abbrev Number: 4 (DW_TAG_member)
    <659>   DW_AT_name        : (indirect string, offset: 0x322a6): APB2LPENR
    <65d>   DW_AT_decl_file   : 3
    <65e>   DW_AT_decl_line   : 525
    <660>   DW_AT_decl_column : 17
    <661>   DW_AT_type        : <0x2ed>
    <665>   DW_AT_data_member_location: 100
 <2><666>: Abbrev Number: 4 (DW_TAG_member)
    <667>   DW_AT_name        : (indirect string, offset: 0xb8cff): RESERVED5
    <66b>   DW_AT_decl_file   : 3
    <66c>   DW_AT_decl_line   : 526
    <66e>   DW_AT_decl_column : 17
    <66f>   DW_AT_type        : <0x2f7>
    <673>   DW_AT_data_member_location: 104
 <2><674>: Abbrev Number: 4 (DW_TAG_member)
    <675>   DW_AT_name        : (indirect string, offset: 0x1bb48): BDCR
    <679>   DW_AT_decl_file   : 3
    <67a>   DW_AT_decl_line   : 527
    <67c>   DW_AT_decl_column : 17
    <67d>   DW_AT_type        : <0x2ed>
    <681>   DW_AT_data_member_location: 112
 <2><682>: Abbrev Number: 11 (DW_TAG_member)
    <683>   DW_AT_name        : CSR
    <687>   DW_AT_decl_file   : 3
    <687>   DW_AT_decl_line   : 528
    <689>   DW_AT_decl_column : 17
    <689>   DW_AT_type        : <0x2ed>
    <68d>   DW_AT_data_member_location: 116
 <2><68e>: Abbrev Number: 4 (DW_TAG_member)
    <68f>   DW_AT_name        : (indirect string, offset: 0x747a9): RESERVED6
    <693>   DW_AT_decl_file   : 3
    <694>   DW_AT_decl_line   : 529
    <696>   DW_AT_decl_column : 17
    <697>   DW_AT_type        : <0x2f7>
    <69b>   DW_AT_data_member_location: 120
 <2><69c>: Abbrev Number: 4 (DW_TAG_member)
    <69d>   DW_AT_name        : (indirect string, offset: 0x678ef): SSCGR
    <6a1>   DW_AT_decl_file   : 3
    <6a2>   DW_AT_decl_line   : 530
    <6a4>   DW_AT_decl_column : 17
    <6a5>   DW_AT_type        : <0x2ed>
    <6a9>   DW_AT_data_member_location: 128
 <2><6aa>: Abbrev Number: 4 (DW_TAG_member)
    <6ab>   DW_AT_name        : (indirect string, offset: 0x415f6): PLLI2SCFGR
    <6af>   DW_AT_decl_file   : 3
    <6b0>   DW_AT_decl_line   : 531
    <6b2>   DW_AT_decl_column : 17
    <6b3>   DW_AT_type        : <0x2ed>
    <6b7>   DW_AT_data_member_location: 132
 <2><6b8>: Abbrev Number: 0
 <1><6b9>: Abbrev Number: 15 (DW_TAG_typedef)
    <6ba>   DW_AT_name        : (indirect string, offset: 0x5a8ef): RCC_TypeDef
    <6be>   DW_AT_decl_file   : 3
    <6bf>   DW_AT_decl_line   : 532
    <6c1>   DW_AT_decl_column : 3
    <6c2>   DW_AT_type        : <0x512>
 <1><6c6>: Abbrev Number: 22 (DW_TAG_structure_type)
    <6c7>   DW_AT_byte_size   : 84
    <6c8>   DW_AT_decl_file   : 3
    <6c9>   DW_AT_decl_line   : 632
    <6cb>   DW_AT_decl_column : 9
    <6cb>   DW_AT_sibling     : <0x7e0>
 <2><6cf>: Abbrev Number: 11 (DW_TAG_member)
    <6d0>   DW_AT_name        : CR1
    <6d4>   DW_AT_decl_file   : 3
    <6d4>   DW_AT_decl_line   : 634
    <6d6>   DW_AT_decl_column : 17
    <6d6>   DW_AT_type        : <0x2ed>
    <6da>   DW_AT_data_member_location: 0
 <2><6db>: Abbrev Number: 11 (DW_TAG_member)
    <6dc>   DW_AT_name        : CR2
    <6e0>   DW_AT_decl_file   : 3
    <6e0>   DW_AT_decl_line   : 635
    <6e2>   DW_AT_decl_column : 17
    <6e2>   DW_AT_type        : <0x2ed>
    <6e6>   DW_AT_data_member_location: 4
 <2><6e7>: Abbrev Number: 4 (DW_TAG_member)
    <6e8>   DW_AT_name        : (indirect string, offset: 0x39bf1): SMCR
    <6ec>   DW_AT_decl_file   : 3
    <6ed>   DW_AT_decl_line   : 636
    <6ef>   DW_AT_decl_column : 17
    <6f0>   DW_AT_type        : <0x2ed>
    <6f4>   DW_AT_data_member_location: 8
 <2><6f5>: Abbrev Number: 4 (DW_TAG_member)
    <6f6>   DW_AT_name        : (indirect string, offset: 0x41082): DIER
    <6fa>   DW_AT_decl_file   : 3
    <6fb>   DW_AT_decl_line   : 637
    <6fd>   DW_AT_decl_column : 17
    <6fe>   DW_AT_type        : <0x2ed>
    <702>   DW_AT_data_member_location: 12
 <2><703>: Abbrev Number: 11 (DW_TAG_member)
    <704>   DW_AT_name        : SR
    <707>   DW_AT_decl_file   : 3
    <707>   DW_AT_decl_line   : 638
    <709>   DW_AT_decl_column : 17
    <709>   DW_AT_type        : <0x2ed>
    <70d>   DW_AT_data_member_location: 16
 <2><70e>: Abbrev Number: 11 (DW_TAG_member)
    <70f>   DW_AT_name        : EGR
    <713>   DW_AT_decl_file   : 3
    <713>   DW_AT_decl_line   : 639
    <715>   DW_AT_decl_column : 17
    <715>   DW_AT_type        : <0x2ed>
    <719>   DW_AT_data_member_location: 20
 <2><71a>: Abbrev Number: 4 (DW_TAG_member)
    <71b>   DW_AT_name        : (indirect string, offset: 0xb2bec): CCMR1
    <71f>   DW_AT_decl_file   : 3
    <720>   DW_AT_decl_line   : 640
    <722>   DW_AT_decl_column : 17
    <723>   DW_AT_type        : <0x2ed>
    <727>   DW_AT_data_member_location: 24
 <2><728>: Abbrev Number: 4 (DW_TAG_member)
    <729>   DW_AT_name        : (indirect string, offset: 0x4e4a9): CCMR2
    <72d>   DW_AT_decl_file   : 3
    <72e>   DW_AT_decl_line   : 641
    <730>   DW_AT_decl_column : 17
    <731>   DW_AT_type        : <0x2ed>
    <735>   DW_AT_data_member_location: 28
 <2><736>: Abbrev Number: 4 (DW_TAG_member)
    <737>   DW_AT_name        : (indirect string, offset: 0x30251): CCER
    <73b>   DW_AT_decl_file   : 3
    <73c>   DW_AT_decl_line   : 642
    <73e>   DW_AT_decl_column : 17
    <73f>   DW_AT_type        : <0x2ed>
    <743>   DW_AT_data_member_location: 32
 <2><744>: Abbrev Number: 11 (DW_TAG_member)
    <745>   DW_AT_name        : CNT
    <749>   DW_AT_decl_file   : 3
    <749>   DW_AT_decl_line   : 643
    <74b>   DW_AT_decl_column : 17
    <74b>   DW_AT_type        : <0x2ed>
    <74f>   DW_AT_data_member_location: 36
 <2><750>: Abbrev Number: 11 (DW_TAG_member)
    <751>   DW_AT_name        : PSC
    <755>   DW_AT_decl_file   : 3
    <755>   DW_AT_decl_line   : 644
    <757>   DW_AT_decl_column : 17
    <757>   DW_AT_type        : <0x2ed>
    <75b>   DW_AT_data_member_location: 40
 <2><75c>: Abbrev Number: 11 (DW_TAG_member)
    <75d>   DW_AT_name        : ARR
    <761>   DW_AT_decl_file   : 3
    <761>   DW_AT_decl_line   : 645
    <763>   DW_AT_decl_column : 17
    <763>   DW_AT_type        : <0x2ed>
    <767>   DW_AT_data_member_location: 44
 <2><768>: Abbrev Number: 11 (DW_TAG_member)
    <769>   DW_AT_name        : RCR
    <76d>   DW_AT_decl_file   : 3
    <76d>   DW_AT_decl_line   : 646
    <76f>   DW_AT_decl_column : 17
    <76f>   DW_AT_type        : <0x2ed>
    <773>   DW_AT_data_member_location: 48
 <2><774>: Abbrev Number: 4 (DW_TAG_member)
    <775>   DW_AT_name        : (indirect string, offset: 0x177aa): CCR1
    <779>   DW_AT_decl_file   : 3
    <77a>   DW_AT_decl_line   : 647
    <77c>   DW_AT_decl_column : 17
    <77d>   DW_AT_type        : <0x2ed>
    <781>   DW_AT_data_member_location: 52
 <2><782>: Abbrev Number: 4 (DW_TAG_member)
    <783>   DW_AT_name        : (indirect string, offset: 0x5216c): CCR2
    <787>   DW_AT_decl_file   : 3
    <788>   DW_AT_decl_line   : 648
    <78a>   DW_AT_decl_column : 17
    <78b>   DW_AT_type        : <0x2ed>
    <78f>   DW_AT_data_member_location: 56
 <2><790>: Abbrev Number: 4 (DW_TAG_member)
    <791>   DW_AT_name        : (indirect string, offset: 0x9574f): CCR3
    <795>   DW_AT_decl_file   : 3
    <796>   DW_AT_decl_line   : 649
    <798>   DW_AT_decl_column : 17
    <799>   DW_AT_type        : <0x2ed>
    <79d>   DW_AT_data_member_location: 60
 <2><79e>: Abbrev Number: 4 (DW_TAG_member)
    <79f>   DW_AT_name        : (indirect string, offset: 0xc1ae): CCR4
    <7a3>   DW_AT_decl_file   : 3
    <7a4>   DW_AT_decl_line   : 650
    <7a6>   DW_AT_decl_column : 17
    <7a7>   DW_AT_type        : <0x2ed>
    <7ab>   DW_AT_data_member_location: 64
 <2><7ac>: Abbrev Number: 4 (DW_TAG_member)
    <7ad>   DW_AT_name        : (indirect string, offset: 0x852bb): BDTR
    <7b1>   DW_AT_decl_file   : 3
    <7b2>   DW_AT_decl_line   : 651
    <7b4>   DW_AT_decl_column : 17
    <7b5>   DW_AT_type        : <0x2ed>
    <7b9>   DW_AT_data_member_location: 68
 <2><7ba>: Abbrev Number: 11 (DW_TAG_member)
    <7bb>   DW_AT_name        : DCR
    <7bf>   DW_AT_decl_file   : 3
    <7bf>   DW_AT_decl_line   : 652
    <7c1>   DW_AT_decl_column : 17
    <7c1>   DW_AT_type        : <0x2ed>
    <7c5>   DW_AT_data_member_location: 72
 <2><7c6>: Abbrev Number: 4 (DW_TAG_member)
    <7c7>   DW_AT_name        : (indirect string, offset: 0xa811f): DMAR
    <7cb>   DW_AT_decl_file   : 3
    <7cc>   DW_AT_decl_line   : 653
    <7ce>   DW_AT_decl_column : 17
    <7cf>   DW_AT_type        : <0x2ed>
    <7d3>   DW_AT_data_member_location: 76
 <2><7d4>: Abbrev Number: 11 (DW_TAG_member)
    <7d5>   DW_AT_name        : OR
    <7d8>   DW_AT_decl_file   : 3
    <7d8>   DW_AT_decl_line   : 654
    <7da>   DW_AT_decl_column : 17
    <7da>   DW_AT_type        : <0x2ed>
    <7de>   DW_AT_data_member_location: 80
 <2><7df>: Abbrev Number: 0
 <1><7e0>: Abbrev Number: 15 (DW_TAG_typedef)
    <7e1>   DW_AT_name        : (indirect string, offset: 0xb97da): TIM_TypeDef
    <7e5>   DW_AT_decl_file   : 3
    <7e6>   DW_AT_decl_line   : 655
    <7e8>   DW_AT_decl_column : 3
    <7e9>   DW_AT_type        : <0x6c6>
 <1><7ed>: Abbrev Number: 22 (DW_TAG_structure_type)
    <7ee>   DW_AT_byte_size   : 28
    <7ef>   DW_AT_decl_file   : 3
    <7f0>   DW_AT_decl_line   : 661
    <7f2>   DW_AT_decl_column : 9
    <7f2>   DW_AT_sibling     : <0x84b>
 <2><7f6>: Abbrev Number: 11 (DW_TAG_member)
    <7f7>   DW_AT_name        : SR
    <7fa>   DW_AT_decl_file   : 3
    <7fa>   DW_AT_decl_line   : 663
    <7fc>   DW_AT_decl_column : 17
    <7fc>   DW_AT_type        : <0x2ed>
    <800>   DW_AT_data_member_location: 0
 <2><801>: Abbrev Number: 11 (DW_TAG_member)
    <802>   DW_AT_name        : DR
    <805>   DW_AT_decl_file   : 3
    <805>   DW_AT_decl_line   : 664
    <807>   DW_AT_decl_column : 17
    <807>   DW_AT_type        : <0x2ed>
    <80b>   DW_AT_data_member_location: 4
 <2><80c>: Abbrev Number: 11 (DW_TAG_member)
    <80d>   DW_AT_name        : BRR
    <811>   DW_AT_decl_file   : 3
    <811>   DW_AT_decl_line   : 665
    <813>   DW_AT_decl_column : 17
    <813>   DW_AT_type        : <0x2ed>
    <817>   DW_AT_data_member_location: 8
 <2><818>: Abbrev Number: 11 (DW_TAG_member)
    <819>   DW_AT_name        : CR1
    <81d>   DW_AT_decl_file   : 3
    <81d>   DW_AT_decl_line   : 666
    <81f>   DW_AT_decl_column : 17
    <81f>   DW_AT_type        : <0x2ed>
    <823>   DW_AT_data_member_location: 12
 <2><824>: Abbrev Number: 11 (DW_TAG_member)
    <825>   DW_AT_name        : CR2
    <829>   DW_AT_decl_file   : 3
    <829>   DW_AT_decl_line   : 667
    <82b>   DW_AT_decl_column : 17
    <82b>   DW_AT_type        : <0x2ed>
    <82f>   DW_AT_data_member_location: 16
 <2><830>: Abbrev Number: 11 (DW_TAG_member)
    <831>   DW_AT_name        : CR3
    <835>   DW_AT_decl_file   : 3
    <835>   DW_AT_decl_line   : 668
    <837>   DW_AT_decl_column : 17
    <837>   DW_AT_type        : <0x2ed>
    <83b>   DW_AT_data_member_location: 20
 <2><83c>: Abbrev Number: 4 (DW_TAG_member)
    <83d>   DW_AT_name        : (indirect string, offset: 0x36aa4): GTPR
    <841>   DW_AT_decl_file   : 3
    <842>   DW_AT_decl_line   : 669
    <844>   DW_AT_decl_column : 17
    <845>   DW_AT_type        : <0x2ed>
    <849>   DW_AT_data_member_location: 24
 <2><84a>: Abbrev Number: 0
 <1><84b>: Abbrev Number: 15 (DW_TAG_typedef)
    <84c>   DW_AT_name        : (indirect string, offset: 0xc2baf): USART_TypeDef
    <850>   DW_AT_decl_file   : 3
    <851>   DW_AT_decl_line   : 670
    <853>   DW_AT_decl_column : 3
    <854>   DW_AT_type        : <0x7ed>
 <1><858>: Abbrev Number: 7 (DW_TAG_typedef)
    <859>   DW_AT_name        : (indirect string, offset: 0x834d): size_t
    <85d>   DW_AT_decl_file   : 6
    <85e>   DW_AT_decl_line   : 214
    <85f>   DW_AT_decl_column : 23
    <860>   DW_AT_type        : <0x2b8>
 <1><864>: Abbrev Number: 19 (DW_TAG_base_type)
    <865>   DW_AT_byte_size   : 8
    <866>   DW_AT_encoding    : 4	(float)
    <867>   DW_AT_name        : (indirect string, offset: 0x245cf): long double
 <1><86b>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <86c>   DW_AT_encoding    : 7	(unsigned)
    <86d>   DW_AT_byte_size   : 1
    <86e>   DW_AT_type        : <0x263>
    <872>   DW_AT_decl_file   : 7
    <873>   DW_AT_decl_line   : 39
    <874>   DW_AT_decl_column : 1
    <875>   DW_AT_sibling     : <0x892>
 <2><879>: Abbrev Number: 1 (DW_TAG_enumerator)
    <87a>   DW_AT_name        : (indirect string, offset: 0x42683): HAL_OK
    <87e>   DW_AT_const_value : 0
 <2><87f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <880>   DW_AT_name        : (indirect string, offset: 0x7a2dd): HAL_ERROR
    <884>   DW_AT_const_value : 1
 <2><885>: Abbrev Number: 1 (DW_TAG_enumerator)
    <886>   DW_AT_name        : (indirect string, offset: 0x22c0d): HAL_BUSY
    <88a>   DW_AT_const_value : 2
 <2><88b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <88c>   DW_AT_name        : (indirect string, offset: 0x399d6): HAL_TIMEOUT
    <890>   DW_AT_const_value : 3
 <2><891>: Abbrev Number: 0
 <1><892>: Abbrev Number: 7 (DW_TAG_typedef)
    <893>   DW_AT_name        : (indirect string, offset: 0x21ff): HAL_StatusTypeDef
    <897>   DW_AT_decl_file   : 7
    <898>   DW_AT_decl_line   : 44
    <899>   DW_AT_decl_column : 3
    <89a>   DW_AT_type        : <0x86b>
 <1><89e>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <89f>   DW_AT_encoding    : 7	(unsigned)
    <8a0>   DW_AT_byte_size   : 1
    <8a1>   DW_AT_type        : <0x263>
    <8a5>   DW_AT_decl_file   : 7
    <8a6>   DW_AT_decl_line   : 50
    <8a7>   DW_AT_decl_column : 1
    <8a8>   DW_AT_sibling     : <0x8b9>
 <2><8ac>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8ad>   DW_AT_name        : (indirect string, offset: 0x908a5): HAL_UNLOCKED
    <8b1>   DW_AT_const_value : 0
 <2><8b2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8b3>   DW_AT_name        : (indirect string, offset: 0xc420d): HAL_LOCKED
    <8b7>   DW_AT_const_value : 1
 <2><8b8>: Abbrev Number: 0
 <1><8b9>: Abbrev Number: 7 (DW_TAG_typedef)
    <8ba>   DW_AT_name        : (indirect string, offset: 0x737d3): HAL_LockTypeDef
    <8be>   DW_AT_decl_file   : 7
    <8bf>   DW_AT_decl_line   : 53
    <8c0>   DW_AT_decl_column : 3
    <8c1>   DW_AT_type        : <0x89e>
 <1><8c5>: Abbrev Number: 16 (DW_TAG_structure_type)
    <8c6>   DW_AT_byte_size   : 24
    <8c7>   DW_AT_decl_file   : 8
    <8c8>   DW_AT_decl_line   : 45
    <8c9>   DW_AT_decl_column : 9
    <8c9>   DW_AT_sibling     : <0x91c>
 <2><8cd>: Abbrev Number: 3 (DW_TAG_member)
    <8ce>   DW_AT_name        : (indirect string, offset: 0x82ec0): PLLState
    <8d2>   DW_AT_decl_file   : 8
    <8d3>   DW_AT_decl_line   : 47
    <8d4>   DW_AT_decl_column : 12
    <8d5>   DW_AT_type        : <0x2e1>
    <8d9>   DW_AT_data_member_location: 0
 <2><8da>: Abbrev Number: 3 (DW_TAG_member)
    <8db>   DW_AT_name        : (indirect string, offset: 0x87813): PLLSource
    <8df>   DW_AT_decl_file   : 8
    <8e0>   DW_AT_decl_line   : 50
    <8e1>   DW_AT_decl_column : 12
    <8e2>   DW_AT_type        : <0x2e1>
    <8e6>   DW_AT_data_member_location: 4
 <2><8e7>: Abbrev Number: 3 (DW_TAG_member)
    <8e8>   DW_AT_name        : (indirect string, offset: 0xa2073): PLLM
    <8ec>   DW_AT_decl_file   : 8
    <8ed>   DW_AT_decl_line   : 53
    <8ee>   DW_AT_decl_column : 12
    <8ef>   DW_AT_type        : <0x2e1>
    <8f3>   DW_AT_data_member_location: 8
 <2><8f4>: Abbrev Number: 3 (DW_TAG_member)
    <8f5>   DW_AT_name        : (indirect string, offset: 0xa2078): PLLN
    <8f9>   DW_AT_decl_file   : 8
    <8fa>   DW_AT_decl_line   : 56
    <8fb>   DW_AT_decl_column : 12
    <8fc>   DW_AT_type        : <0x2e1>
    <900>   DW_AT_data_member_location: 12
 <2><901>: Abbrev Number: 3 (DW_TAG_member)
    <902>   DW_AT_name        : (indirect string, offset: 0xa2095): PLLP
    <906>   DW_AT_decl_file   : 8
    <907>   DW_AT_decl_line   : 60
    <908>   DW_AT_decl_column : 12
    <909>   DW_AT_type        : <0x2e1>
    <90d>   DW_AT_data_member_location: 16
 <2><90e>: Abbrev Number: 3 (DW_TAG_member)
    <90f>   DW_AT_name        : (indirect string, offset: 0x490b9): PLLQ
    <913>   DW_AT_decl_file   : 8
    <914>   DW_AT_decl_line   : 63
    <915>   DW_AT_decl_column : 12
    <916>   DW_AT_type        : <0x2e1>
    <91a>   DW_AT_data_member_location: 20
 <2><91b>: Abbrev Number: 0
 <1><91c>: Abbrev Number: 7 (DW_TAG_typedef)
    <91d>   DW_AT_name        : (indirect string, offset: 0x76454): RCC_PLLInitTypeDef
    <921>   DW_AT_decl_file   : 8
    <922>   DW_AT_decl_line   : 73
    <923>   DW_AT_decl_column : 3
    <924>   DW_AT_type        : <0x8c5>
 <1><928>: Abbrev Number: 16 (DW_TAG_structure_type)
    <929>   DW_AT_byte_size   : 48
    <92a>   DW_AT_decl_file   : 9
    <92b>   DW_AT_decl_line   : 49
    <92c>   DW_AT_decl_column : 9
    <92c>   DW_AT_sibling     : <0x98c>
 <2><930>: Abbrev Number: 3 (DW_TAG_member)
    <931>   DW_AT_name        : (indirect string, offset: 0x9f566): OscillatorType
    <935>   DW_AT_decl_file   : 9
    <936>   DW_AT_decl_line   : 51
    <937>   DW_AT_decl_column : 12
    <938>   DW_AT_type        : <0x2e1>
    <93c>   DW_AT_data_member_location: 0
 <2><93d>: Abbrev Number: 3 (DW_TAG_member)
    <93e>   DW_AT_name        : (indirect string, offset: 0x8460d): HSEState
    <942>   DW_AT_decl_file   : 9
    <943>   DW_AT_decl_line   : 54
    <944>   DW_AT_decl_column : 12
    <945>   DW_AT_type        : <0x2e1>
    <949>   DW_AT_data_member_location: 4
 <2><94a>: Abbrev Number: 3 (DW_TAG_member)
    <94b>   DW_AT_name        : (indirect string, offset: 0x7ac58): LSEState
    <94f>   DW_AT_decl_file   : 9
    <950>   DW_AT_decl_line   : 57
    <951>   DW_AT_decl_column : 12
    <952>   DW_AT_type        : <0x2e1>
    <956>   DW_AT_data_member_location: 8
 <2><957>: Abbrev Number: 3 (DW_TAG_member)
    <958>   DW_AT_name        : (indirect string, offset: 0x57492): HSIState
    <95c>   DW_AT_decl_file   : 9
    <95d>   DW_AT_decl_line   : 60
    <95e>   DW_AT_decl_column : 12
    <95f>   DW_AT_type        : <0x2e1>
    <963>   DW_AT_data_member_location: 12
 <2><964>: Abbrev Number: 3 (DW_TAG_member)
    <965>   DW_AT_name        : (indirect string, offset: 0xa8383): HSICalibrationValue
    <969>   DW_AT_decl_file   : 9
    <96a>   DW_AT_decl_line   : 63
    <96b>   DW_AT_decl_column : 12
    <96c>   DW_AT_type        : <0x2e1>
    <970>   DW_AT_data_member_location: 16
 <2><971>: Abbrev Number: 3 (DW_TAG_member)
    <972>   DW_AT_name        : (indirect string, offset: 0x44dde): LSIState
    <976>   DW_AT_decl_file   : 9
    <977>   DW_AT_decl_line   : 66
    <978>   DW_AT_decl_column : 12
    <979>   DW_AT_type        : <0x2e1>
    <97d>   DW_AT_data_member_location: 20
 <2><97e>: Abbrev Number: 38 (DW_TAG_member)
    <97f>   DW_AT_name        : PLL
    <983>   DW_AT_decl_file   : 9
    <984>   DW_AT_decl_line   : 69
    <985>   DW_AT_decl_column : 22
    <986>   DW_AT_type        : <0x91c>
    <98a>   DW_AT_data_member_location: 24
 <2><98b>: Abbrev Number: 0
 <1><98c>: Abbrev Number: 7 (DW_TAG_typedef)
    <98d>   DW_AT_name        : (indirect string, offset: 0x67e71): RCC_OscInitTypeDef
    <991>   DW_AT_decl_file   : 9
    <992>   DW_AT_decl_line   : 70
    <993>   DW_AT_decl_column : 3
    <994>   DW_AT_type        : <0x928>
 <1><998>: Abbrev Number: 16 (DW_TAG_structure_type)
    <999>   DW_AT_byte_size   : 20
    <99a>   DW_AT_decl_file   : 9
    <99b>   DW_AT_decl_line   : 75
    <99c>   DW_AT_decl_column : 9
    <99c>   DW_AT_sibling     : <0x9e2>
 <2><9a0>: Abbrev Number: 3 (DW_TAG_member)
    <9a1>   DW_AT_name        : (indirect string, offset: 0x3c3d7): ClockType
    <9a5>   DW_AT_decl_file   : 9
    <9a6>   DW_AT_decl_line   : 77
    <9a7>   DW_AT_decl_column : 12
    <9a8>   DW_AT_type        : <0x2e1>
    <9ac>   DW_AT_data_member_location: 0
 <2><9ad>: Abbrev Number: 3 (DW_TAG_member)
    <9ae>   DW_AT_name        : (indirect string, offset: 0x75eab): SYSCLKSource
    <9b2>   DW_AT_decl_file   : 9
    <9b3>   DW_AT_decl_line   : 80
    <9b4>   DW_AT_decl_column : 12
    <9b5>   DW_AT_type        : <0x2e1>
    <9b9>   DW_AT_data_member_location: 4
 <2><9ba>: Abbrev Number: 3 (DW_TAG_member)
    <9bb>   DW_AT_name        : (indirect string, offset: 0xa1a91): AHBCLKDivider
    <9bf>   DW_AT_decl_file   : 9
    <9c0>   DW_AT_decl_line   : 83
    <9c1>   DW_AT_decl_column : 12
    <9c2>   DW_AT_type        : <0x2e1>
    <9c6>   DW_AT_data_member_location: 8
 <2><9c7>: Abbrev Number: 3 (DW_TAG_member)
    <9c8>   DW_AT_name        : (indirect string, offset: 0x75f8): APB1CLKDivider
    <9cc>   DW_AT_decl_file   : 9
    <9cd>   DW_AT_decl_line   : 86
    <9ce>   DW_AT_decl_column : 12
    <9cf>   DW_AT_type        : <0x2e1>
    <9d3>   DW_AT_data_member_location: 12
 <2><9d4>: Abbrev Number: 3 (DW_TAG_member)
    <9d5>   DW_AT_name        : (indirect string, offset: 0x59ac2): APB2CLKDivider
    <9d9>   DW_AT_decl_file   : 9
    <9da>   DW_AT_decl_line   : 89
    <9db>   DW_AT_decl_column : 12
    <9dc>   DW_AT_type        : <0x2e1>
    <9e0>   DW_AT_data_member_location: 16
 <2><9e1>: Abbrev Number: 0
 <1><9e2>: Abbrev Number: 7 (DW_TAG_typedef)
    <9e3>   DW_AT_name        : (indirect string, offset: 0x88af6): RCC_ClkInitTypeDef
    <9e7>   DW_AT_decl_file   : 9
    <9e8>   DW_AT_decl_line   : 92
    <9e9>   DW_AT_decl_column : 3
    <9ea>   DW_AT_type        : <0x998>
 <1><9ee>: Abbrev Number: 16 (DW_TAG_structure_type)
    <9ef>   DW_AT_byte_size   : 20
    <9f0>   DW_AT_decl_file   : 10
    <9f1>   DW_AT_decl_line   : 46
    <9f2>   DW_AT_decl_column : 9
    <9f2>   DW_AT_sibling     : <0xa38>
 <2><9f6>: Abbrev Number: 38 (DW_TAG_member)
    <9f7>   DW_AT_name        : Pin
    <9fb>   DW_AT_decl_file   : 10
    <9fc>   DW_AT_decl_line   : 48
    <9fd>   DW_AT_decl_column : 12
    <9fe>   DW_AT_type        : <0x2e1>
    <a02>   DW_AT_data_member_location: 0
 <2><a03>: Abbrev Number: 3 (DW_TAG_member)
    <a04>   DW_AT_name        : (indirect string, offset: 0xc8b09): Mode
    <a08>   DW_AT_decl_file   : 10
    <a09>   DW_AT_decl_line   : 51
    <a0a>   DW_AT_decl_column : 12
    <a0b>   DW_AT_type        : <0x2e1>
    <a0f>   DW_AT_data_member_location: 4
 <2><a10>: Abbrev Number: 3 (DW_TAG_member)
    <a11>   DW_AT_name        : (indirect string, offset: 0x64840): Pull
    <a15>   DW_AT_decl_file   : 10
    <a16>   DW_AT_decl_line   : 54
    <a17>   DW_AT_decl_column : 12
    <a18>   DW_AT_type        : <0x2e1>
    <a1c>   DW_AT_data_member_location: 8
 <2><a1d>: Abbrev Number: 3 (DW_TAG_member)
    <a1e>   DW_AT_name        : (indirect string, offset: 0x72c8a): Speed
    <a22>   DW_AT_decl_file   : 10
    <a23>   DW_AT_decl_line   : 57
    <a24>   DW_AT_decl_column : 12
    <a25>   DW_AT_type        : <0x2e1>
    <a29>   DW_AT_data_member_location: 12
 <2><a2a>: Abbrev Number: 3 (DW_TAG_member)
    <a2b>   DW_AT_name        : (indirect string, offset: 0x59a83): Alternate
    <a2f>   DW_AT_decl_file   : 10
    <a30>   DW_AT_decl_line   : 60
    <a31>   DW_AT_decl_column : 12
    <a32>   DW_AT_type        : <0x2e1>
    <a36>   DW_AT_data_member_location: 16
 <2><a37>: Abbrev Number: 0
 <1><a38>: Abbrev Number: 7 (DW_TAG_typedef)
    <a39>   DW_AT_name        : (indirect string, offset: 0x99261): GPIO_InitTypeDef
    <a3d>   DW_AT_decl_file   : 10
    <a3e>   DW_AT_decl_line   : 62
    <a3f>   DW_AT_decl_column : 2
    <a40>   DW_AT_type        : <0x9ee>
 <1><a44>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <a45>   DW_AT_encoding    : 7	(unsigned)
    <a46>   DW_AT_byte_size   : 1
    <a47>   DW_AT_type        : <0x263>
    <a4b>   DW_AT_decl_file   : 10
    <a4c>   DW_AT_decl_line   : 68
    <a4d>   DW_AT_decl_column : 1
    <a4e>   DW_AT_sibling     : <0xa5f>
 <2><a52>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a53>   DW_AT_name        : (indirect string, offset: 0x28f2c): GPIO_PIN_RESET
    <a57>   DW_AT_const_value : 0
 <2><a58>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a59>   DW_AT_name        : (indirect string, offset: 0x31da8): GPIO_PIN_SET
    <a5d>   DW_AT_const_value : 1
 <2><a5e>: Abbrev Number: 0
 <1><a5f>: Abbrev Number: 7 (DW_TAG_typedef)
    <a60>   DW_AT_name        : (indirect string, offset: 0xc0fe3): GPIO_PinState
    <a64>   DW_AT_decl_file   : 10
    <a65>   DW_AT_decl_line   : 71
    <a66>   DW_AT_decl_column : 2
    <a67>   DW_AT_type        : <0xa44>
 <1><a6b>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a6c>   DW_AT_byte_size   : 48
    <a6d>   DW_AT_decl_file   : 11
    <a6e>   DW_AT_decl_line   : 48
    <a6f>   DW_AT_decl_column : 9
    <a6f>   DW_AT_sibling     : <0xb10>
 <2><a73>: Abbrev Number: 3 (DW_TAG_member)
    <a74>   DW_AT_name        : (indirect string, offset: 0x659b8): Channel
    <a78>   DW_AT_decl_file   : 11
    <a79>   DW_AT_decl_line   : 50
    <a7a>   DW_AT_decl_column : 12
    <a7b>   DW_AT_type        : <0x2e1>
    <a7f>   DW_AT_data_member_location: 0
 <2><a80>: Abbrev Number: 3 (DW_TAG_member)
    <a81>   DW_AT_name        : (indirect string, offset: 0x48cb0): Direction
    <a85>   DW_AT_decl_file   : 11
    <a86>   DW_AT_decl_line   : 53
    <a87>   DW_AT_decl_column : 12
    <a88>   DW_AT_type        : <0x2e1>
    <a8c>   DW_AT_data_member_location: 4
 <2><a8d>: Abbrev Number: 3 (DW_TAG_member)
    <a8e>   DW_AT_name        : (indirect string, offset: 0xcd2e): PeriphInc
    <a92>   DW_AT_decl_file   : 11
    <a93>   DW_AT_decl_line   : 57
    <a94>   DW_AT_decl_column : 12
    <a95>   DW_AT_type        : <0x2e1>
    <a99>   DW_AT_data_member_location: 8
 <2><a9a>: Abbrev Number: 3 (DW_TAG_member)
    <a9b>   DW_AT_name        : (indirect string, offset: 0x1f22e): MemInc
    <a9f>   DW_AT_decl_file   : 11
    <aa0>   DW_AT_decl_line   : 60
    <aa1>   DW_AT_decl_column : 12
    <aa2>   DW_AT_type        : <0x2e1>
    <aa6>   DW_AT_data_member_location: 12
 <2><aa7>: Abbrev Number: 3 (DW_TAG_member)
    <aa8>   DW_AT_name        : (indirect string, offset: 0x612f2): PeriphDataAlignment
    <aac>   DW_AT_decl_file   : 11
    <aad>   DW_AT_decl_line   : 63
    <aae>   DW_AT_decl_column : 12
    <aaf>   DW_AT_type        : <0x2e1>
    <ab3>   DW_AT_data_member_location: 16
 <2><ab4>: Abbrev Number: 3 (DW_TAG_member)
    <ab5>   DW_AT_name        : (indirect string, offset: 0xb1035): MemDataAlignment
    <ab9>   DW_AT_decl_file   : 11
    <aba>   DW_AT_decl_line   : 66
    <abb>   DW_AT_decl_column : 12
    <abc>   DW_AT_type        : <0x2e1>
    <ac0>   DW_AT_data_member_location: 20
 <2><ac1>: Abbrev Number: 3 (DW_TAG_member)
    <ac2>   DW_AT_name        : (indirect string, offset: 0xc8b09): Mode
    <ac6>   DW_AT_decl_file   : 11
    <ac7>   DW_AT_decl_line   : 69
    <ac8>   DW_AT_decl_column : 12
    <ac9>   DW_AT_type        : <0x2e1>
    <acd>   DW_AT_data_member_location: 24
 <2><ace>: Abbrev Number: 3 (DW_TAG_member)
    <acf>   DW_AT_name        : (indirect string, offset: 0xc7b3a): Priority
    <ad3>   DW_AT_decl_file   : 11
    <ad4>   DW_AT_decl_line   : 74
    <ad5>   DW_AT_decl_column : 12
    <ad6>   DW_AT_type        : <0x2e1>
    <ada>   DW_AT_data_member_location: 28
 <2><adb>: Abbrev Number: 3 (DW_TAG_member)
    <adc>   DW_AT_name        : (indirect string, offset: 0x547a2): FIFOMode
    <ae0>   DW_AT_decl_file   : 11
    <ae1>   DW_AT_decl_line   : 77
    <ae2>   DW_AT_decl_column : 12
    <ae3>   DW_AT_type        : <0x2e1>
    <ae7>   DW_AT_data_member_location: 32
 <2><ae8>: Abbrev Number: 3 (DW_TAG_member)
    <ae9>   DW_AT_name        : (indirect string, offset: 0x94c00): FIFOThreshold
    <aed>   DW_AT_decl_file   : 11
    <aee>   DW_AT_decl_line   : 82
    <aef>   DW_AT_decl_column : 12
    <af0>   DW_AT_type        : <0x2e1>
    <af4>   DW_AT_data_member_location: 36
 <2><af5>: Abbrev Number: 3 (DW_TAG_member)
    <af6>   DW_AT_name        : (indirect string, offset: 0x92f18): MemBurst
    <afa>   DW_AT_decl_file   : 11
    <afb>   DW_AT_decl_line   : 85
    <afc>   DW_AT_decl_column : 12
    <afd>   DW_AT_type        : <0x2e1>
    <b01>   DW_AT_data_member_location: 40
 <2><b02>: Abbrev Number: 3 (DW_TAG_member)
    <b03>   DW_AT_name        : (indirect string, offset: 0x43563): PeriphBurst
    <b07>   DW_AT_decl_file   : 11
    <b08>   DW_AT_decl_line   : 91
    <b09>   DW_AT_decl_column : 12
    <b0a>   DW_AT_type        : <0x2e1>
    <b0e>   DW_AT_data_member_location: 44
 <2><b0f>: Abbrev Number: 0
 <1><b10>: Abbrev Number: 7 (DW_TAG_typedef)
    <b11>   DW_AT_name        : (indirect string, offset: 0x34f13): DMA_InitTypeDef
    <b15>   DW_AT_decl_file   : 11
    <b16>   DW_AT_decl_line   : 96
    <b17>   DW_AT_decl_column : 2
    <b18>   DW_AT_type        : <0xa6b>
 <1><b1c>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <b1d>   DW_AT_encoding    : 7	(unsigned)
    <b1e>   DW_AT_byte_size   : 1
    <b1f>   DW_AT_type        : <0x263>
    <b23>   DW_AT_decl_file   : 11
    <b24>   DW_AT_decl_line   : 103
    <b25>   DW_AT_decl_column : 1
    <b26>   DW_AT_sibling     : <0xb4f>
 <2><b2a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b2b>   DW_AT_name        : (indirect string, offset: 0xc825): HAL_DMA_STATE_RESET
    <b2f>   DW_AT_const_value : 0
 <2><b30>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b31>   DW_AT_name        : (indirect string, offset: 0x36219): HAL_DMA_STATE_READY
    <b35>   DW_AT_const_value : 1
 <2><b36>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b37>   DW_AT_name        : (indirect string, offset: 0x8718a): HAL_DMA_STATE_BUSY
    <b3b>   DW_AT_const_value : 2
 <2><b3c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b3d>   DW_AT_name        : (indirect string, offset: 0xc13e2): HAL_DMA_STATE_TIMEOUT
    <b41>   DW_AT_const_value : 3
 <2><b42>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b43>   DW_AT_name        : (indirect string, offset: 0x9469a): HAL_DMA_STATE_ERROR
    <b47>   DW_AT_const_value : 4
 <2><b48>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b49>   DW_AT_name        : (indirect string, offset: 0x4cb9f): HAL_DMA_STATE_ABORT
    <b4d>   DW_AT_const_value : 5
 <2><b4e>: Abbrev Number: 0
 <1><b4f>: Abbrev Number: 7 (DW_TAG_typedef)
    <b50>   DW_AT_name        : (indirect string, offset: 0xb02fd): HAL_DMA_StateTypeDef
    <b54>   DW_AT_decl_file   : 11
    <b55>   DW_AT_decl_line   : 110
    <b56>   DW_AT_decl_column : 2
    <b57>   DW_AT_type        : <0xb1c>
 <1><b5b>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <b5c>   DW_AT_type        : <0xb4f>
 <1><b60>: Abbrev Number: 36 (DW_TAG_structure_type)
    <b61>   DW_AT_name        : (indirect string, offset: 0xa6790): __DMA_HandleTypeDef
    <b65>   DW_AT_byte_size   : 96
    <b66>   DW_AT_decl_file   : 11
    <b67>   DW_AT_decl_line   : 138
    <b68>   DW_AT_decl_column : 16
    <b68>   DW_AT_sibling     : <0xc23>
 <2><b6c>: Abbrev Number: 3 (DW_TAG_member)
    <b6d>   DW_AT_name        : (indirect string, offset: 0xbdc62): Instance
    <b71>   DW_AT_decl_file   : 11
    <b72>   DW_AT_decl_line   : 140
    <b73>   DW_AT_decl_column : 31
    <b74>   DW_AT_type        : <0xc23>
    <b78>   DW_AT_data_member_location: 0
 <2><b79>: Abbrev Number: 3 (DW_TAG_member)
    <b7a>   DW_AT_name        : (indirect string, offset: 0xa0fd8): Init
    <b7e>   DW_AT_decl_file   : 11
    <b7f>   DW_AT_decl_line   : 142
    <b80>   DW_AT_decl_column : 30
    <b81>   DW_AT_type        : <0xb10>
    <b85>   DW_AT_data_member_location: 4
 <2><b86>: Abbrev Number: 3 (DW_TAG_member)
    <b87>   DW_AT_name        : (indirect string, offset: 0x8b38a): Lock
    <b8b>   DW_AT_decl_file   : 11
    <b8c>   DW_AT_decl_line   : 144
    <b8d>   DW_AT_decl_column : 30
    <b8e>   DW_AT_type        : <0x8b9>
    <b92>   DW_AT_data_member_location: 52
 <2><b93>: Abbrev Number: 3 (DW_TAG_member)
    <b94>   DW_AT_name        : (indirect string, offset: 0x84610): State
    <b98>   DW_AT_decl_file   : 11
    <b99>   DW_AT_decl_line   : 146
    <b9a>   DW_AT_decl_column : 30
    <b9b>   DW_AT_type        : <0xb5b>
    <b9f>   DW_AT_data_member_location: 53
 <2><ba0>: Abbrev Number: 3 (DW_TAG_member)
    <ba1>   DW_AT_name        : (indirect string, offset: 0xba5c0): Parent
    <ba5>   DW_AT_decl_file   : 11
    <ba6>   DW_AT_decl_line   : 148
    <ba7>   DW_AT_decl_column : 31
    <ba8>   DW_AT_type        : <0xc28>
    <bac>   DW_AT_data_member_location: 56
 <2><bad>: Abbrev Number: 3 (DW_TAG_member)
    <bae>   DW_AT_name        : (indirect string, offset: 0xc37d9): XferCpltCallback
    <bb2>   DW_AT_decl_file   : 11
    <bb3>   DW_AT_decl_line   : 150
    <bb4>   DW_AT_decl_column : 33
    <bb5>   DW_AT_type        : <0xc3a>
    <bb9>   DW_AT_data_member_location: 60
 <2><bba>: Abbrev Number: 3 (DW_TAG_member)
    <bbb>   DW_AT_name        : (indirect string, offset: 0x982f3): XferHalfCpltCallback
    <bbf>   DW_AT_decl_file   : 11
    <bc0>   DW_AT_decl_line   : 152
    <bc1>   DW_AT_decl_column : 33
    <bc2>   DW_AT_type        : <0xc3a>
    <bc6>   DW_AT_data_member_location: 64
 <2><bc7>: Abbrev Number: 3 (DW_TAG_member)
    <bc8>   DW_AT_name        : (indirect string, offset: 0x72ed3): XferM1CpltCallback
    <bcc>   DW_AT_decl_file   : 11
    <bcd>   DW_AT_decl_line   : 154
    <bce>   DW_AT_decl_column : 33
    <bcf>   DW_AT_type        : <0xc3a>
    <bd3>   DW_AT_data_member_location: 68
 <2><bd4>: Abbrev Number: 3 (DW_TAG_member)
    <bd5>   DW_AT_name        : (indirect string, offset: 0x5e153): XferM1HalfCpltCallback
    <bd9>   DW_AT_decl_file   : 11
    <bda>   DW_AT_decl_line   : 156
    <bdb>   DW_AT_decl_column : 33
    <bdc>   DW_AT_type        : <0xc3a>
    <be0>   DW_AT_data_member_location: 72
 <2><be1>: Abbrev Number: 3 (DW_TAG_member)
    <be2>   DW_AT_name        : (indirect string, offset: 0x1c9bf): XferErrorCallback
    <be6>   DW_AT_decl_file   : 11
    <be7>   DW_AT_decl_line   : 158
    <be8>   DW_AT_decl_column : 33
    <be9>   DW_AT_type        : <0xc3a>
    <bed>   DW_AT_data_member_location: 76
 <2><bee>: Abbrev Number: 3 (DW_TAG_member)
    <bef>   DW_AT_name        : (indirect string, offset: 0xb6ec7): XferAbortCallback
    <bf3>   DW_AT_decl_file   : 11
    <bf4>   DW_AT_decl_line   : 160
    <bf5>   DW_AT_decl_column : 33
    <bf6>   DW_AT_type        : <0xc3a>
    <bfa>   DW_AT_data_member_location: 80
 <2><bfb>: Abbrev Number: 3 (DW_TAG_member)
    <bfc>   DW_AT_name        : (indirect string, offset: 0xbff44): ErrorCode
    <c00>   DW_AT_decl_file   : 11
    <c01>   DW_AT_decl_line   : 162
    <c02>   DW_AT_decl_column : 30
    <c03>   DW_AT_type        : <0x2ed>
    <c07>   DW_AT_data_member_location: 84
 <2><c08>: Abbrev Number: 3 (DW_TAG_member)
    <c09>   DW_AT_name        : (indirect string, offset: 0x57817): StreamBaseAddress
    <c0d>   DW_AT_decl_file   : 11
    <c0e>   DW_AT_decl_line   : 164
    <c0f>   DW_AT_decl_column : 30
    <c10>   DW_AT_type        : <0x2e1>
    <c14>   DW_AT_data_member_location: 88
 <2><c15>: Abbrev Number: 3 (DW_TAG_member)
    <c16>   DW_AT_name        : (indirect string, offset: 0xa46dc): StreamIndex
    <c1a>   DW_AT_decl_file   : 11
    <c1b>   DW_AT_decl_line   : 166
    <c1c>   DW_AT_decl_column : 30
    <c1d>   DW_AT_type        : <0x2e1>
    <c21>   DW_AT_data_member_location: 92
 <2><c22>: Abbrev Number: 0
 <1><c23>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <c24>   DW_AT_byte_size   : 4
    <c24>   DW_AT_type        : <0x433>
 <1><c28>: Abbrev Number: 47 (DW_TAG_pointer_type)
    <c29>   DW_AT_byte_size   : 4
 <1><c2a>: Abbrev Number: 39 (DW_TAG_subroutine_type)
    <c2b>   DW_AT_prototyped  : 1
    <c2b>   DW_AT_sibling     : <0xc35>
 <2><c2f>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <c30>   DW_AT_type        : <0xc35>
 <2><c34>: Abbrev Number: 0
 <1><c35>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <c36>   DW_AT_byte_size   : 4
    <c36>   DW_AT_type        : <0xb60>
 <1><c3a>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <c3b>   DW_AT_byte_size   : 4
    <c3b>   DW_AT_type        : <0xc2a>
 <1><c3f>: Abbrev Number: 7 (DW_TAG_typedef)
    <c40>   DW_AT_name        : (indirect string, offset: 0xa6792): DMA_HandleTypeDef
    <c44>   DW_AT_decl_file   : 11
    <c45>   DW_AT_decl_line   : 168
    <c46>   DW_AT_decl_column : 2
    <c47>   DW_AT_type        : <0xb60>
 <1><c4b>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <c4c>   DW_AT_encoding    : 7	(unsigned)
    <c4d>   DW_AT_byte_size   : 1
    <c4e>   DW_AT_type        : <0x263>
    <c52>   DW_AT_decl_file   : 12
    <c53>   DW_AT_decl_line   : 50
    <c54>   DW_AT_decl_column : 1
    <c55>   DW_AT_sibling     : <0xc78>
 <2><c59>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c5a>   DW_AT_name        : (indirect string, offset: 0x1c38e): HAL_DAC_STATE_RESET
    <c5e>   DW_AT_const_value : 0
 <2><c5f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c60>   DW_AT_name        : (indirect string, offset: 0xecc4): HAL_DAC_STATE_READY
    <c64>   DW_AT_const_value : 1
 <2><c65>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c66>   DW_AT_name        : (indirect string, offset: 0x8f757): HAL_DAC_STATE_BUSY
    <c6a>   DW_AT_const_value : 2
 <2><c6b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c6c>   DW_AT_name        : (indirect string, offset: 0xb1262): HAL_DAC_STATE_TIMEOUT
    <c70>   DW_AT_const_value : 3
 <2><c71>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c72>   DW_AT_name        : (indirect string, offset: 0x31dee): HAL_DAC_STATE_ERROR
    <c76>   DW_AT_const_value : 4
 <2><c77>: Abbrev Number: 0
 <1><c78>: Abbrev Number: 7 (DW_TAG_typedef)
    <c79>   DW_AT_name        : (indirect string, offset: 0x91dc6): HAL_DAC_StateTypeDef
    <c7d>   DW_AT_decl_file   : 12
    <c7e>   DW_AT_decl_line   : 57
    <c7f>   DW_AT_decl_column : 3
    <c80>   DW_AT_type        : <0xc4b>
 <1><c84>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <c85>   DW_AT_type        : <0xc78>
 <1><c89>: Abbrev Number: 16 (DW_TAG_structure_type)
    <c8a>   DW_AT_byte_size   : 20
    <c8b>   DW_AT_decl_file   : 12
    <c8c>   DW_AT_decl_line   : 65
    <c8d>   DW_AT_decl_column : 9
    <c8d>   DW_AT_sibling     : <0xce0>
 <2><c91>: Abbrev Number: 3 (DW_TAG_member)
    <c92>   DW_AT_name        : (indirect string, offset: 0xbdc62): Instance
    <c96>   DW_AT_decl_file   : 12
    <c97>   DW_AT_decl_line   : 68
    <c98>   DW_AT_decl_column : 32
    <c99>   DW_AT_type        : <0xce0>
    <c9d>   DW_AT_data_member_location: 0
 <2><c9e>: Abbrev Number: 3 (DW_TAG_member)
    <c9f>   DW_AT_name        : (indirect string, offset: 0x84610): State
    <ca3>   DW_AT_decl_file   : 12
    <ca4>   DW_AT_decl_line   : 70
    <ca5>   DW_AT_decl_column : 31
    <ca6>   DW_AT_type        : <0xc84>
    <caa>   DW_AT_data_member_location: 4
 <2><cab>: Abbrev Number: 3 (DW_TAG_member)
    <cac>   DW_AT_name        : (indirect string, offset: 0x8b38a): Lock
    <cb0>   DW_AT_decl_file   : 12
    <cb1>   DW_AT_decl_line   : 72
    <cb2>   DW_AT_decl_column : 31
    <cb3>   DW_AT_type        : <0x8b9>
    <cb7>   DW_AT_data_member_location: 5
 <2><cb8>: Abbrev Number: 3 (DW_TAG_member)
    <cb9>   DW_AT_name        : (indirect string, offset: 0x5a09a): DMA_Handle1
    <cbd>   DW_AT_decl_file   : 12
    <cbe>   DW_AT_decl_line   : 74
    <cbf>   DW_AT_decl_column : 32
    <cc0>   DW_AT_type        : <0xce5>
    <cc4>   DW_AT_data_member_location: 8
 <2><cc5>: Abbrev Number: 3 (DW_TAG_member)
    <cc6>   DW_AT_name        : (indirect string, offset: 0x5a0a6): DMA_Handle2
    <cca>   DW_AT_decl_file   : 12
    <ccb>   DW_AT_decl_line   : 76
    <ccc>   DW_AT_decl_column : 32
    <ccd>   DW_AT_type        : <0xce5>
    <cd1>   DW_AT_data_member_location: 12
 <2><cd2>: Abbrev Number: 3 (DW_TAG_member)
    <cd3>   DW_AT_name        : (indirect string, offset: 0xbff44): ErrorCode
    <cd7>   DW_AT_decl_file   : 12
    <cd8>   DW_AT_decl_line   : 78
    <cd9>   DW_AT_decl_column : 31
    <cda>   DW_AT_type        : <0x2ed>
    <cde>   DW_AT_data_member_location: 16
 <2><cdf>: Abbrev Number: 0
 <1><ce0>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <ce1>   DW_AT_byte_size   : 4
    <ce1>   DW_AT_type        : <0x3cf>
 <1><ce5>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <ce6>   DW_AT_byte_size   : 4
    <ce6>   DW_AT_type        : <0xc3f>
 <1><cea>: Abbrev Number: 7 (DW_TAG_typedef)
    <ceb>   DW_AT_name        : (indirect string, offset: 0x6af1d): DAC_HandleTypeDef
    <cef>   DW_AT_decl_file   : 12
    <cf0>   DW_AT_decl_line   : 96
    <cf1>   DW_AT_decl_column : 3
    <cf2>   DW_AT_type        : <0xc89>
 <1><cf6>: Abbrev Number: 16 (DW_TAG_structure_type)
    <cf7>   DW_AT_byte_size   : 8
    <cf8>   DW_AT_decl_file   : 12
    <cf9>   DW_AT_decl_line   : 101
    <cfa>   DW_AT_decl_column : 9
    <cfa>   DW_AT_sibling     : <0xd19>
 <2><cfe>: Abbrev Number: 3 (DW_TAG_member)
    <cff>   DW_AT_name        : (indirect string, offset: 0x70c3): DAC_Trigger
    <d03>   DW_AT_decl_file   : 12
    <d04>   DW_AT_decl_line   : 103
    <d05>   DW_AT_decl_column : 12
    <d06>   DW_AT_type        : <0x2e1>
    <d0a>   DW_AT_data_member_location: 0
 <2><d0b>: Abbrev Number: 3 (DW_TAG_member)
    <d0c>   DW_AT_name        : (indirect string, offset: 0x5ed0e): DAC_OutputBuffer
    <d10>   DW_AT_decl_file   : 12
    <d11>   DW_AT_decl_line   : 106
    <d12>   DW_AT_decl_column : 12
    <d13>   DW_AT_type        : <0x2e1>
    <d17>   DW_AT_data_member_location: 4
 <2><d18>: Abbrev Number: 0
 <1><d19>: Abbrev Number: 7 (DW_TAG_typedef)
    <d1a>   DW_AT_name        : (indirect string, offset: 0xbfebc): DAC_ChannelConfTypeDef
    <d1e>   DW_AT_decl_file   : 12
    <d1f>   DW_AT_decl_line   : 109
    <d20>   DW_AT_decl_column : 3
    <d21>   DW_AT_type        : <0xcf6>
 <1><d25>: Abbrev Number: 18 (DW_TAG_const_type)
    <d26>   DW_AT_type        : <0xd19>
 <1><d2a>: Abbrev Number: 16 (DW_TAG_structure_type)
    <d2b>   DW_AT_byte_size   : 24
    <d2c>   DW_AT_decl_file   : 13
    <d2d>   DW_AT_decl_line   : 46
    <d2e>   DW_AT_decl_column : 9
    <d2e>   DW_AT_sibling     : <0xd81>
 <2><d32>: Abbrev Number: 3 (DW_TAG_member)
    <d33>   DW_AT_name        : (indirect string, offset: 0xc5192): Prescaler
    <d37>   DW_AT_decl_file   : 13
    <d38>   DW_AT_decl_line   : 48
    <d39>   DW_AT_decl_column : 12
    <d3a>   DW_AT_type        : <0x2e1>
    <d3e>   DW_AT_data_member_location: 0
 <2><d3f>: Abbrev Number: 3 (DW_TAG_member)
    <d40>   DW_AT_name        : (indirect string, offset: 0xb2003): CounterMode
    <d44>   DW_AT_decl_file   : 13
    <d45>   DW_AT_decl_line   : 51
    <d46>   DW_AT_decl_column : 12
    <d47>   DW_AT_type        : <0x2e1>
    <d4b>   DW_AT_data_member_location: 4
 <2><d4c>: Abbrev Number: 3 (DW_TAG_member)
    <d4d>   DW_AT_name        : (indirect string, offset: 0xcec4a): Period
    <d51>   DW_AT_decl_file   : 13
    <d52>   DW_AT_decl_line   : 54
    <d53>   DW_AT_decl_column : 12
    <d54>   DW_AT_type        : <0x2e1>
    <d58>   DW_AT_data_member_location: 8
 <2><d59>: Abbrev Number: 3 (DW_TAG_member)
    <d5a>   DW_AT_name        : (indirect string, offset: 0x4fbcc): ClockDivision
    <d5e>   DW_AT_decl_file   : 13
    <d5f>   DW_AT_decl_line   : 58
    <d60>   DW_AT_decl_column : 12
    <d61>   DW_AT_type        : <0x2e1>
    <d65>   DW_AT_data_member_location: 12
 <2><d66>: Abbrev Number: 3 (DW_TAG_member)
    <d67>   DW_AT_name        : (indirect string, offset: 0x88844): RepetitionCounter
    <d6b>   DW_AT_decl_file   : 13
    <d6c>   DW_AT_decl_line   : 61
    <d6d>   DW_AT_decl_column : 12
    <d6e>   DW_AT_type        : <0x2e1>
    <d72>   DW_AT_data_member_location: 16
 <2><d73>: Abbrev Number: 3 (DW_TAG_member)
    <d74>   DW_AT_name        : (indirect string, offset: 0xb4d12): AutoReloadPreload
    <d78>   DW_AT_decl_file   : 13
    <d79>   DW_AT_decl_line   : 72
    <d7a>   DW_AT_decl_column : 12
    <d7b>   DW_AT_type        : <0x2e1>
    <d7f>   DW_AT_data_member_location: 20
 <2><d80>: Abbrev Number: 0
 <1><d81>: Abbrev Number: 7 (DW_TAG_typedef)
    <d82>   DW_AT_name        : (indirect string, offset: 0x43def): TIM_Base_InitTypeDef
    <d86>   DW_AT_decl_file   : 13
    <d87>   DW_AT_decl_line   : 74
    <d88>   DW_AT_decl_column : 3
    <d89>   DW_AT_type        : <0xd2a>
 <1><d8d>: Abbrev Number: 16 (DW_TAG_structure_type)
    <d8e>   DW_AT_byte_size   : 16
    <d8f>   DW_AT_decl_file   : 13
    <d90>   DW_AT_decl_line   : 198
    <d91>   DW_AT_decl_column : 9
    <d91>   DW_AT_sibling     : <0xdca>
 <2><d95>: Abbrev Number: 3 (DW_TAG_member)
    <d96>   DW_AT_name        : (indirect string, offset: 0x1d6ff): ClockSource
    <d9a>   DW_AT_decl_file   : 13
    <d9b>   DW_AT_decl_line   : 200
    <d9c>   DW_AT_decl_column : 12
    <d9d>   DW_AT_type        : <0x2e1>
    <da1>   DW_AT_data_member_location: 0
 <2><da2>: Abbrev Number: 3 (DW_TAG_member)
    <da3>   DW_AT_name        : (indirect string, offset: 0x6c0a5): ClockPolarity
    <da7>   DW_AT_decl_file   : 13
    <da8>   DW_AT_decl_line   : 202
    <da9>   DW_AT_decl_column : 12
    <daa>   DW_AT_type        : <0x2e1>
    <dae>   DW_AT_data_member_location: 4
 <2><daf>: Abbrev Number: 3 (DW_TAG_member)
    <db0>   DW_AT_name        : (indirect string, offset: 0xacabf): ClockPrescaler
    <db4>   DW_AT_decl_file   : 13
    <db5>   DW_AT_decl_line   : 204
    <db6>   DW_AT_decl_column : 12
    <db7>   DW_AT_type        : <0x2e1>
    <dbb>   DW_AT_data_member_location: 8
 <2><dbc>: Abbrev Number: 3 (DW_TAG_member)
    <dbd>   DW_AT_name        : (indirect string, offset: 0x7dddf): ClockFilter
    <dc1>   DW_AT_decl_file   : 13
    <dc2>   DW_AT_decl_line   : 206
    <dc3>   DW_AT_decl_column : 12
    <dc4>   DW_AT_type        : <0x2e1>
    <dc8>   DW_AT_data_member_location: 12
 <2><dc9>: Abbrev Number: 0
 <1><dca>: Abbrev Number: 7 (DW_TAG_typedef)
    <dcb>   DW_AT_name        : (indirect string, offset: 0x5ff2): TIM_ClockConfigTypeDef
    <dcf>   DW_AT_decl_file   : 13
    <dd0>   DW_AT_decl_line   : 208
    <dd1>   DW_AT_decl_column : 3
    <dd2>   DW_AT_type        : <0xd8d>
 <1><dd6>: Abbrev Number: 18 (DW_TAG_const_type)
    <dd7>   DW_AT_type        : <0xdca>
 <1><ddb>: Abbrev Number: 16 (DW_TAG_structure_type)
    <ddc>   DW_AT_byte_size   : 8
    <ddd>   DW_AT_decl_file   : 13
    <dde>   DW_AT_decl_line   : 231
    <ddf>   DW_AT_decl_column : 9
    <ddf>   DW_AT_sibling     : <0xdfe>
 <2><de3>: Abbrev Number: 3 (DW_TAG_member)
    <de4>   DW_AT_name        : (indirect string, offset: 0x7372a): MasterOutputTrigger
    <de8>   DW_AT_decl_file   : 13
    <de9>   DW_AT_decl_line   : 233
    <dea>   DW_AT_decl_column : 13
    <deb>   DW_AT_type        : <0x2e1>
    <def>   DW_AT_data_member_location: 0
 <2><df0>: Abbrev Number: 3 (DW_TAG_member)
    <df1>   DW_AT_name        : (indirect string, offset: 0x66d0a): MasterSlaveMode
    <df5>   DW_AT_decl_file   : 13
    <df6>   DW_AT_decl_line   : 235
    <df7>   DW_AT_decl_column : 13
    <df8>   DW_AT_type        : <0x2e1>
    <dfc>   DW_AT_data_member_location: 4
 <2><dfd>: Abbrev Number: 0
 <1><dfe>: Abbrev Number: 7 (DW_TAG_typedef)
    <dff>   DW_AT_name        : (indirect string, offset: 0x8d32d): TIM_MasterConfigTypeDef
    <e03>   DW_AT_decl_file   : 13
    <e04>   DW_AT_decl_line   : 242
    <e05>   DW_AT_decl_column : 3
    <e06>   DW_AT_type        : <0xddb>
 <1><e0a>: Abbrev Number: 18 (DW_TAG_const_type)
    <e0b>   DW_AT_type        : <0xdfe>
 <1><e0f>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <e10>   DW_AT_encoding    : 7	(unsigned)
    <e10>   DW_AT_byte_size   : 1
    <e10>   DW_AT_type        : <0x263>
    <e14>   DW_AT_decl_file   : 13
    <e14>   DW_AT_decl_line   : 291
    <e16>   DW_AT_decl_column : 1
    <e16>   DW_AT_sibling     : <0xe39>
 <2><e1a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e1b>   DW_AT_name        : (indirect string, offset: 0xaa20f): HAL_TIM_STATE_RESET
    <e1f>   DW_AT_const_value : 0
 <2><e20>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e21>   DW_AT_name        : (indirect string, offset: 0x6c5b): HAL_TIM_STATE_READY
    <e25>   DW_AT_const_value : 1
 <2><e26>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e27>   DW_AT_name        : (indirect string, offset: 0x31d42): HAL_TIM_STATE_BUSY
    <e2b>   DW_AT_const_value : 2
 <2><e2c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e2d>   DW_AT_name        : (indirect string, offset: 0xa388e): HAL_TIM_STATE_TIMEOUT
    <e31>   DW_AT_const_value : 3
 <2><e32>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e33>   DW_AT_name        : (indirect string, offset: 0x7899c): HAL_TIM_STATE_ERROR
    <e37>   DW_AT_const_value : 4
 <2><e38>: Abbrev Number: 0
 <1><e39>: Abbrev Number: 15 (DW_TAG_typedef)
    <e3a>   DW_AT_name        : (indirect string, offset: 0x80377): HAL_TIM_StateTypeDef
    <e3e>   DW_AT_decl_file   : 13
    <e3f>   DW_AT_decl_line   : 297
    <e41>   DW_AT_decl_column : 3
    <e42>   DW_AT_type        : <0xe0f>
 <1><e46>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <e47>   DW_AT_type        : <0xe39>
 <1><e4b>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <e4c>   DW_AT_encoding    : 7	(unsigned)
    <e4c>   DW_AT_byte_size   : 1
    <e4c>   DW_AT_type        : <0x263>
    <e50>   DW_AT_decl_file   : 13
    <e50>   DW_AT_decl_line   : 303
    <e52>   DW_AT_decl_column : 1
    <e52>   DW_AT_sibling     : <0xe69>
 <2><e56>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e57>   DW_AT_name        : (indirect string, offset: 0x89bee): HAL_TIM_CHANNEL_STATE_RESET
    <e5b>   DW_AT_const_value : 0
 <2><e5c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e5d>   DW_AT_name        : (indirect string, offset: 0x731b5): HAL_TIM_CHANNEL_STATE_READY
    <e61>   DW_AT_const_value : 1
 <2><e62>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e63>   DW_AT_name        : (indirect string, offset: 0x5e2de): HAL_TIM_CHANNEL_STATE_BUSY
    <e67>   DW_AT_const_value : 2
 <2><e68>: Abbrev Number: 0
 <1><e69>: Abbrev Number: 15 (DW_TAG_typedef)
    <e6a>   DW_AT_name        : (indirect string, offset: 0x29893): HAL_TIM_ChannelStateTypeDef
    <e6e>   DW_AT_decl_file   : 13
    <e6f>   DW_AT_decl_line   : 307
    <e71>   DW_AT_decl_column : 3
    <e72>   DW_AT_type        : <0xe4b>
 <1><e76>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <e77>   DW_AT_type        : <0xe69>
 <1><e7b>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <e7c>   DW_AT_encoding    : 7	(unsigned)
    <e7c>   DW_AT_byte_size   : 1
    <e7c>   DW_AT_type        : <0x263>
    <e80>   DW_AT_decl_file   : 13
    <e80>   DW_AT_decl_line   : 313
    <e82>   DW_AT_decl_column : 1
    <e82>   DW_AT_sibling     : <0xe99>
 <2><e86>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e87>   DW_AT_name        : (indirect string, offset: 0x3c2a): HAL_DMA_BURST_STATE_RESET
    <e8b>   DW_AT_const_value : 0
 <2><e8c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e8d>   DW_AT_name        : (indirect string, offset: 0x6bce1): HAL_DMA_BURST_STATE_READY
    <e91>   DW_AT_const_value : 1
 <2><e92>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e93>   DW_AT_name        : (indirect string, offset: 0x425d0): HAL_DMA_BURST_STATE_BUSY
    <e97>   DW_AT_const_value : 2
 <2><e98>: Abbrev Number: 0
 <1><e99>: Abbrev Number: 15 (DW_TAG_typedef)
    <e9a>   DW_AT_name        : (indirect string, offset: 0x1b1ac): HAL_TIM_DMABurstStateTypeDef
    <e9e>   DW_AT_decl_file   : 13
    <e9f>   DW_AT_decl_line   : 317
    <ea1>   DW_AT_decl_column : 3
    <ea2>   DW_AT_type        : <0xe7b>
 <1><ea6>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <ea7>   DW_AT_type        : <0xe99>
 <1><eab>: Abbrev Number: 31 (DW_TAG_enumeration_type)
    <eac>   DW_AT_encoding    : 7	(unsigned)
    <eac>   DW_AT_byte_size   : 1
    <eac>   DW_AT_type        : <0x263>
    <eb0>   DW_AT_decl_file   : 13
    <eb0>   DW_AT_decl_line   : 323
    <eb2>   DW_AT_decl_column : 1
    <eb2>   DW_AT_sibling     : <0xed5>
 <2><eb6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <eb7>   DW_AT_name        : (indirect string, offset: 0x6dde9): HAL_TIM_ACTIVE_CHANNEL_1
    <ebb>   DW_AT_const_value : 1
 <2><ebc>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ebd>   DW_AT_name        : (indirect string, offset: 0x6de02): HAL_TIM_ACTIVE_CHANNEL_2
    <ec1>   DW_AT_const_value : 2
 <2><ec2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ec3>   DW_AT_name        : (indirect string, offset: 0x6de1b): HAL_TIM_ACTIVE_CHANNEL_3
    <ec7>   DW_AT_const_value : 4
 <2><ec8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ec9>   DW_AT_name        : (indirect string, offset: 0x6de34): HAL_TIM_ACTIVE_CHANNEL_4
    <ecd>   DW_AT_const_value : 8
 <2><ece>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ecf>   DW_AT_name        : (indirect string, offset: 0x50cdb): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <ed3>   DW_AT_const_value : 0
 <2><ed4>: Abbrev Number: 0
 <1><ed5>: Abbrev Number: 15 (DW_TAG_typedef)
    <ed6>   DW_AT_name        : (indirect string, offset: 0x659aa): HAL_TIM_ActiveChannel
    <eda>   DW_AT_decl_file   : 13
    <edb>   DW_AT_decl_line   : 329
    <edd>   DW_AT_decl_column : 3
    <ede>   DW_AT_type        : <0xeab>
 <1><ee2>: Abbrev Number: 22 (DW_TAG_structure_type)
    <ee3>   DW_AT_byte_size   : 72
    <ee4>   DW_AT_decl_file   : 13
    <ee5>   DW_AT_decl_line   : 337
    <ee7>   DW_AT_decl_column : 9
    <ee7>   DW_AT_sibling     : <0xf6a>
 <2><eeb>: Abbrev Number: 4 (DW_TAG_member)
    <eec>   DW_AT_name        : (indirect string, offset: 0xbdc62): Instance
    <ef0>   DW_AT_decl_file   : 13
    <ef1>   DW_AT_decl_line   : 340
    <ef3>   DW_AT_decl_column : 39
    <ef4>   DW_AT_type        : <0xf6a>
    <ef8>   DW_AT_data_member_location: 0
 <2><ef9>: Abbrev Number: 4 (DW_TAG_member)
    <efa>   DW_AT_name        : (indirect string, offset: 0xa0fd8): Init
    <efe>   DW_AT_decl_file   : 13
    <eff>   DW_AT_decl_line   : 341
    <f01>   DW_AT_decl_column : 38
    <f02>   DW_AT_type        : <0xd81>
    <f06>   DW_AT_data_member_location: 4
 <2><f07>: Abbrev Number: 4 (DW_TAG_member)
    <f08>   DW_AT_name        : (indirect string, offset: 0x659b8): Channel
    <f0c>   DW_AT_decl_file   : 13
    <f0d>   DW_AT_decl_line   : 342
    <f0f>   DW_AT_decl_column : 38
    <f10>   DW_AT_type        : <0xed5>
    <f14>   DW_AT_data_member_location: 28
 <2><f15>: Abbrev Number: 4 (DW_TAG_member)
    <f16>   DW_AT_name        : (indirect string, offset: 0x75553): hdma
    <f1a>   DW_AT_decl_file   : 13
    <f1b>   DW_AT_decl_line   : 343
    <f1d>   DW_AT_decl_column : 39
    <f1e>   DW_AT_type        : <0xf6f>
    <f22>   DW_AT_data_member_location: 32
 <2><f23>: Abbrev Number: 4 (DW_TAG_member)
    <f24>   DW_AT_name        : (indirect string, offset: 0x8b38a): Lock
    <f28>   DW_AT_decl_file   : 13
    <f29>   DW_AT_decl_line   : 345
    <f2b>   DW_AT_decl_column : 38
    <f2c>   DW_AT_type        : <0x8b9>
    <f30>   DW_AT_data_member_location: 60
 <2><f31>: Abbrev Number: 4 (DW_TAG_member)
    <f32>   DW_AT_name        : (indirect string, offset: 0x84610): State
    <f36>   DW_AT_decl_file   : 13
    <f37>   DW_AT_decl_line   : 346
    <f39>   DW_AT_decl_column : 38
    <f3a>   DW_AT_type        : <0xe46>
    <f3e>   DW_AT_data_member_location: 61
 <2><f3f>: Abbrev Number: 4 (DW_TAG_member)
    <f40>   DW_AT_name        : (indirect string, offset: 0xc9198): ChannelState
    <f44>   DW_AT_decl_file   : 13
    <f45>   DW_AT_decl_line   : 347
    <f47>   DW_AT_decl_column : 38
    <f48>   DW_AT_type        : <0xf8f>
    <f4c>   DW_AT_data_member_location: 62
 <2><f4d>: Abbrev Number: 4 (DW_TAG_member)
    <f4e>   DW_AT_name        : (indirect string, offset: 0xc9751): ChannelNState
    <f52>   DW_AT_decl_file   : 13
    <f53>   DW_AT_decl_line   : 348
    <f55>   DW_AT_decl_column : 38
    <f56>   DW_AT_type        : <0xf8f>
    <f5a>   DW_AT_data_member_location: 66
 <2><f5b>: Abbrev Number: 4 (DW_TAG_member)
    <f5c>   DW_AT_name        : (indirect string, offset: 0xc8d48): DMABurstState
    <f60>   DW_AT_decl_file   : 13
    <f61>   DW_AT_decl_line   : 349
    <f63>   DW_AT_decl_column : 38
    <f64>   DW_AT_type        : <0xea6>
    <f68>   DW_AT_data_member_location: 70
 <2><f69>: Abbrev Number: 0
 <1><f6a>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <f6b>   DW_AT_byte_size   : 4
    <f6b>   DW_AT_type        : <0x7e0>
 <1><f6f>: Abbrev Number: 25 (DW_TAG_array_type)
    <f70>   DW_AT_type        : <0xce5>
    <f74>   DW_AT_sibling     : <0xf7f>
 <2><f78>: Abbrev Number: 28 (DW_TAG_subrange_type)
    <f79>   DW_AT_type        : <0x2b8>
    <f7d>   DW_AT_upper_bound : 6
 <2><f7e>: Abbrev Number: 0
 <1><f7f>: Abbrev Number: 25 (DW_TAG_array_type)
    <f80>   DW_AT_type        : <0xe76>
    <f84>   DW_AT_sibling     : <0xf8f>
 <2><f88>: Abbrev Number: 28 (DW_TAG_subrange_type)
    <f89>   DW_AT_type        : <0x2b8>
    <f8d>   DW_AT_upper_bound : 3
 <2><f8e>: Abbrev Number: 0
 <1><f8f>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <f90>   DW_AT_type        : <0xf7f>
 <1><f94>: Abbrev Number: 15 (DW_TAG_typedef)
    <f95>   DW_AT_name        : (indirect string, offset: 0x43849): TIM_HandleTypeDef
    <f99>   DW_AT_decl_file   : 13
    <f9a>   DW_AT_decl_line   : 380
    <f9c>   DW_AT_decl_column : 3
    <f9d>   DW_AT_type        : <0xee2>
 <1><fa1>: Abbrev Number: 16 (DW_TAG_structure_type)
    <fa2>   DW_AT_byte_size   : 28
    <fa3>   DW_AT_decl_file   : 14
    <fa4>   DW_AT_decl_line   : 46
    <fa5>   DW_AT_decl_column : 9
    <fa5>   DW_AT_sibling     : <0x1005>
 <2><fa9>: Abbrev Number: 3 (DW_TAG_member)
    <faa>   DW_AT_name        : (indirect string, offset: 0xb331b): BaudRate
    <fae>   DW_AT_decl_file   : 14
    <faf>   DW_AT_decl_line   : 48
    <fb0>   DW_AT_decl_column : 12
    <fb1>   DW_AT_type        : <0x2e1>
    <fb5>   DW_AT_data_member_location: 0
 <2><fb6>: Abbrev Number: 3 (DW_TAG_member)
    <fb7>   DW_AT_name        : (indirect string, offset: 0x51cd4): WordLength
    <fbb>   DW_AT_decl_file   : 14
    <fbc>   DW_AT_decl_line   : 54
    <fbd>   DW_AT_decl_column : 12
    <fbe>   DW_AT_type        : <0x2e1>
    <fc2>   DW_AT_data_member_location: 4
 <2><fc3>: Abbrev Number: 3 (DW_TAG_member)
    <fc4>   DW_AT_name        : (indirect string, offset: 0xb370d): StopBits
    <fc8>   DW_AT_decl_file   : 14
    <fc9>   DW_AT_decl_line   : 57
    <fca>   DW_AT_decl_column : 12
    <fcb>   DW_AT_type        : <0x2e1>
    <fcf>   DW_AT_data_member_location: 8
 <2><fd0>: Abbrev Number: 3 (DW_TAG_member)
    <fd1>   DW_AT_name        : (indirect string, offset: 0x46a6a): Parity
    <fd5>   DW_AT_decl_file   : 14
    <fd6>   DW_AT_decl_line   : 60
    <fd7>   DW_AT_decl_column : 12
    <fd8>   DW_AT_type        : <0x2e1>
    <fdc>   DW_AT_data_member_location: 12
 <2><fdd>: Abbrev Number: 3 (DW_TAG_member)
    <fde>   DW_AT_name        : (indirect string, offset: 0xc8b09): Mode
    <fe2>   DW_AT_decl_file   : 14
    <fe3>   DW_AT_decl_line   : 67
    <fe4>   DW_AT_decl_column : 12
    <fe5>   DW_AT_type        : <0x2e1>
    <fe9>   DW_AT_data_member_location: 16
 <2><fea>: Abbrev Number: 3 (DW_TAG_member)
    <feb>   DW_AT_name        : (indirect string, offset: 0x16d6a): HwFlowCtl
    <fef>   DW_AT_decl_file   : 14
    <ff0>   DW_AT_decl_line   : 70
    <ff1>   DW_AT_decl_column : 12
    <ff2>   DW_AT_type        : <0x2e1>
    <ff6>   DW_AT_data_member_location: 20
 <2><ff7>: Abbrev Number: 3 (DW_TAG_member)
    <ff8>   DW_AT_name        : (indirect string, offset: 0xa4187): OverSampling
    <ffc>   DW_AT_decl_file   : 14
    <ffd>   DW_AT_decl_line   : 73
    <ffe>   DW_AT_decl_column : 12
    <fff>   DW_AT_type        : <0x2e1>
    <1003>   DW_AT_data_member_location: 24
 <2><1004>: Abbrev Number: 0
 <1><1005>: Abbrev Number: 7 (DW_TAG_typedef)
    <1006>   DW_AT_name        : (indirect string, offset: 0x37761): UART_InitTypeDef
    <100a>   DW_AT_decl_file   : 14
    <100b>   DW_AT_decl_line   : 75
    <100c>   DW_AT_decl_column : 3
    <100d>   DW_AT_type        : <0xfa1>
 <1><1011>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <1012>   DW_AT_encoding    : 7	(unsigned)
    <1013>   DW_AT_byte_size   : 1
    <1014>   DW_AT_type        : <0x263>
    <1018>   DW_AT_decl_file   : 14
    <1019>   DW_AT_decl_line   : 117
    <101a>   DW_AT_decl_column : 1
    <101b>   DW_AT_sibling     : <0x1050>
 <2><101f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1020>   DW_AT_name        : (indirect string, offset: 0x72e4a): HAL_UART_STATE_RESET
    <1024>   DW_AT_const_value : 0
 <2><1025>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1026>   DW_AT_name        : (indirect string, offset: 0x5ef81): HAL_UART_STATE_READY
    <102a>   DW_AT_const_value : 32
 <2><102b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <102c>   DW_AT_name        : (indirect string, offset: 0xad748): HAL_UART_STATE_BUSY
    <1030>   DW_AT_const_value : 36
 <2><1031>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1032>   DW_AT_name        : (indirect string, offset: 0x232e): HAL_UART_STATE_BUSY_TX
    <1036>   DW_AT_const_value : 33
 <2><1037>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1038>   DW_AT_name        : (indirect string, offset: 0x1742): HAL_UART_STATE_BUSY_RX
    <103c>   DW_AT_const_value : 34
 <2><103d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <103e>   DW_AT_name        : (indirect string, offset: 0x2c6be): HAL_UART_STATE_BUSY_TX_RX
    <1042>   DW_AT_const_value : 35
 <2><1043>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1044>   DW_AT_name        : (indirect string, offset: 0x5ee19): HAL_UART_STATE_TIMEOUT
    <1048>   DW_AT_const_value : 160
 <2><1049>: Abbrev Number: 1 (DW_TAG_enumerator)
    <104a>   DW_AT_name        : (indirect string, offset: 0x7bf79): HAL_UART_STATE_ERROR
    <104e>   DW_AT_const_value : 224
 <2><104f>: Abbrev Number: 0
 <1><1050>: Abbrev Number: 7 (DW_TAG_typedef)
    <1051>   DW_AT_name        : (indirect string, offset: 0x3c316): HAL_UART_StateTypeDef
    <1055>   DW_AT_decl_file   : 14
    <1056>   DW_AT_decl_line   : 135
    <1057>   DW_AT_decl_column : 3
    <1058>   DW_AT_type        : <0x1011>
 <1><105c>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <105d>   DW_AT_type        : <0x1050>
 <1><1061>: Abbrev Number: 7 (DW_TAG_typedef)
    <1062>   DW_AT_name        : (indirect string, offset: 0x504a5): HAL_UART_RxTypeTypeDef
    <1066>   DW_AT_decl_file   : 14
    <1067>   DW_AT_decl_line   : 144
    <1068>   DW_AT_decl_column : 18
    <1069>   DW_AT_type        : <0x2e1>
 <1><106d>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <106e>   DW_AT_type        : <0x1061>
 <1><1072>: Abbrev Number: 7 (DW_TAG_typedef)
    <1073>   DW_AT_name        : (indirect string, offset: 0x18ed5): HAL_UART_RxEventTypeTypeDef
    <1077>   DW_AT_decl_file   : 14
    <1078>   DW_AT_decl_line   : 155
    <1079>   DW_AT_decl_column : 18
    <107a>   DW_AT_type        : <0x2e1>
 <1><107e>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <107f>   DW_AT_type        : <0x1072>
 <1><1083>: Abbrev Number: 36 (DW_TAG_structure_type)
    <1084>   DW_AT_name        : (indirect string, offset: 0x713ad): __UART_HandleTypeDef
    <1088>   DW_AT_byte_size   : 72
    <1089>   DW_AT_decl_file   : 14
    <108a>   DW_AT_decl_line   : 160
    <108b>   DW_AT_decl_column : 16
    <108b>   DW_AT_sibling     : <0x1160>
 <2><108f>: Abbrev Number: 3 (DW_TAG_member)
    <1090>   DW_AT_name        : (indirect string, offset: 0xbdc62): Instance
    <1094>   DW_AT_decl_file   : 14
    <1095>   DW_AT_decl_line   : 162
    <1096>   DW_AT_decl_column : 34
    <1097>   DW_AT_type        : <0x1160>
    <109b>   DW_AT_data_member_location: 0
 <2><109c>: Abbrev Number: 3 (DW_TAG_member)
    <109d>   DW_AT_name        : (indirect string, offset: 0xa0fd8): Init
    <10a1>   DW_AT_decl_file   : 14
    <10a2>   DW_AT_decl_line   : 164
    <10a3>   DW_AT_decl_column : 33
    <10a4>   DW_AT_type        : <0x1005>
    <10a8>   DW_AT_data_member_location: 4
 <2><10a9>: Abbrev Number: 3 (DW_TAG_member)
    <10aa>   DW_AT_name        : (indirect string, offset: 0x5d956): pTxBuffPtr
    <10ae>   DW_AT_decl_file   : 14
    <10af>   DW_AT_decl_line   : 166
    <10b0>   DW_AT_decl_column : 34
    <10b1>   DW_AT_type        : <0x1165>
    <10b5>   DW_AT_data_member_location: 32
 <2><10b6>: Abbrev Number: 3 (DW_TAG_member)
    <10b7>   DW_AT_name        : (indirect string, offset: 0x52869): TxXferSize
    <10bb>   DW_AT_decl_file   : 14
    <10bc>   DW_AT_decl_line   : 168
    <10bd>   DW_AT_decl_column : 33
    <10be>   DW_AT_type        : <0x2d0>
    <10c2>   DW_AT_data_member_location: 36
 <2><10c3>: Abbrev Number: 3 (DW_TAG_member)
    <10c4>   DW_AT_name        : (indirect string, offset: 0x5ec96): TxXferCount
    <10c8>   DW_AT_decl_file   : 14
    <10c9>   DW_AT_decl_line   : 170
    <10ca>   DW_AT_decl_column : 33
    <10cb>   DW_AT_type        : <0x2dc>
    <10cf>   DW_AT_data_member_location: 38
 <2><10d0>: Abbrev Number: 3 (DW_TAG_member)
    <10d1>   DW_AT_name        : (indirect string, offset: 0xb60c4): pRxBuffPtr
    <10d5>   DW_AT_decl_file   : 14
    <10d6>   DW_AT_decl_line   : 172
    <10d7>   DW_AT_decl_column : 34
    <10d8>   DW_AT_type        : <0x116a>
    <10dc>   DW_AT_data_member_location: 40
 <2><10dd>: Abbrev Number: 3 (DW_TAG_member)
    <10de>   DW_AT_name        : (indirect string, offset: 0x61389): RxXferSize
    <10e2>   DW_AT_decl_file   : 14
    <10e3>   DW_AT_decl_line   : 174
    <10e4>   DW_AT_decl_column : 33
    <10e5>   DW_AT_type        : <0x2d0>
    <10e9>   DW_AT_data_member_location: 44
 <2><10ea>: Abbrev Number: 3 (DW_TAG_member)
    <10eb>   DW_AT_name        : (indirect string, offset: 0x7576b): RxXferCount
    <10ef>   DW_AT_decl_file   : 14
    <10f0>   DW_AT_decl_line   : 176
    <10f1>   DW_AT_decl_column : 33
    <10f2>   DW_AT_type        : <0x2dc>
    <10f6>   DW_AT_data_member_location: 46
 <2><10f7>: Abbrev Number: 3 (DW_TAG_member)
    <10f8>   DW_AT_name        : (indirect string, offset: 0x98ed2): ReceptionType
    <10fc>   DW_AT_decl_file   : 14
    <10fd>   DW_AT_decl_line   : 178
    <10fe>   DW_AT_decl_column : 31
    <10ff>   DW_AT_type        : <0x106d>
    <1103>   DW_AT_data_member_location: 48
 <2><1104>: Abbrev Number: 3 (DW_TAG_member)
    <1105>   DW_AT_name        : (indirect string, offset: 0xc992f): RxEventType
    <1109>   DW_AT_decl_file   : 14
    <110a>   DW_AT_decl_line   : 180
    <110b>   DW_AT_decl_column : 36
    <110c>   DW_AT_type        : <0x107e>
    <1110>   DW_AT_data_member_location: 52
 <2><1111>: Abbrev Number: 3 (DW_TAG_member)
    <1112>   DW_AT_name        : (indirect string, offset: 0xbf327): hdmatx
    <1116>   DW_AT_decl_file   : 14
    <1117>   DW_AT_decl_line   : 182
    <1118>   DW_AT_decl_column : 34
    <1119>   DW_AT_type        : <0xce5>
    <111d>   DW_AT_data_member_location: 56
 <2><111e>: Abbrev Number: 3 (DW_TAG_member)
    <111f>   DW_AT_name        : (indirect string, offset: 0xbe5d6): hdmarx
    <1123>   DW_AT_decl_file   : 14
    <1124>   DW_AT_decl_line   : 184
    <1125>   DW_AT_decl_column : 34
    <1126>   DW_AT_type        : <0xce5>
    <112a>   DW_AT_data_member_location: 60
 <2><112b>: Abbrev Number: 3 (DW_TAG_member)
    <112c>   DW_AT_name        : (indirect string, offset: 0x8b38a): Lock
    <1130>   DW_AT_decl_file   : 14
    <1131>   DW_AT_decl_line   : 186
    <1132>   DW_AT_decl_column : 33
    <1133>   DW_AT_type        : <0x8b9>
    <1137>   DW_AT_data_member_location: 64
 <2><1138>: Abbrev Number: 3 (DW_TAG_member)
    <1139>   DW_AT_name        : (indirect string, offset: 0x4fb08): gState
    <113d>   DW_AT_decl_file   : 14
    <113e>   DW_AT_decl_line   : 188
    <113f>   DW_AT_decl_column : 33
    <1140>   DW_AT_type        : <0x105c>
    <1144>   DW_AT_data_member_location: 65
 <2><1145>: Abbrev Number: 3 (DW_TAG_member)
    <1146>   DW_AT_name        : (indirect string, offset: 0x5a55): RxState
    <114a>   DW_AT_decl_file   : 14
    <114b>   DW_AT_decl_line   : 192
    <114c>   DW_AT_decl_column : 33
    <114d>   DW_AT_type        : <0x105c>
    <1151>   DW_AT_data_member_location: 66
 <2><1152>: Abbrev Number: 3 (DW_TAG_member)
    <1153>   DW_AT_name        : (indirect string, offset: 0xbff44): ErrorCode
    <1157>   DW_AT_decl_file   : 14
    <1158>   DW_AT_decl_line   : 195
    <1159>   DW_AT_decl_column : 33
    <115a>   DW_AT_type        : <0x2ed>
    <115e>   DW_AT_data_member_location: 68
 <2><115f>: Abbrev Number: 0
 <1><1160>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <1161>   DW_AT_byte_size   : 4
    <1161>   DW_AT_type        : <0x84b>
 <1><1165>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <1166>   DW_AT_byte_size   : 4
    <1166>   DW_AT_type        : <0x2cb>
 <1><116a>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <116b>   DW_AT_byte_size   : 4
    <116b>   DW_AT_type        : <0x2bf>
 <1><116f>: Abbrev Number: 7 (DW_TAG_typedef)
    <1170>   DW_AT_name        : (indirect string, offset: 0x713af): UART_HandleTypeDef
    <1174>   DW_AT_decl_file   : 14
    <1175>   DW_AT_decl_line   : 213
    <1176>   DW_AT_decl_column : 3
    <1177>   DW_AT_type        : <0x1083>
 <1><117b>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <117c>   DW_AT_byte_size   : 4
    <117c>   DW_AT_type        : <0x1180>
 <1><1180>: Abbrev Number: 39 (DW_TAG_subroutine_type)
    <1181>   DW_AT_prototyped  : 1
    <1181>   DW_AT_sibling     : <0x118b>
 <2><1185>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <1186>   DW_AT_type        : <0xc28>
 <2><118a>: Abbrev Number: 0
 <1><118b>: Abbrev Number: 7 (DW_TAG_typedef)
    <118c>   DW_AT_name        : (indirect string, offset: 0x6b9bc): StackType_t
    <1190>   DW_AT_decl_file   : 15
    <1191>   DW_AT_decl_line   : 55
    <1192>   DW_AT_decl_column : 24
    <1193>   DW_AT_type        : <0x2e1>
 <1><1197>: Abbrev Number: 7 (DW_TAG_typedef)
    <1198>   DW_AT_name        : (indirect string, offset: 0x157f): UBaseType_t
    <119c>   DW_AT_decl_file   : 15
    <119d>   DW_AT_decl_line   : 57
    <119e>   DW_AT_decl_column : 23
    <119f>   DW_AT_type        : <0x297>
 <1><11a3>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <11a4>   DW_AT_type        : <0x1197>
 <1><11a8>: Abbrev Number: 18 (DW_TAG_const_type)
    <11a9>   DW_AT_type        : <0x1197>
 <1><11ad>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <11ae>   DW_AT_byte_size   : 4
    <11ae>   DW_AT_type        : <0x11b2>
 <1><11b2>: Abbrev Number: 19 (DW_TAG_base_type)
    <11b3>   DW_AT_byte_size   : 1
    <11b4>   DW_AT_encoding    : 8	(unsigned char)
    <11b5>   DW_AT_name        : (indirect string, offset: 0x3fcf6): char
 <1><11b9>: Abbrev Number: 18 (DW_TAG_const_type)
    <11ba>   DW_AT_type        : <0x11b2>
 <1><11be>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <11bf>   DW_AT_byte_size   : 4
    <11bf>   DW_AT_type        : <0x11b9>
 <1><11c3>: Abbrev Number: 7 (DW_TAG_typedef)
    <11c4>   DW_AT_name        : (indirect string, offset: 0x9838d): TaskHandle_t
    <11c8>   DW_AT_decl_file   : 16
    <11c9>   DW_AT_decl_line   : 70
    <11ca>   DW_AT_decl_column : 37
    <11cb>   DW_AT_type        : <0x11cf>
 <1><11cf>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <11d0>   DW_AT_byte_size   : 4
    <11d0>   DW_AT_type        : <0x11d4>
 <1><11d4>: Abbrev Number: 48 (DW_TAG_structure_type)
    <11d5>   DW_AT_name        : (indirect string, offset: 0xa632f): tskTaskControlBlock
    <11d9>   DW_AT_declaration : 1
 <1><11d9>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <11da>   DW_AT_encoding    : 7	(unsigned)
    <11db>   DW_AT_byte_size   : 1
    <11dc>   DW_AT_type        : <0x263>
    <11e0>   DW_AT_decl_file   : 16
    <11e1>   DW_AT_decl_line   : 80
    <11e2>   DW_AT_decl_column : 1
    <11e3>   DW_AT_sibling     : <0x120c>
 <2><11e7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <11e8>   DW_AT_name        : (indirect string, offset: 0x58c45): eRunning
    <11ec>   DW_AT_const_value : 0
 <2><11ed>: Abbrev Number: 1 (DW_TAG_enumerator)
    <11ee>   DW_AT_name        : (indirect string, offset: 0x4c6dc): eReady
    <11f2>   DW_AT_const_value : 1
 <2><11f3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <11f4>   DW_AT_name        : (indirect string, offset: 0x42b79): eBlocked
    <11f8>   DW_AT_const_value : 2
 <2><11f9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <11fa>   DW_AT_name        : (indirect string, offset: 0x71853): eSuspended
    <11fe>   DW_AT_const_value : 3
 <2><11ff>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1200>   DW_AT_name        : (indirect string, offset: 0x90504): eDeleted
    <1204>   DW_AT_const_value : 4
 <2><1205>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1206>   DW_AT_name        : (indirect string, offset: 0x1fff0): eInvalid
    <120a>   DW_AT_const_value : 5
 <2><120b>: Abbrev Number: 0
 <1><120c>: Abbrev Number: 7 (DW_TAG_typedef)
    <120d>   DW_AT_name        : (indirect string, offset: 0x6df6): eTaskState
    <1211>   DW_AT_decl_file   : 16
    <1212>   DW_AT_decl_line   : 87
    <1213>   DW_AT_decl_column : 3
    <1214>   DW_AT_type        : <0x11d9>
 <1><1218>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <1219>   DW_AT_byte_size   : 4
    <1219>   DW_AT_type        : <0x118b>
 <1><121d>: Abbrev Number: 36 (DW_TAG_structure_type)
    <121e>   DW_AT_name        : (indirect string, offset: 0x8719d): xTASK_STATUS
    <1222>   DW_AT_byte_size   : 36
    <1223>   DW_AT_decl_file   : 16
    <1224>   DW_AT_decl_line   : 137
    <1225>   DW_AT_decl_column : 16
    <1225>   DW_AT_sibling     : <0x129f>
 <2><1229>: Abbrev Number: 3 (DW_TAG_member)
    <122a>   DW_AT_name        : (indirect string, offset: 0x80a35): xHandle
    <122e>   DW_AT_decl_file   : 16
    <122f>   DW_AT_decl_line   : 139
    <1230>   DW_AT_decl_column : 15
    <1231>   DW_AT_type        : <0x11c3>
    <1235>   DW_AT_data_member_location: 0
 <2><1236>: Abbrev Number: 3 (DW_TAG_member)
    <1237>   DW_AT_name        : (indirect string, offset: 0x435ab): pcTaskName
    <123b>   DW_AT_decl_file   : 16
    <123c>   DW_AT_decl_line   : 140
    <123d>   DW_AT_decl_column : 14
    <123e>   DW_AT_type        : <0x11be>
    <1242>   DW_AT_data_member_location: 4
 <2><1243>: Abbrev Number: 3 (DW_TAG_member)
    <1244>   DW_AT_name        : (indirect string, offset: 0xce035): xTaskNumber
    <1248>   DW_AT_decl_file   : 16
    <1249>   DW_AT_decl_line   : 141
    <124a>   DW_AT_decl_column : 14
    <124b>   DW_AT_type        : <0x1197>
    <124f>   DW_AT_data_member_location: 8
 <2><1250>: Abbrev Number: 3 (DW_TAG_member)
    <1251>   DW_AT_name        : (indirect string, offset: 0x1bb1): eCurrentState
    <1255>   DW_AT_decl_file   : 16
    <1256>   DW_AT_decl_line   : 142
    <1257>   DW_AT_decl_column : 13
    <1258>   DW_AT_type        : <0x120c>
    <125c>   DW_AT_data_member_location: 12
 <2><125d>: Abbrev Number: 3 (DW_TAG_member)
    <125e>   DW_AT_name        : (indirect string, offset: 0x9219): uxCurrentPriority
    <1262>   DW_AT_decl_file   : 16
