Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x964 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 19 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x2dd15): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -Og -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0xbb783): ../Core/Src/freertos.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x29a5d): /home/lth/src/stm32fun/stm32world_freertos/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 20 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 6 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 4
    <33>   DW_AT_encoding    : 7	(unsigned)
    <34>   DW_AT_name        : (indirect string, offset: 0xf468): unsigned int
 <1><38>: Abbrev Number: 6 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x5654c): long long int
 <1><3f>: Abbrev Number: 6 (DW_TAG_base_type)

 <1><4d>: Abbrev Number: 5 (DW_TAG_typedef)
    <4e>   DW_AT_name        : (indirect string, offset: 0x37193): __uint8_t
    <52>   DW_AT_decl_file   : 2
    <53>   DW_AT_decl_line   : 43
    <54>   DW_AT_decl_column : 24
    <55>   DW_AT_type        : <0x59>
 <1><59>: Abbrev Number: 6 (DW_TAG_base_type)
    <5a>   DW_AT_byte_size   : 1
    <5b>   DW_AT_encoding    : 8	(unsigned char)
    <5c>   DW_AT_name        : (indirect string, offset: 0xb6f0e): unsigned char
 <1><60>: Abbrev Number: 6 (DW_TAG_base_type)
    <61>   DW_AT_byte_size   : 2
    <62>   DW_AT_encoding    : 5	(signed)
    <63>   DW_AT_name        : (indirect string, offset: 0x8ceb4): short int
 <1><67>: Abbrev Number: 5 (DW_TAG_typedef)
    <68>   DW_AT_name        : (indirect string, offset: 0x9a8f9): __uint16_t
    <6c>   DW_AT_decl_file   : 2
    <6d>   DW_AT_decl_line   : 57
    <6e>   DW_AT_decl_column : 25
    <6f>   DW_AT_type        : <0x73>
 <1><73>: Abbrev Number: 6 (DW_TAG_base_type)
    <74>   DW_AT_byte_size   : 2
    <75>   DW_AT_encoding    : 7	(unsigned)
    <76>   DW_AT_name        : (indirect string, offset: 0xb58a7): short unsigned int
 <1><7a>: Abbrev Number: 6 (DW_TAG_base_type)
    <7b>   DW_AT_byte_size   : 4
    <7c>   DW_AT_encoding    : 5	(signed)
    <7d>   DW_AT_name        : (indirect string, offset: 0xfd74): long int
 <1><81>: Abbrev Number: 5 (DW_TAG_typedef)
    <82>   DW_AT_name        : (indirect string, offset: 0x7848e): __uint32_t
    <86>   DW_AT_decl_file   : 2
    <87>   DW_AT_decl_line   : 79
    <88>   DW_AT_decl_column : 25
    <89>   DW_AT_type        : <0x8d>
 <1><8d>: Abbrev Number: 6 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0x48465): long unsigned int
 <1><94>: Abbrev Number: 6 (DW_TAG_base_type)
    <95>   DW_AT_byte_size   : 8
    <96>   DW_AT_encoding    : 7	(unsigned)
    <97>   DW_AT_name        : (indirect string, offset: 0x27a9e): long long unsigned int
 <1><9b>: Abbrev Number: 5 (DW_TAG_typedef)
    <9c>   DW_AT_name        : (indirect string, offset: 0x37195): uint8_t
    <a0>   DW_AT_decl_file   : 3
    <a1>   DW_AT_decl_line   : 24
    <a2>   DW_AT_decl_column : 19
    <a3>   DW_AT_type        : <0x4d>
 <1><a7>: Abbrev Number: 5 (DW_TAG_typedef)
    <a8>   DW_AT_name        : (indirect string, offset: 0x89c7a): uint16_t
    <ac>   DW_AT_decl_file   : 3
    <ad>   DW_AT_decl_line   : 36
    <ae>   DW_AT_decl_column : 20
    <af>   DW_AT_type        : <0x67>
 <1><b3>: Abbrev Number: 5 (DW_TAG_typedef)
    <b4>   DW_AT_name        : (indirect string, offset: 0x893eb): uint32_t
    <b8>   DW_AT_decl_file   : 3
    <b9>   DW_AT_decl_line   : 48
    <ba>   DW_AT_decl_column : 20
    <bb>   DW_AT_type        : <0x81>
 <1><bf>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <c0>   DW_AT_byte_size   : 4
 <1><c1>: Abbrev Number: 5 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0x67f79): StackType_t
    <c6>   DW_AT_decl_file   : 4
    <c7>   DW_AT_decl_line   : 55
    <c8>   DW_AT_decl_column : 24
    <c9>   DW_AT_type        : <0xb3>
 <1><cd>: Abbrev Number: 5 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x14b8): UBaseType_t
    <d2>   DW_AT_decl_file   : 4
    <d3>   DW_AT_decl_line   : 57
    <d4>   DW_AT_decl_column : 23
    <d5>   DW_AT_type        : <0x8d>
 <1><d9>: Abbrev Number: 5 (DW_TAG_typedef)
    <da>   DW_AT_name        : (indirect string, offset: 0x2974c): TickType_t
    <de>   DW_AT_decl_file   : 4
    <df>   DW_AT_decl_line   : 63
    <e0>   DW_AT_decl_column : 19
    <e1>   DW_AT_type        : <0xb3>
 <1><e5>: Abbrev Number: 11 (DW_TAG_typedef)
    <e6>   DW_AT_name        : (indirect string, offset: 0x8af95): wint_t
    <ea>   DW_AT_decl_file   : 5
    <eb>   DW_AT_decl_line   : 359
    <ed>   DW_AT_decl_column : 23
    <ee>   DW_AT_type        : <0x31>
 <1><f2>: Abbrev Number: 5 (DW_TAG_typedef)
    <f3>   DW_AT_name        : (indirect string, offset: 0xc4939): _off_t
    <f7>   DW_AT_decl_file   : 6
    <f8>   DW_AT_decl_line   : 46
    <f9>   DW_AT_decl_column : 14
    <fa>   DW_AT_type        : <0x7a>
 <1><fe>: Abbrev Number: 5 (DW_TAG_typedef)
    <ff>   DW_AT_name        : (indirect string, offset: 0x2a511): _fpos_t
    <103>   DW_AT_decl_file   : 6
    <104>   DW_AT_decl_line   : 116
    <105>   DW_AT_decl_column : 14
    <106>   DW_AT_type        : <0x7a>
 <1><10a>: Abbrev Number: 22 (DW_TAG_union_type)
    <10b>   DW_AT_byte_size   : 4
    <10c>   DW_AT_decl_file   : 6
    <10d>   DW_AT_decl_line   : 165
    <10e>   DW_AT_decl_column : 3
    <10f>   DW_AT_sibling     : <0x12a>
 <2><113>: Abbrev Number: 15 (DW_TAG_member)
    <114>   DW_AT_name        : (indirect string, offset: 0x90c1e): __wch
    <118>   DW_AT_decl_file   : 6
    <118>   DW_AT_decl_line   : 167
    <119>   DW_AT_decl_column : 12
    <11a>   DW_AT_type        : <0xe5>
 <2><11e>: Abbrev Number: 15 (DW_TAG_member)
    <11f>   DW_AT_name        : (indirect string, offset: 0x612d3): __wchb
    <123>   DW_AT_decl_file   : 6
    <123>   DW_AT_decl_line   : 168
    <124>   DW_AT_decl_column : 19
    <125>   DW_AT_type        : <0x12a>
 <2><129>: Abbrev Number: 0
 <1><12a>: Abbrev Number: 7 (DW_TAG_array_type)
    <12b>   DW_AT_type        : <0x59>
    <12f>   DW_AT_sibling     : <0x13a>
 <2><133>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <134>   DW_AT_type        : <0x31>
    <138>   DW_AT_upper_bound : 3
 <2><139>: Abbrev Number: 0
 <1><13a>: Abbrev Number: 23 (DW_TAG_structure_type)
    <13b>   DW_AT_byte_size   : 8
    <13c>   DW_AT_decl_file   : 6
    <13d>   DW_AT_decl_line   : 162
    <13e>   DW_AT_decl_column : 9
    <13f>   DW_AT_sibling     : <0x15e>
 <2><143>: Abbrev Number: 2 (DW_TAG_member)
    <144>   DW_AT_name        : (indirect string, offset: 0x357a7): __count
    <148>   DW_AT_decl_file   : 6
    <149>   DW_AT_decl_line   : 164
    <14a>   DW_AT_decl_column : 7
    <14b>   DW_AT_type        : <0x2a>
    <14f>   DW_AT_data_member_location: 0
 <2><150>: Abbrev Number: 2 (DW_TAG_member)
    <151>   DW_AT_name        : (indirect string, offset: 0x6c226): __value
    <155>   DW_AT_decl_file   : 6
    <156>   DW_AT_decl_line   : 169
    <157>   DW_AT_decl_column : 5
    <158>   DW_AT_type        : <0x10a>
    <15c>   DW_AT_data_member_location: 4
 <2><15d>: Abbrev Number: 0
 <1><15e>: Abbrev Number: 5 (DW_TAG_typedef)
    <15f>   DW_AT_name        : (indirect string, offset: 0x62d16): _mbstate_t
    <163>   DW_AT_decl_file   : 6
    <164>   DW_AT_decl_line   : 170
    <165>   DW_AT_decl_column : 3
    <166>   DW_AT_type        : <0x13a>
 <1><16a>: Abbrev Number: 5 (DW_TAG_typedef)
    <16b>   DW_AT_name        : (indirect string, offset: 0x661e7): __ULong
    <16f>   DW_AT_decl_file   : 7
    <170>   DW_AT_decl_line   : 22
    <171>   DW_AT_decl_column : 25
    <172>   DW_AT_type        : <0x8d>
 <1><176>: Abbrev Number: 5 (DW_TAG_typedef)
    <177>   DW_AT_name        : (indirect string, offset: 0x676b5): _LOCK_T
    <17b>   DW_AT_decl_file   : 8
    <17c>   DW_AT_decl_line   : 34
    <17d>   DW_AT_decl_column : 25
    <17e>   DW_AT_type        : <0x182>
 <1><182>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <183>   DW_AT_byte_size   : 4
    <183>   DW_AT_type        : <0x187>
 <1><187>: Abbrev Number: 16 (DW_TAG_structure_type)
    <188>   DW_AT_name        : (indirect string, offset: 0x18749): __lock
    <18c>   DW_AT_declaration : 1
 <1><18c>: Abbrev Number: 5 (DW_TAG_typedef)
    <18d>   DW_AT_name        : (indirect string, offset: 0x5d297): _flock_t
    <191>   DW_AT_decl_file   : 7
    <192>   DW_AT_decl_line   : 35
    <193>   DW_AT_decl_column : 27
    <194>   DW_AT_type        : <0x176>
 <1><198>: Abbrev Number: 12 (DW_TAG_structure_type)
    <199>   DW_AT_name        : (indirect string, offset: 0x41e77): _Bigint
    <19d>   DW_AT_byte_size   : 24
    <19e>   DW_AT_decl_file   : 7
    <19e>   DW_AT_decl_line   : 52
    <19f>   DW_AT_decl_column : 8
    <19f>   DW_AT_sibling     : <0x1ee>
 <2><1a3>: Abbrev Number: 2 (DW_TAG_member)
    <1a4>   DW_AT_name        : (indirect string, offset: 0x7094f): _next
    <1a8>   DW_AT_decl_file   : 7
    <1a9>   DW_AT_decl_line   : 54
    <1aa>   DW_AT_decl_column : 19
    <1ab>   DW_AT_type        : <0x1ee>
    <1af>   DW_AT_data_member_location: 0
 <2><1b0>: Abbrev Number: 9 (DW_TAG_member)
    <1b1>   DW_AT_name        : _k
    <1b4>   DW_AT_decl_file   : 7
    <1b4>   DW_AT_decl_line   : 55
    <1b5>   DW_AT_decl_column : 7
    <1b6>   DW_AT_type        : <0x2a>
    <1ba>   DW_AT_data_member_location: 4
 <2><1bb>: Abbrev Number: 2 (DW_TAG_member)
    <1bc>   DW_AT_name        : (indirect string, offset: 0x872ab): _maxwds
    <1c0>   DW_AT_decl_file   : 7
    <1c1>   DW_AT_decl_line   : 55
    <1c2>   DW_AT_decl_column : 11
    <1c3>   DW_AT_type        : <0x2a>
    <1c7>   DW_AT_data_member_location: 8
 <2><1c8>: Abbrev Number: 2 (DW_TAG_member)
    <1c9>   DW_AT_name        : (indirect string, offset: 0x64677): _sign
    <1cd>   DW_AT_decl_file   : 7
    <1ce>   DW_AT_decl_line   : 55
    <1cf>   DW_AT_decl_column : 20
    <1d0>   DW_AT_type        : <0x2a>
    <1d4>   DW_AT_data_member_location: 12
 <2><1d5>: Abbrev Number: 2 (DW_TAG_member)
    <1d6>   DW_AT_name        : (indirect string, offset: 0x64194): _wds
    <1da>   DW_AT_decl_file   : 7
    <1db>   DW_AT_decl_line   : 55
    <1dc>   DW_AT_decl_column : 27
    <1dd>   DW_AT_type        : <0x2a>
    <1e1>   DW_AT_data_member_location: 16
 <2><1e2>: Abbrev Number: 9 (DW_TAG_member)
    <1e3>   DW_AT_name        : _x
    <1e6>   DW_AT_decl_file   : 7
    <1e6>   DW_AT_decl_line   : 56
    <1e7>   DW_AT_decl_column : 11
    <1e8>   DW_AT_type        : <0x1f3>
    <1ec>   DW_AT_data_member_location: 20
 <2><1ed>: Abbrev Number: 0
 <1><1ee>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <1ef>   DW_AT_byte_size   : 4
    <1ef>   DW_AT_type        : <0x198>
 <1><1f3>: Abbrev Number: 7 (DW_TAG_array_type)
    <1f4>   DW_AT_type        : <0x16a>
    <1f8>   DW_AT_sibling     : <0x203>
 <2><1fc>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <1fd>   DW_AT_type        : <0x31>
    <201>   DW_AT_upper_bound : 0
 <2><202>: Abbrev Number: 0
 <1><203>: Abbrev Number: 12 (DW_TAG_structure_type)
    <204>   DW_AT_name        : (indirect string, offset: 0x33fcf): __tm
    <208>   DW_AT_byte_size   : 36
    <209>   DW_AT_decl_file   : 7
    <209>   DW_AT_decl_line   : 60
    <20a>   DW_AT_decl_column : 8
    <20a>   DW_AT_sibling     : <0x284>
 <2><20e>: Abbrev Number: 2 (DW_TAG_member)
    <20f>   DW_AT_name        : (indirect string, offset: 0x9af9d): __tm_sec
    <213>   DW_AT_decl_file   : 7
    <214>   DW_AT_decl_line   : 62
    <215>   DW_AT_decl_column : 9
    <216>   DW_AT_type        : <0x2a>
    <21a>   DW_AT_data_member_location: 0
 <2><21b>: Abbrev Number: 2 (DW_TAG_member)
    <21c>   DW_AT_name        : (indirect string, offset: 0xb59): __tm_min
    <220>   DW_AT_decl_file   : 7
    <221>   DW_AT_decl_line   : 63
    <222>   DW_AT_decl_column : 9
    <223>   DW_AT_type        : <0x2a>
    <227>   DW_AT_data_member_location: 4
 <2><228>: Abbrev Number: 2 (DW_TAG_member)
    <229>   DW_AT_name        : (indirect string, offset: 0x28ac2): __tm_hour
    <22d>   DW_AT_decl_file   : 7
    <22e>   DW_AT_decl_line   : 64
    <22f>   DW_AT_decl_column : 9
    <230>   DW_AT_type        : <0x2a>
    <234>   DW_AT_data_member_location: 8
 <2><235>: Abbrev Number: 2 (DW_TAG_member)
    <236>   DW_AT_name        : (indirect string, offset: 0x6ec54): __tm_mday
    <23a>   DW_AT_decl_file   : 7
    <23b>   DW_AT_decl_line   : 65
    <23c>   DW_AT_decl_column : 9
    <23d>   DW_AT_type        : <0x2a>
    <241>   DW_AT_data_member_location: 12
 <2><242>: Abbrev Number: 2 (DW_TAG_member)
    <243>   DW_AT_name        : (indirect string, offset: 0x31c6): __tm_mon
    <247>   DW_AT_decl_file   : 7
    <248>   DW_AT_decl_line   : 66
    <249>   DW_AT_decl_column : 9
    <24a>   DW_AT_type        : <0x2a>
    <24e>   DW_AT_data_member_location: 16
 <2><24f>: Abbrev Number: 2 (DW_TAG_member)
    <250>   DW_AT_name        : (indirect string, offset: 0xb0505): __tm_year
    <254>   DW_AT_decl_file   : 7
    <255>   DW_AT_decl_line   : 67
    <256>   DW_AT_decl_column : 9
    <257>   DW_AT_type        : <0x2a>
    <25b>   DW_AT_data_member_location: 20
 <2><25c>: Abbrev Number: 2 (DW_TAG_member)
    <25d>   DW_AT_name        : (indirect string, offset: 0x4ff01): __tm_wday
    <261>   DW_AT_decl_file   : 7
    <262>   DW_AT_decl_line   : 68
    <263>   DW_AT_decl_column : 9
    <264>   DW_AT_type        : <0x2a>
    <268>   DW_AT_data_member_location: 24
 <2><269>: Abbrev Number: 2 (DW_TAG_member)
    <26a>   DW_AT_name        : (indirect string, offset: 0x95bbb): __tm_yday
    <26e>   DW_AT_decl_file   : 7
    <26f>   DW_AT_decl_line   : 69
    <270>   DW_AT_decl_column : 9
    <271>   DW_AT_type        : <0x2a>
    <275>   DW_AT_data_member_location: 28
 <2><276>: Abbrev Number: 2 (DW_TAG_member)
    <277>   DW_AT_name        : (indirect string, offset: 0xaa768): __tm_isdst
    <27b>   DW_AT_decl_file   : 7
    <27c>   DW_AT_decl_line   : 70
    <27d>   DW_AT_decl_column : 9
    <27e>   DW_AT_type        : <0x2a>
    <282>   DW_AT_data_member_location: 32
 <2><283>: Abbrev Number: 0
 <1><284>: Abbrev Number: 12 (DW_TAG_structure_type)
    <285>   DW_AT_name        : (indirect string, offset: 0x7e114): __sbuf
    <289>   DW_AT_byte_size   : 8
    <28a>   DW_AT_decl_file   : 7
    <28a>   DW_AT_decl_line   : 115
    <28b>   DW_AT_decl_column : 8
    <28b>   DW_AT_sibling     : <0x2aa>
 <2><28f>: Abbrev Number: 2 (DW_TAG_member)
    <290>   DW_AT_name        : (indirect string, offset: 0xbcb27): _base
    <294>   DW_AT_decl_file   : 7
    <295>   DW_AT_decl_line   : 116
    <296>   DW_AT_decl_column : 17
    <297>   DW_AT_type        : <0x2aa>
    <29b>   DW_AT_data_member_location: 0
 <2><29c>: Abbrev Number: 2 (DW_TAG_member)
    <29d>   DW_AT_name        : (indirect string, offset: 0xc4147): _size
    <2a1>   DW_AT_decl_file   : 7
    <2a2>   DW_AT_decl_line   : 117
    <2a3>   DW_AT_decl_column : 6
    <2a4>   DW_AT_type        : <0x2a>
    <2a8>   DW_AT_data_member_location: 4
 <2><2a9>: Abbrev Number: 0
 <1><2aa>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <2ab>   DW_AT_byte_size   : 4
    <2ab>   DW_AT_type        : <0x59>
 <1><2af>: Abbrev Number: 12 (DW_TAG_structure_type)
    <2b0>   DW_AT_name        : (indirect string, offset: 0x9092a): __sFILE
    <2b4>   DW_AT_byte_size   : 104
    <2b5>   DW_AT_decl_file   : 7
    <2b5>   DW_AT_decl_line   : 152
    <2b6>   DW_AT_decl_column : 8
    <2b6>   DW_AT_sibling     : <0x3e8>
 <2><2ba>: Abbrev Number: 9 (DW_TAG_member)
    <2bb>   DW_AT_name        : _p
    <2be>   DW_AT_decl_file   : 7
    <2be>   DW_AT_decl_line   : 153
    <2bf>   DW_AT_decl_column : 18
    <2c0>   DW_AT_type        : <0x2aa>
    <2c4>   DW_AT_data_member_location: 0
 <2><2c5>: Abbrev Number: 9 (DW_TAG_member)
    <2c6>   DW_AT_name        : _r
    <2c9>   DW_AT_decl_file   : 7
    <2c9>   DW_AT_decl_line   : 154
    <2ca>   DW_AT_decl_column : 7
    <2cb>   DW_AT_type        : <0x2a>
    <2cf>   DW_AT_data_member_location: 4
 <2><2d0>: Abbrev Number: 9 (DW_TAG_member)
    <2d1>   DW_AT_name        : _w
    <2d4>   DW_AT_decl_file   : 7
    <2d4>   DW_AT_decl_line   : 155
    <2d5>   DW_AT_decl_column : 7
    <2d6>   DW_AT_type        : <0x2a>
    <2da>   DW_AT_data_member_location: 8
 <2><2db>: Abbrev Number: 2 (DW_TAG_member)
    <2dc>   DW_AT_name        : (indirect string, offset: 0x565f7): _flags
    <2e0>   DW_AT_decl_file   : 7
    <2e1>   DW_AT_decl_line   : 156
    <2e2>   DW_AT_decl_column : 9
    <2e3>   DW_AT_type        : <0x60>
    <2e7>   DW_AT_data_member_location: 12
 <2><2e8>: Abbrev Number: 2 (DW_TAG_member)
    <2e9>   DW_AT_name        : (indirect string, offset: 0x1ccef): _file
    <2ed>   DW_AT_decl_file   : 7
    <2ee>   DW_AT_decl_line   : 157
    <2ef>   DW_AT_decl_column : 9
    <2f0>   DW_AT_type        : <0x60>
    <2f4>   DW_AT_data_member_location: 14
 <2><2f5>: Abbrev Number: 9 (DW_TAG_member)
    <2f6>   DW_AT_name        : _bf
    <2fa>   DW_AT_decl_file   : 7
    <2fa>   DW_AT_decl_line   : 158
    <2fb>   DW_AT_decl_column : 17
    <2fc>   DW_AT_type        : <0x284>
    <300>   DW_AT_data_member_location: 16
 <2><301>: Abbrev Number: 2 (DW_TAG_member)
    <302>   DW_AT_name        : (indirect string, offset: 0x56bfd): _lbfsize
    <306>   DW_AT_decl_file   : 7
    <307>   DW_AT_decl_line   : 159
    <308>   DW_AT_decl_column : 7
    <309>   DW_AT_type        : <0x2a>
    <30d>   DW_AT_data_member_location: 24
 <2><30e>: Abbrev Number: 2 (DW_TAG_member)
    <30f>   DW_AT_name        : (indirect string, offset: 0xc8294): _data
    <313>   DW_AT_decl_file   : 7
    <314>   DW_AT_decl_line   : 162
    <315>   DW_AT_decl_column : 18
    <316>   DW_AT_type        : <0x501>
    <31a>   DW_AT_data_member_location: 28
 <2><31b>: Abbrev Number: 2 (DW_TAG_member)
    <31c>   DW_AT_name        : (indirect string, offset: 0x3279d): _cookie
    <320>   DW_AT_decl_file   : 7
    <321>   DW_AT_decl_line   : 166
    <322>   DW_AT_decl_column : 10
    <323>   DW_AT_type        : <0xbf>
    <327>   DW_AT_data_member_location: 32
 <2><328>: Abbrev Number: 2 (DW_TAG_member)
    <329>   DW_AT_name        : (indirect string, offset: 0x952c0): _read
    <32d>   DW_AT_decl_file   : 7
    <32e>   DW_AT_decl_line   : 168
    <32f>   DW_AT_decl_column : 29
    <330>   DW_AT_type        : <0x535>
    <334>   DW_AT_data_member_location: 36
 <2><335>: Abbrev Number: 2 (DW_TAG_member)
    <336>   DW_AT_name        : (indirect string, offset: 0x1877f): _write
    <33a>   DW_AT_decl_file   : 7
    <33b>   DW_AT_decl_line   : 170
    <33c>   DW_AT_decl_column : 29
    <33d>   DW_AT_type        : <0x55d>
    <341>   DW_AT_data_member_location: 40
 <2><342>: Abbrev Number: 2 (DW_TAG_member)
    <343>   DW_AT_name        : (indirect string, offset: 0xba64c): _seek
    <347>   DW_AT_decl_file   : 7
    <348>   DW_AT_decl_line   : 173
    <349>   DW_AT_decl_column : 13
    <34a>   DW_AT_type        : <0x580>
    <34e>   DW_AT_data_member_location: 44
 <2><34f>: Abbrev Number: 2 (DW_TAG_member)
    <350>   DW_AT_name        : (indirect string, offset: 0x52fbe): _close
    <354>   DW_AT_decl_file   : 7
    <355>   DW_AT_decl_line   : 174
    <356>   DW_AT_decl_column : 9
    <357>   DW_AT_type        : <0x599>
    <35b>   DW_AT_data_member_location: 48
 <2><35c>: Abbrev Number: 9 (DW_TAG_member)
    <35d>   DW_AT_name        : _ub
    <361>   DW_AT_decl_file   : 7
    <361>   DW_AT_decl_line   : 177
    <362>   DW_AT_decl_column : 17
    <363>   DW_AT_type        : <0x284>
    <367>   DW_AT_data_member_location: 52
 <2><368>: Abbrev Number: 9 (DW_TAG_member)
    <369>   DW_AT_name        : _up
    <36d>   DW_AT_decl_file   : 7
    <36d>   DW_AT_decl_line   : 178
    <36e>   DW_AT_decl_column : 18
    <36f>   DW_AT_type        : <0x2aa>
    <373>   DW_AT_data_member_location: 60
 <2><374>: Abbrev Number: 9 (DW_TAG_member)
    <375>   DW_AT_name        : _ur
    <379>   DW_AT_decl_file   : 7
    <379>   DW_AT_decl_line   : 179
    <37a>   DW_AT_decl_column : 7
    <37b>   DW_AT_type        : <0x2a>
    <37f>   DW_AT_data_member_location: 64
 <2><380>: Abbrev Number: 2 (DW_TAG_member)
    <381>   DW_AT_name        : (indirect string, offset: 0xb7f5c): _ubuf
    <385>   DW_AT_decl_file   : 7
    <386>   DW_AT_decl_line   : 182
    <387>   DW_AT_decl_column : 17
    <388>   DW_AT_type        : <0x59e>
    <38c>   DW_AT_data_member_location: 68
 <2><38d>: Abbrev Number: 2 (DW_TAG_member)
    <38e>   DW_AT_name        : (indirect string, offset: 0x8056a): _nbuf
    <392>   DW_AT_decl_file   : 7
    <393>   DW_AT_decl_line   : 183
    <394>   DW_AT_decl_column : 17
    <395>   DW_AT_type        : <0x5ae>
    <399>   DW_AT_data_member_location: 71
 <2><39a>: Abbrev Number: 9 (DW_TAG_member)
    <39b>   DW_AT_name        : _lb
    <39f>   DW_AT_decl_file   : 7
    <39f>   DW_AT_decl_line   : 186
    <3a0>   DW_AT_decl_column : 17
    <3a1>   DW_AT_type        : <0x284>
    <3a5>   DW_AT_data_member_location: 72
 <2><3a6>: Abbrev Number: 2 (DW_TAG_member)
    <3a7>   DW_AT_name        : (indirect string, offset: 0xc3c42): _blksize
    <3ab>   DW_AT_decl_file   : 7
    <3ac>   DW_AT_decl_line   : 189
    <3ad>   DW_AT_decl_column : 7
    <3ae>   DW_AT_type        : <0x2a>
    <3b2>   DW_AT_data_member_location: 80
 <2><3b3>: Abbrev Number: 2 (DW_TAG_member)
    <3b4>   DW_AT_name        : (indirect string, offset: 0x3d07d): _offset
    <3b8>   DW_AT_decl_file   : 7
    <3b9>   DW_AT_decl_line   : 190
    <3ba>   DW_AT_decl_column : 10
    <3bb>   DW_AT_type        : <0xf2>
    <3bf>   DW_AT_data_member_location: 84
 <2><3c0>: Abbrev Number: 2 (DW_TAG_member)
    <3c1>   DW_AT_name        : (indirect string, offset: 0x1874a): _lock
    <3c5>   DW_AT_decl_file   : 7
    <3c6>   DW_AT_decl_line   : 197
    <3c7>   DW_AT_decl_column : 12
    <3c8>   DW_AT_type        : <0x18c>
    <3cc>   DW_AT_data_member_location: 88
 <2><3cd>: Abbrev Number: 2 (DW_TAG_member)
    <3ce>   DW_AT_name        : (indirect string, offset: 0x52985): _mbstate
    <3d2>   DW_AT_decl_file   : 7
    <3d3>   DW_AT_decl_line   : 199
    <3d4>   DW_AT_decl_column : 14
    <3d5>   DW_AT_type        : <0x15e>
    <3d9>   DW_AT_data_member_location: 92
 <2><3da>: Abbrev Number: 2 (DW_TAG_member)
    <3db>   DW_AT_name        : (indirect string, offset: 0x99e03): _flags2
    <3df>   DW_AT_decl_file   : 7
    <3e0>   DW_AT_decl_line   : 200
    <3e1>   DW_AT_decl_column : 9
    <3e2>   DW_AT_type        : <0x2a>
    <3e6>   DW_AT_data_member_location: 100
 <2><3e7>: Abbrev Number: 0
 <1><3e8>: Abbrev Number: 10 (DW_TAG_structure_type)
    <3e9>   DW_AT_name        : (indirect string, offset: 0xca673): _reent
    <3ed>   DW_AT_byte_size   : 76
    <3ee>   DW_AT_decl_file   : 7
    <3ef>   DW_AT_decl_line   : 375
    <3f1>   DW_AT_decl_column : 8
    <3f2>   DW_AT_sibling     : <0x501>
 <2><3f6>: Abbrev Number: 1 (DW_TAG_member)
    <3f7>   DW_AT_name        : (indirect string, offset: 0xc4366): _errno
    <3fb>   DW_AT_decl_file   : 7
    <3fc>   DW_AT_decl_line   : 379
    <3fe>   DW_AT_decl_column : 7
    <3ff>   DW_AT_type        : <0x2a>
    <403>   DW_AT_data_member_location: 0
 <2><404>: Abbrev Number: 1 (DW_TAG_member)
    <405>   DW_AT_name        : (indirect string, offset: 0x5f8ad): _stdin
    <409>   DW_AT_decl_file   : 7
    <40a>   DW_AT_decl_line   : 384
    <40c>   DW_AT_decl_column : 11
    <40d>   DW_AT_type        : <0x5cb>
    <411>   DW_AT_data_member_location: 4
 <2><412>: Abbrev Number: 1 (DW_TAG_member)
    <413>   DW_AT_name        : (indirect string, offset: 0x81bdb): _stdout
    <417>   DW_AT_decl_file   : 7
    <418>   DW_AT_decl_line   : 384
    <41a>   DW_AT_decl_column : 20
    <41b>   DW_AT_type        : <0x5cb>
    <41f>   DW_AT_data_member_location: 8
 <2><420>: Abbrev Number: 1 (DW_TAG_member)
    <421>   DW_AT_name        : (indirect string, offset: 0xacbfc): _stderr
    <425>   DW_AT_decl_file   : 7
    <426>   DW_AT_decl_line   : 384
    <428>   DW_AT_decl_column : 30
    <429>   DW_AT_type        : <0x5cb>
    <42d>   DW_AT_data_member_location: 12
 <2><42e>: Abbrev Number: 1 (DW_TAG_member)
    <42f>   DW_AT_name        : (indirect string, offset: 0x77a70): _inc
    <433>   DW_AT_decl_file   : 7
    <434>   DW_AT_decl_line   : 386
    <436>   DW_AT_decl_column : 8
    <437>   DW_AT_type        : <0x2a>
    <43b>   DW_AT_data_member_location: 16
 <2><43c>: Abbrev Number: 1 (DW_TAG_member)
    <43d>   DW_AT_name        : (indirect string, offset: 0x955ce): _emergency
    <441>   DW_AT_decl_file   : 7
    <442>   DW_AT_decl_line   : 388
    <444>   DW_AT_decl_column : 9
    <445>   DW_AT_type        : <0x524>
    <449>   DW_AT_data_member_location: 20
 <2><44a>: Abbrev Number: 1 (DW_TAG_member)
    <44b>   DW_AT_name        : (indirect string, offset: 0xa7e50): _locale
    <44f>   DW_AT_decl_file   : 7
    <450>   DW_AT_decl_line   : 394
    <452>   DW_AT_decl_column : 22
    <453>   DW_AT_type        : <0x731>
    <457>   DW_AT_data_member_location: 24
 <2><458>: Abbrev Number: 24 (DW_TAG_member)
    <459>   DW_AT_name        : _mp
    <45d>   DW_AT_decl_file   : 7
    <45e>   DW_AT_decl_line   : 396
    <460>   DW_AT_decl_column : 18
    <461>   DW_AT_type        : <0x736>
    <465>   DW_AT_data_member_location: 28
 <2><466>: Abbrev Number: 1 (DW_TAG_member)
    <467>   DW_AT_name        : (indirect string, offset: 0x1d7ba): __cleanup
    <46b>   DW_AT_decl_file   : 7
    <46c>   DW_AT_decl_line   : 398
    <46e>   DW_AT_decl_column : 10
    <46f>   DW_AT_type        : <0x746>
    <473>   DW_AT_data_member_location: 32
 <2><474>: Abbrev Number: 1 (DW_TAG_member)
    <475>   DW_AT_name        : (indirect string, offset: 0x74a43): _gamma_signgam
    <479>   DW_AT_decl_file   : 7
    <47a>   DW_AT_decl_line   : 400
    <47c>   DW_AT_decl_column : 7
    <47d>   DW_AT_type        : <0x2a>
    <481>   DW_AT_data_member_location: 36
 <2><482>: Abbrev Number: 1 (DW_TAG_member)
    <483>   DW_AT_name        : (indirect string, offset: 0x8ac9b): _cvtlen
    <487>   DW_AT_decl_file   : 7
    <488>   DW_AT_decl_line   : 403
    <48a>   DW_AT_decl_column : 7
    <48b>   DW_AT_type        : <0x2a>
    <48f>   DW_AT_data_member_location: 40
 <2><490>: Abbrev Number: 1 (DW_TAG_member)
    <491>   DW_AT_name        : (indirect string, offset: 0x57741): _cvtbuf
    <495>   DW_AT_decl_file   : 7
    <496>   DW_AT_decl_line   : 404
    <498>   DW_AT_decl_column : 9
    <499>   DW_AT_type        : <0x524>
    <49d>   DW_AT_data_member_location: 44
 <2><49e>: Abbrev Number: 1 (DW_TAG_member)
    <49f>   DW_AT_name        : (indirect string, offset: 0x8d4fd): _r48
    <4a3>   DW_AT_decl_file   : 7
    <4a4>   DW_AT_decl_line   : 406
    <4a6>   DW_AT_decl_column : 19
    <4a7>   DW_AT_type        : <0x74b>
    <4ab>   DW_AT_data_member_location: 48
 <2><4ac>: Abbrev Number: 1 (DW_TAG_member)
    <4ad>   DW_AT_name        : (indirect string, offset: 0x9d32a): _localtime_buf
    <4b1>   DW_AT_decl_file   : 7
    <4b2>   DW_AT_decl_line   : 407
    <4b4>   DW_AT_decl_column : 16
    <4b5>   DW_AT_type        : <0x750>
    <4b9>   DW_AT_data_member_location: 52
 <2><4ba>: Abbrev Number: 1 (DW_TAG_member)
    <4bb>   DW_AT_name        : (indirect string, offset: 0x2d3d7): _asctime_buf
    <4bf>   DW_AT_decl_file   : 7
    <4c0>   DW_AT_decl_line   : 408
    <4c2>   DW_AT_decl_column : 9
    <4c3>   DW_AT_type        : <0x524>
    <4c7>   DW_AT_data_member_location: 56
 <2><4c8>: Abbrev Number: 1 (DW_TAG_member)
    <4c9>   DW_AT_name        : (indirect string, offset: 0x9b3d7): _sig_func
    <4cd>   DW_AT_decl_file   : 7
    <4ce>   DW_AT_decl_line   : 411
    <4d0>   DW_AT_decl_column : 12
    <4d1>   DW_AT_type        : <0x760>
    <4d5>   DW_AT_data_member_location: 60
 <2><4d6>: Abbrev Number: 1 (DW_TAG_member)
    <4d7>   DW_AT_name        : (indirect string, offset: 0x33811): __sf
    <4db>   DW_AT_decl_file   : 7
    <4dc>   DW_AT_decl_line   : 419
    <4de>   DW_AT_decl_column : 11
    <4df>   DW_AT_type        : <0x5cb>
    <4e3>   DW_AT_data_member_location: 64
 <2><4e4>: Abbrev Number: 1 (DW_TAG_member)
    <4e5>   DW_AT_name        : (indirect string, offset: 0x556d8): _misc
    <4e9>   DW_AT_decl_file   : 7
    <4ea>   DW_AT_decl_line   : 420
    <4ec>   DW_AT_decl_column : 23
    <4ed>   DW_AT_type        : <0x76a>
    <4f1>   DW_AT_data_member_location: 68
 <2><4f2>: Abbrev Number: 1 (DW_TAG_member)
    <4f3>   DW_AT_name        : (indirect string, offset: 0x75d06): _signal_buf
    <4f7>   DW_AT_decl_file   : 7
    <4f8>   DW_AT_decl_line   : 421
    <4fa>   DW_AT_decl_column : 9
    <4fb>   DW_AT_type        : <0x524>
    <4ff>   DW_AT_data_member_location: 72
 <2><500>: Abbrev Number: 0
 <1><501>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <502>   DW_AT_byte_size   : 4
    <502>   DW_AT_type        : <0x3e8>
 <1><506>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <507>   DW_AT_prototyped  : 1
    <507>   DW_AT_type        : <0x2a>
    <50b>   DW_AT_sibling     : <0x524>
 <2><50f>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <510>   DW_AT_type        : <0x501>
 <2><514>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <515>   DW_AT_type        : <0xbf>
 <2><519>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <51a>   DW_AT_type        : <0x524>
 <2><51e>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <51f>   DW_AT_type        : <0x2a>
 <2><523>: Abbrev Number: 0
 <1><524>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <525>   DW_AT_byte_size   : 4
    <525>   DW_AT_type        : <0x529>
 <1><529>: Abbrev Number: 6 (DW_TAG_base_type)
    <52a>   DW_AT_byte_size   : 1
    <52b>   DW_AT_encoding    : 8	(unsigned char)
    <52c>   DW_AT_name        : (indirect string, offset: 0x3d4ac): char
 <1><530>: Abbrev Number: 25 (DW_TAG_const_type)
    <531>   DW_AT_type        : <0x529>
 <1><535>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <536>   DW_AT_byte_size   : 4
    <536>   DW_AT_type        : <0x506>
 <1><53a>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <53b>   DW_AT_prototyped  : 1
    <53b>   DW_AT_type        : <0x2a>
    <53f>   DW_AT_sibling     : <0x558>
 <2><543>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <544>   DW_AT_type        : <0x501>
 <2><548>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <549>   DW_AT_type        : <0xbf>
 <2><54d>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <54e>   DW_AT_type        : <0x558>
 <2><552>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <553>   DW_AT_type        : <0x2a>
 <2><557>: Abbrev Number: 0
 <1><558>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <559>   DW_AT_byte_size   : 4
    <559>   DW_AT_type        : <0x530>
 <1><55d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <55e>   DW_AT_byte_size   : 4
    <55e>   DW_AT_type        : <0x53a>
 <1><562>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <563>   DW_AT_prototyped  : 1
    <563>   DW_AT_type        : <0xfe>
    <567>   DW_AT_sibling     : <0x580>
 <2><56b>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <56c>   DW_AT_type        : <0x501>
 <2><570>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <571>   DW_AT_type        : <0xbf>
 <2><575>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <576>   DW_AT_type        : <0xfe>
 <2><57a>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <57b>   DW_AT_type        : <0x2a>
 <2><57f>: Abbrev Number: 0
 <1><580>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <581>   DW_AT_byte_size   : 4
    <581>   DW_AT_type        : <0x562>
 <1><585>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <586>   DW_AT_prototyped  : 1
    <586>   DW_AT_type        : <0x2a>
    <58a>   DW_AT_sibling     : <0x599>
 <2><58e>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <58f>   DW_AT_type        : <0x501>
 <2><593>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <594>   DW_AT_type        : <0xbf>
 <2><598>: Abbrev Number: 0
 <1><599>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <59a>   DW_AT_byte_size   : 4
    <59a>   DW_AT_type        : <0x585>
 <1><59e>: Abbrev Number: 7 (DW_TAG_array_type)
    <59f>   DW_AT_type        : <0x59>
    <5a3>   DW_AT_sibling     : <0x5ae>
 <2><5a7>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <5a8>   DW_AT_type        : <0x31>
    <5ac>   DW_AT_upper_bound : 2
 <2><5ad>: Abbrev Number: 0
 <1><5ae>: Abbrev Number: 7 (DW_TAG_array_type)
    <5af>   DW_AT_type        : <0x59>
    <5b3>   DW_AT_sibling     : <0x5be>
 <2><5b7>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <5b8>   DW_AT_type        : <0x31>
    <5bc>   DW_AT_upper_bound : 0
 <2><5bd>: Abbrev Number: 0
 <1><5be>: Abbrev Number: 11 (DW_TAG_typedef)
    <5bf>   DW_AT_name        : (indirect string, offset: 0x9768f): __FILE
    <5c3>   DW_AT_decl_file   : 7
    <5c4>   DW_AT_decl_line   : 269
    <5c6>   DW_AT_decl_column : 26
    <5c7>   DW_AT_type        : <0x2af>
 <1><5cb>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <5cc>   DW_AT_byte_size   : 4
    <5cc>   DW_AT_type        : <0x5be>
 <1><5d0>: Abbrev Number: 10 (DW_TAG_structure_type)
    <5d1>   DW_AT_name        : (indirect string, offset: 0x41b69): _rand48
    <5d5>   DW_AT_byte_size   : 24
    <5d6>   DW_AT_decl_file   : 7
    <5d7>   DW_AT_decl_line   : 305
    <5d9>   DW_AT_decl_column : 8
    <5da>   DW_AT_sibling     : <0x617>
 <2><5de>: Abbrev Number: 1 (DW_TAG_member)
    <5df>   DW_AT_name        : (indirect string, offset: 0xba5cb): _seed
    <5e3>   DW_AT_decl_file   : 7
    <5e4>   DW_AT_decl_line   : 306
    <5e6>   DW_AT_decl_column : 18
    <5e7>   DW_AT_type        : <0x617>
    <5eb>   DW_AT_data_member_location: 0
 <2><5ec>: Abbrev Number: 1 (DW_TAG_member)
    <5ed>   DW_AT_name        : (indirect string, offset: 0xad598): _mult
    <5f1>   DW_AT_decl_file   : 7
    <5f2>   DW_AT_decl_line   : 307
    <5f4>   DW_AT_decl_column : 18
    <5f5>   DW_AT_type        : <0x617>
    <5f9>   DW_AT_data_member_location: 6
 <2><5fa>: Abbrev Number: 1 (DW_TAG_member)
    <5fb>   DW_AT_name        : (indirect string, offset: 0x61382): _add
    <5ff>   DW_AT_decl_file   : 7
    <600>   DW_AT_decl_line   : 308
    <602>   DW_AT_decl_column : 18
    <603>   DW_AT_type        : <0x73>
    <607>   DW_AT_data_member_location: 12
 <2><608>: Abbrev Number: 1 (DW_TAG_member)
    <609>   DW_AT_name        : (indirect string, offset: 0x7094a): _rand_next
    <60d>   DW_AT_decl_file   : 7
    <60e>   DW_AT_decl_line   : 311
    <610>   DW_AT_decl_column : 36
    <611>   DW_AT_type        : <0x94>
    <615>   DW_AT_data_member_location: 16
 <2><616>: Abbrev Number: 0
 <1><617>: Abbrev Number: 7 (DW_TAG_array_type)
    <618>   DW_AT_type        : <0x73>
    <61c>   DW_AT_sibling     : <0x627>
 <2><620>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <621>   DW_AT_type        : <0x31>
    <625>   DW_AT_upper_bound : 2
 <2><626>: Abbrev Number: 0
 <1><627>: Abbrev Number: 10 (DW_TAG_structure_type)
    <628>   DW_AT_name        : (indirect string, offset: 0x8fd5a): _mprec
    <62c>   DW_AT_byte_size   : 16
    <62d>   DW_AT_decl_file   : 7
    <62e>   DW_AT_decl_line   : 347
    <630>   DW_AT_decl_column : 8
    <631>   DW_AT_sibling     : <0x66e>
 <2><635>: Abbrev Number: 1 (DW_TAG_member)
    <636>   DW_AT_name        : (indirect string, offset: 0xbd6cc): _result
    <63a>   DW_AT_decl_file   : 7
    <63b>   DW_AT_decl_line   : 350
    <63d>   DW_AT_decl_column : 19
    <63e>   DW_AT_type        : <0x1ee>
    <642>   DW_AT_data_member_location: 0
 <2><643>: Abbrev Number: 1 (DW_TAG_member)
    <644>   DW_AT_name        : (indirect string, offset: 0x75d2b): _result_k
    <648>   DW_AT_decl_file   : 7
    <649>   DW_AT_decl_line   : 351
    <64b>   DW_AT_decl_column : 7
    <64c>   DW_AT_type        : <0x2a>
    <650>   DW_AT_data_member_location: 4
 <2><651>: Abbrev Number: 1 (DW_TAG_member)
    <652>   DW_AT_name        : (indirect string, offset: 0x59ef3): _p5s
    <656>   DW_AT_decl_file   : 7
    <657>   DW_AT_decl_line   : 352
    <659>   DW_AT_decl_column : 19
    <65a>   DW_AT_type        : <0x1ee>
    <65e>   DW_AT_data_member_location: 8
 <2><65f>: Abbrev Number: 1 (DW_TAG_member)
    <660>   DW_AT_name        : (indirect string, offset: 0x6d006): _freelist
    <664>   DW_AT_decl_file   : 7
    <665>   DW_AT_decl_line   : 353
    <667>   DW_AT_decl_column : 20
    <668>   DW_AT_type        : <0x66e>
    <66c>   DW_AT_data_member_location: 12
 <2><66d>: Abbrev Number: 0
 <1><66e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <66f>   DW_AT_byte_size   : 4
    <66f>   DW_AT_type        : <0x1ee>
 <1><673>: Abbrev Number: 10 (DW_TAG_structure_type)
    <674>   DW_AT_name        : (indirect string, offset: 0x59e97): _misc_reent
    <678>   DW_AT_byte_size   : 80
    <679>   DW_AT_decl_file   : 7
    <67a>   DW_AT_decl_line   : 357
    <67c>   DW_AT_decl_column : 8
    <67d>   DW_AT_sibling     : <0x71c>
 <2><681>: Abbrev Number: 1 (DW_TAG_member)
    <682>   DW_AT_name        : (indirect string, offset: 0xad419): _strtok_last
    <686>   DW_AT_decl_file   : 7
    <687>   DW_AT_decl_line   : 360
    <689>   DW_AT_decl_column : 9
    <68a>   DW_AT_type        : <0x524>
    <68e>   DW_AT_data_member_location: 0
 <2><68f>: Abbrev Number: 1 (DW_TAG_member)
    <690>   DW_AT_name        : (indirect string, offset: 0x5271f): _mblen_state
    <694>   DW_AT_decl_file   : 7
    <695>   DW_AT_decl_line   : 361
    <697>   DW_AT_decl_column : 14
    <698>   DW_AT_type        : <0x15e>
    <69c>   DW_AT_data_member_location: 4
 <2><69d>: Abbrev Number: 1 (DW_TAG_member)
    <69e>   DW_AT_name        : (indirect string, offset: 0xad448): _wctomb_state
    <6a2>   DW_AT_decl_file   : 7
    <6a3>   DW_AT_decl_line   : 362
    <6a5>   DW_AT_decl_column : 14
    <6a6>   DW_AT_type        : <0x15e>
    <6aa>   DW_AT_data_member_location: 12
 <2><6ab>: Abbrev Number: 1 (DW_TAG_member)
    <6ac>   DW_AT_name        : (indirect string, offset: 0xa143e): _mbtowc_state
    <6b0>   DW_AT_decl_file   : 7
    <6b1>   DW_AT_decl_line   : 363
    <6b3>   DW_AT_decl_column : 14
    <6b4>   DW_AT_type        : <0x15e>
    <6b8>   DW_AT_data_member_location: 20
 <2><6b9>: Abbrev Number: 1 (DW_TAG_member)
    <6ba>   DW_AT_name        : (indirect string, offset: 0xa7018): _l64a_buf
    <6be>   DW_AT_decl_file   : 7
    <6bf>   DW_AT_decl_line   : 364
    <6c1>   DW_AT_decl_column : 8
    <6c2>   DW_AT_type        : <0x71c>
    <6c6>   DW_AT_data_member_location: 28
 <2><6c7>: Abbrev Number: 1 (DW_TAG_member)
    <6c8>   DW_AT_name        : (indirect string, offset: 0xabffe): _getdate_err
    <6cc>   DW_AT_decl_file   : 7
    <6cd>   DW_AT_decl_line   : 365
    <6cf>   DW_AT_decl_column : 7
    <6d0>   DW_AT_type        : <0x2a>
    <6d4>   DW_AT_data_member_location: 36
 <2><6d5>: Abbrev Number: 1 (DW_TAG_member)
    <6d6>   DW_AT_name        : (indirect string, offset: 0x5b1f8): _mbrlen_state
    <6da>   DW_AT_decl_file   : 7
    <6db>   DW_AT_decl_line   : 366
    <6dd>   DW_AT_decl_column : 14
    <6de>   DW_AT_type        : <0x15e>
    <6e2>   DW_AT_data_member_location: 40
 <2><6e3>: Abbrev Number: 1 (DW_TAG_member)
    <6e4>   DW_AT_name        : (indirect string, offset: 0xac512): _mbrtowc_state
    <6e8>   DW_AT_decl_file   : 7
    <6e9>   DW_AT_decl_line   : 367
    <6eb>   DW_AT_decl_column : 14
    <6ec>   DW_AT_type        : <0x15e>
    <6f0>   DW_AT_data_member_location: 48
 <2><6f1>: Abbrev Number: 1 (DW_TAG_member)
    <6f2>   DW_AT_name        : (indirect string, offset: 0x35af8): _mbsrtowcs_state
    <6f6>   DW_AT_decl_file   : 7
    <6f7>   DW_AT_decl_line   : 368
    <6f9>   DW_AT_decl_column : 14
    <6fa>   DW_AT_type        : <0x15e>
    <6fe>   DW_AT_data_member_location: 56
 <2><6ff>: Abbrev Number: 1 (DW_TAG_member)
    <700>   DW_AT_name        : (indirect string, offset: 0x3a8d7): _wcrtomb_state
    <704>   DW_AT_decl_file   : 7
    <705>   DW_AT_decl_line   : 369
    <707>   DW_AT_decl_column : 14
    <708>   DW_AT_type        : <0x15e>
    <70c>   DW_AT_data_member_location: 64
 <2><70d>: Abbrev Number: 1 (DW_TAG_member)
    <70e>   DW_AT_name        : (indirect string, offset: 0x6b22c): _wcsrtombs_state
    <712>   DW_AT_decl_file   : 7
    <713>   DW_AT_decl_line   : 370
    <715>   DW_AT_decl_column : 14
    <716>   DW_AT_type        : <0x15e>
    <71a>   DW_AT_data_member_location: 72
 <2><71b>: Abbrev Number: 0
 <1><71c>: Abbrev Number: 7 (DW_TAG_array_type)
    <71d>   DW_AT_type        : <0x529>
    <721>   DW_AT_sibling     : <0x72c>
 <2><725>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <726>   DW_AT_type        : <0x31>
    <72a>   DW_AT_upper_bound : 7
 <2><72b>: Abbrev Number: 0
 <1><72c>: Abbrev Number: 16 (DW_TAG_structure_type)
    <72d>   DW_AT_name        : (indirect string, offset: 0x695aa): __locale_t
    <731>   DW_AT_declaration : 1
 <1><731>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <732>   DW_AT_byte_size   : 4
    <732>   DW_AT_type        : <0x72c>
 <1><736>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <737>   DW_AT_byte_size   : 4
    <737>   DW_AT_type        : <0x627>
 <1><73b>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <73c>   DW_AT_prototyped  : 1
    <73c>   DW_AT_sibling     : <0x746>
 <2><740>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <741>   DW_AT_type        : <0x501>
 <2><745>: Abbrev Number: 0
 <1><746>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <747>   DW_AT_byte_size   : 4
    <747>   DW_AT_type        : <0x73b>
 <1><74b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <74c>   DW_AT_byte_size   : 4
    <74c>   DW_AT_type        : <0x5d0>
 <1><750>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <751>   DW_AT_byte_size   : 4
    <751>   DW_AT_type        : <0x203>
 <1><755>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <756>   DW_AT_prototyped  : 1
    <756>   DW_AT_sibling     : <0x760>
 <2><75a>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <75b>   DW_AT_type        : <0x2a>
 <2><75f>: Abbrev Number: 0
 <1><760>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <761>   DW_AT_byte_size   : 4
    <761>   DW_AT_type        : <0x765>
 <1><765>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <766>   DW_AT_byte_size   : 4
    <766>   DW_AT_type        : <0x755>
 <1><76a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <76b>   DW_AT_byte_size   : 4
    <76b>   DW_AT_type        : <0x673>
 <1><76f>: Abbrev Number: 10 (DW_TAG_structure_type)
    <770>   DW_AT_name        : (indirect string, offset: 0x9e234): xSTATIC_LIST_ITEM
    <774>   DW_AT_byte_size   : 20
    <775>   DW_AT_decl_file   : 9
    <776>   DW_AT_decl_line   : 1061
    <778>   DW_AT_decl_column : 8
    <779>   DW_AT_sibling     : <0x79a>
 <2><77d>: Abbrev Number: 1 (DW_TAG_member)
    <77e>   DW_AT_name        : (indirect string, offset: 0xbf042): xDummy2
    <782>   DW_AT_decl_file   : 9
    <783>   DW_AT_decl_line   : 1066
    <785>   DW_AT_decl_column : 13
    <786>   DW_AT_type        : <0xd9>
    <78a>   DW_AT_data_member_location: 0
 <2><78b>: Abbrev Number: 1 (DW_TAG_member)
    <78c>   DW_AT_name        : (indirect string, offset: 0x4428a): pvDummy3
    <790>   DW_AT_decl_file   : 9
    <791>   DW_AT_decl_line   : 1067
    <793>   DW_AT_decl_column : 8
    <794>   DW_AT_type        : <0x79a>
    <798>   DW_AT_data_member_location: 4
 <2><799>: Abbrev Number: 0
 <1><79a>: Abbrev Number: 7 (DW_TAG_array_type)
    <79b>   DW_AT_type        : <0xbf>
    <79f>   DW_AT_sibling     : <0x7aa>
 <2><7a3>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <7a4>   DW_AT_type        : <0x31>
    <7a8>   DW_AT_upper_bound : 3
 <2><7a9>: Abbrev Number: 0
 <1><7aa>: Abbrev Number: 11 (DW_TAG_typedef)
    <7ab>   DW_AT_name        : (indirect string, offset: 0x44533): StaticListItem_t
    <7af>   DW_AT_decl_file   : 9
    <7b0>   DW_AT_decl_line   : 1072
    <7b2>   DW_AT_decl_column : 34
    <7b3>   DW_AT_type        : <0x76f>
 <1><7b7>: Abbrev Number: 10 (DW_TAG_structure_type)
    <7b8>   DW_AT_name        : (indirect string, offset: 0x6bf5c): xSTATIC_TCB
    <7bc>   DW_AT_byte_size   : 172
    <7bd>   DW_AT_decl_file   : 9
    <7be>   DW_AT_decl_line   : 1112
    <7c0>   DW_AT_decl_column : 16
    <7c1>   DW_AT_sibling     : <0x87c>
 <2><7c5>: Abbrev Number: 1 (DW_TAG_member)
    <7c6>   DW_AT_name        : (indirect string, offset: 0x26c0a): pxDummy1
    <7ca>   DW_AT_decl_file   : 9
    <7cb>   DW_AT_decl_line   : 1114
    <7cd>   DW_AT_decl_column : 11
    <7ce>   DW_AT_type        : <0xbf>
    <7d2>   DW_AT_data_member_location: 0
 <2><7d3>: Abbrev Number: 1 (DW_TAG_member)
    <7d4>   DW_AT_name        : (indirect string, offset: 0x244e4): xDummy3
    <7d8>   DW_AT_decl_file   : 9
    <7d9>   DW_AT_decl_line   : 1118
    <7db>   DW_AT_decl_column : 19
    <7dc>   DW_AT_type        : <0x87c>
    <7e0>   DW_AT_data_member_location: 4
 <2><7e1>: Abbrev Number: 1 (DW_TAG_member)
    <7e2>   DW_AT_name        : (indirect string, offset: 0x1a671): uxDummy5
    <7e6>   DW_AT_decl_file   : 9
    <7e7>   DW_AT_decl_line   : 1119
    <7e9>   DW_AT_decl_column : 16
    <7ea>   DW_AT_type        : <0xcd>
    <7ee>   DW_AT_data_member_location: 44
 <2><7ef>: Abbrev Number: 1 (DW_TAG_member)
    <7f0>   DW_AT_name        : (indirect string, offset: 0x26c4d): pxDummy6
    <7f4>   DW_AT_decl_file   : 9
    <7f5>   DW_AT_decl_line   : 1120
    <7f7>   DW_AT_decl_column : 11
    <7f8>   DW_AT_type        : <0xbf>
    <7fc>   DW_AT_data_member_location: 48
 <2><7fd>: Abbrev Number: 1 (DW_TAG_member)
    <7fe>   DW_AT_name        : (indirect string, offset: 0x42d1e): ucDummy7
    <802>   DW_AT_decl_file   : 9
    <803>   DW_AT_decl_line   : 1121
    <805>   DW_AT_decl_column : 13
    <806>   DW_AT_type        : <0x88c>
    <80a>   DW_AT_data_member_location: 52
 <2><80b>: Abbrev Number: 1 (DW_TAG_member)
    <80c>   DW_AT_name        : (indirect string, offset: 0x26c56): pxDummy8
    <810>   DW_AT_decl_file   : 9
    <811>   DW_AT_decl_line   : 1123
    <813>   DW_AT_decl_column : 11
    <814>   DW_AT_type        : <0xbf>
    <818>   DW_AT_data_member_location: 64
 <2><819>: Abbrev Number: 1 (DW_TAG_member)
    <81a>   DW_AT_name        : (indirect string, offset: 0x2a05f): uxDummy10
    <81e>   DW_AT_decl_file   : 9
    <81f>   DW_AT_decl_line   : 1129
    <821>   DW_AT_decl_column : 16
    <822>   DW_AT_type        : <0x89c>
    <826>   DW_AT_data_member_location: 68
 <2><827>: Abbrev Number: 1 (DW_TAG_member)
    <828>   DW_AT_name        : (indirect string, offset: 0x2a0a9): uxDummy12
    <82c>   DW_AT_decl_file   : 9
    <82d>   DW_AT_decl_line   : 1132
    <82f>   DW_AT_decl_column : 16
    <830>   DW_AT_type        : <0x89c>
    <834>   DW_AT_data_member_location: 76
 <2><835>: Abbrev Number: 1 (DW_TAG_member)
    <836>   DW_AT_name        : (indirect string, offset: 0x1b91e): ulDummy16
    <83a>   DW_AT_decl_file   : 9
    <83b>   DW_AT_decl_line   : 1141
    <83d>   DW_AT_decl_column : 13
    <83e>   DW_AT_type        : <0xb3>
    <842>   DW_AT_data_member_location: 84
 <2><843>: Abbrev Number: 1 (DW_TAG_member)
    <844>   DW_AT_name        : (indirect string, offset: 0x96e83): xDummy17
    <848>   DW_AT_decl_file   : 9
    <849>   DW_AT_decl_line   : 1144
    <84b>   DW_AT_decl_column : 17
    <84c>   DW_AT_type        : <0x3e8>
    <850>   DW_AT_data_member_location: 88
 <2><851>: Abbrev Number: 1 (DW_TAG_member)
    <852>   DW_AT_name        : (indirect string, offset: 0x1b928): ulDummy18
    <856>   DW_AT_decl_file   : 9
    <857>   DW_AT_decl_line   : 1147
    <859>   DW_AT_decl_column : 14
    <85a>   DW_AT_type        : <0xb3>
    <85e>   DW_AT_data_member_location: 164
 <2><85f>: Abbrev Number: 1 (DW_TAG_member)
    <860>   DW_AT_name        : (indirect string, offset: 0xba745): ucDummy19
    <864>   DW_AT_decl_file   : 9
    <865>   DW_AT_decl_line   : 1148
    <867>   DW_AT_decl_column : 13
    <868>   DW_AT_type        : <0x9b>
    <86c>   DW_AT_data_member_location: 168
 <2><86d>: Abbrev Number: 1 (DW_TAG_member)
    <86e>   DW_AT_name        : (indirect string, offset: 0xab6fd): uxDummy20
    <872>   DW_AT_decl_file   : 9
    <873>   DW_AT_decl_line   : 1151
    <875>   DW_AT_decl_column : 13
    <876>   DW_AT_type        : <0x9b>
    <87a>   DW_AT_data_member_location: 169
 <2><87b>: Abbrev Number: 0
 <1><87c>: Abbrev Number: 7 (DW_TAG_array_type)
    <87d>   DW_AT_type        : <0x7aa>
    <881>   DW_AT_sibling     : <0x88c>
 <2><885>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <886>   DW_AT_type        : <0x31>
    <88a>   DW_AT_upper_bound : 1
 <2><88b>: Abbrev Number: 0
 <1><88c>: Abbrev Number: 7 (DW_TAG_array_type)
    <88d>   DW_AT_type        : <0x9b>
    <891>   DW_AT_sibling     : <0x89c>
 <2><895>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <896>   DW_AT_type        : <0x31>
    <89a>   DW_AT_upper_bound : 11
 <2><89b>: Abbrev Number: 0
 <1><89c>: Abbrev Number: 7 (DW_TAG_array_type)
    <89d>   DW_AT_type        : <0xcd>
    <8a1>   DW_AT_sibling     : <0x8ac>
 <2><8a5>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <8a6>   DW_AT_type        : <0x31>
    <8aa>   DW_AT_upper_bound : 1
 <2><8ab>: Abbrev Number: 0
 <1><8ac>: Abbrev Number: 11 (DW_TAG_typedef)
    <8ad>   DW_AT_name        : (indirect string, offset: 0x5d541): StaticTask_t
    <8b1>   DW_AT_decl_file   : 9
    <8b2>   DW_AT_decl_line   : 1160
    <8b4>   DW_AT_decl_column : 3
    <8b5>   DW_AT_type        : <0x7b7>
 <1><8b9>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <8ba>   DW_AT_byte_size   : 4
    <8ba>   DW_AT_type        : <0xc1>
 <1><8be>: Abbrev Number: 18 (DW_TAG_variable)
    <8bf>   DW_AT_name        : (indirect string, offset: 0x63a1b): xIdleTaskTCBBuffer
    <8c3>   DW_AT_decl_file   : 1
    <8c3>   DW_AT_decl_line   : 76
    <8c4>   DW_AT_decl_column : 21
    <8c5>   DW_AT_type        : <0x8ac>
    <8c9>   DW_AT_location    : 5 byte block: 3 88 1 0 20 	(DW_OP_addr: 20000188)
 <1><8cf>: Abbrev Number: 7 (DW_TAG_array_type)
    <8d0>   DW_AT_type        : <0xc1>
    <8d4>   DW_AT_sibling     : <0x8df>
 <2><8d8>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <8d9>   DW_AT_type        : <0x31>
    <8dd>   DW_AT_upper_bound : 63
 <2><8de>: Abbrev Number: 0
 <1><8df>: Abbrev Number: 18 (DW_TAG_variable)
    <8e0>   DW_AT_name        : (indirect string, offset: 0x39668): xIdleStack
    <8e4>   DW_AT_decl_file   : 1
    <8e4>   DW_AT_decl_line   : 77
    <8e5>   DW_AT_decl_column : 20
    <8e6>   DW_AT_type        : <0x8cf>
    <8ea>   DW_AT_location    : 5 byte block: 3 88 0 0 20 	(DW_OP_addr: 20000088)
 <1><8f0>: Abbrev Number: 26 (DW_TAG_subprogram)
    <8f1>   DW_AT_external    : 1
    <8f1>   DW_AT_name        : (indirect string, offset: 0x87765): vApplicationGetIdleTaskMemory
    <8f5>   DW_AT_decl_file   : 1
    <8f6>   DW_AT_decl_line   : 79
    <8f7>   DW_AT_decl_column : 6
    <8f8>   DW_AT_prototyped  : 1
    <8f8>   DW_AT_low_pc      : 0x8000568
    <8fc>   DW_AT_high_pc     : 0x18
    <900>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <902>   DW_AT_call_all_calls: 1
    <902>   DW_AT_sibling     : <0x92b>
 <2><906>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <907>   DW_AT_name        : (indirect string, offset: 0x63a19): ppxIdleTaskTCBBuffer
    <90b>   DW_AT_decl_file   : 1
    <90b>   DW_AT_decl_line   : 79
    <90b>   DW_AT_decl_column : 52
    <90c>   DW_AT_type        : <0x92b>
    <910>   DW_AT_location    : 1 byte block: 50 	(DW_OP_reg0 (r0))
 <2><912>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <913>   DW_AT_name        : (indirect string, offset: 0x6d376): ppxIdleTaskStackBuffer
    <917>   DW_AT_decl_file   : 1
    <917>   DW_AT_decl_line   : 79
    <917>   DW_AT_decl_column : 88
    <918>   DW_AT_type        : <0x935>
    <91c>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (r1))
 <2><91e>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <91f>   DW_AT_name        : (indirect string, offset: 0x67438): pulIdleTaskStackSize
    <923>   DW_AT_decl_file   : 1
    <923>   DW_AT_decl_line   : 79
    <923>   DW_AT_decl_column : 122
    <924>   DW_AT_type        : <0x93a>
    <928>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (r2))
 <2><92a>: Abbrev Number: 0
 <1><92b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <92c>   DW_AT_byte_size   : 4
    <92c>   DW_AT_type        : <0x930>
 <1><930>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <931>   DW_AT_byte_size   : 4
    <931>   DW_AT_type        : <0x8ac>
 <1><935>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <936>   DW_AT_byte_size   : 4
    <936>   DW_AT_type        : <0x8b9>
 <1><93a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <93b>   DW_AT_byte_size   : 4
    <93b>   DW_AT_type        : <0xb3>
 <1><93f>: Abbrev Number: 27 (DW_TAG_subprogram)
    <940>   DW_AT_external    : 1
    <940>   DW_AT_name        : (indirect string, offset: 0x5615b): getRunTimeCounterValue
    <944>   DW_AT_decl_file   : 1
    <945>   DW_AT_decl_line   : 69
    <946>   DW_AT_decl_column : 22
    <947>   DW_AT_prototyped  : 1
    <947>   DW_AT_type        : <0x8d>
    <94b>   DW_AT_low_pc      : 0x8000562
    <94f>   DW_AT_high_pc     : 0x4
    <953>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <955>   DW_AT_call_all_calls: 1
 <1><955>: Abbrev Number: 28 (DW_TAG_subprogram)
    <956>   DW_AT_external    : 1
    <956>   DW_AT_name        : (indirect string, offset: 0x27e91): configureTimerForRunTimeStats
    <95a>   DW_AT_decl_file   : 1
    <95b>   DW_AT_decl_line   : 64
    <95c>   DW_AT_decl_column : 13
    <95d>   DW_AT_prototyped  : 1
    <95d>   DW_AT_low_pc      : 0x8000560
    <961>   DW_AT_high_pc     : 0x2
    <965>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <967>   DW_AT_call_all_calls: 1
 <1><967>: Abbrev Number: 0
  Compilation Unit @ offset 0x968:
   Length:        0x2344 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x1a4
   Pointer Size:  4
 <0><974>: Abbrev Number: 45 (DW_TAG_compile_unit)
    <975>   DW_AT_producer    : (indirect string, offset: 0x2dd15): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -Og -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <979>   DW_AT_language    : 29	(C11)
    <97a>   DW_AT_name        : (indirect string, offset: 0xc2b0b): ../Core/Src/main.c
    <97e>   DW_AT_comp_dir    : (indirect string, offset: 0x29a5d): /home/lth/src/stm32fun/stm32world_freertos/Debug
    <982>   DW_AT_ranges      : 0x2b
    <986>   DW_AT_low_pc      : 0
    <98a>   DW_AT_stmt_list   : 0x903
    <98e>   DW_AT_macros      : 0x1defd
 <1><992>: Abbrev Number: 17 (DW_TAG_base_type)
    <993>   DW_AT_byte_size   : 8
    <994>   DW_AT_encoding    : 7	(unsigned)
    <995>   DW_AT_name        : (indirect string, offset: 0x27a9e): long long unsigned int
 <1><999>: Abbrev Number: 17 (DW_TAG_base_type)
    <99a>   DW_AT_byte_size   : 4
    <99b>   DW_AT_encoding    : 7	(unsigned)
    <99c>   DW_AT_name        : (indirect string, offset: 0xf468): unsigned int
 <1><9a0>: Abbrev Number: 17 (DW_TAG_base_type)
    <9a1>   DW_AT_byte_size   : 1
    <9a2>   DW_AT_encoding    : 6	(signed char)
    <9a3>   DW_AT_name        : (indirect string, offset: 0x5ea97): signed char
 <1><9a7>: Abbrev Number: 6 (DW_TAG_typedef)
    <9a8>   DW_AT_name        : (indirect string, offset: 0x37193): __uint8_t
    <9ac>   DW_AT_decl_file   : 3
    <9ad>   DW_AT_decl_line   : 43
    <9ae>   DW_AT_decl_column : 24
    <9af>   DW_AT_type        : <0x9b3>
 <1><9b3>: Abbrev Number: 17 (DW_TAG_base_type)
    <9b4>   DW_AT_byte_size   : 1
    <9b5>   DW_AT_encoding    : 8	(unsigned char)
    <9b6>   DW_AT_name        : (indirect string, offset: 0xb6f0e): unsigned char
 <1><9ba>: Abbrev Number: 17 (DW_TAG_base_type)
    <9bb>   DW_AT_byte_size   : 2
    <9bc>   DW_AT_encoding    : 5	(signed)
    <9bd>   DW_AT_name        : (indirect string, offset: 0x8ceb4): short int
 <1><9c1>: Abbrev Number: 6 (DW_TAG_typedef)
    <9c2>   DW_AT_name        : (indirect string, offset: 0x9a8f9): __uint16_t
    <9c6>   DW_AT_decl_file   : 3
    <9c7>   DW_AT_decl_line   : 57
    <9c8>   DW_AT_decl_column : 25
    <9c9>   DW_AT_type        : <0x9cd>
 <1><9cd>: Abbrev Number: 17 (DW_TAG_base_type)
    <9ce>   DW_AT_byte_size   : 2
    <9cf>   DW_AT_encoding    : 7	(unsigned)
    <9d0>   DW_AT_name        : (indirect string, offset: 0xb58a7): short unsigned int
 <1><9d4>: Abbrev Number: 6 (DW_TAG_typedef)
    <9d5>   DW_AT_name        : (indirect string, offset: 0xc1792): __int32_t
    <9d9>   DW_AT_decl_file   : 3
    <9da>   DW_AT_decl_line   : 77
    <9db>   DW_AT_decl_column : 24
    <9dc>   DW_AT_type        : <0x9e0>
 <1><9e0>: Abbrev Number: 17 (DW_TAG_base_type)
    <9e1>   DW_AT_byte_size   : 4
    <9e2>   DW_AT_encoding    : 5	(signed)
    <9e3>   DW_AT_name        : (indirect string, offset: 0xfd74): long int
 <1><9e7>: Abbrev Number: 6 (DW_TAG_typedef)
    <9e8>   DW_AT_name        : (indirect string, offset: 0x7848e): __uint32_t
    <9ec>   DW_AT_decl_file   : 3
    <9ed>   DW_AT_decl_line   : 79
    <9ee>   DW_AT_decl_column : 25
    <9ef>   DW_AT_type        : <0x9f3>
 <1><9f3>: Abbrev Number: 17 (DW_TAG_base_type)
    <9f4>   DW_AT_byte_size   : 4
    <9f5>   DW_AT_encoding    : 7	(unsigned)
    <9f6>   DW_AT_name        : (indirect string, offset: 0x48465): long unsigned int
 <1><9fa>: Abbrev Number: 17 (DW_TAG_base_type)
    <9fb>   DW_AT_byte_size   : 8
    <9fc>   DW_AT_encoding    : 5	(signed)
    <9fd>   DW_AT_name        : (indirect string, offset: 0x5654c): long long int
 <1><a01>: Abbrev Number: 46 (DW_TAG_base_type)
    <a02>   DW_AT_byte_size   : 4
    <a03>   DW_AT_encoding    : 5	(signed)
    <a04>   DW_AT_name        : int
 <1><a08>: Abbrev Number: 6 (DW_TAG_typedef)
    <a09>   DW_AT_name        : (indirect string, offset: 0x37195): uint8_t
    <a0d>   DW_AT_decl_file   : 4
    <a0e>   DW_AT_decl_line   : 24
    <a0f>   DW_AT_decl_column : 19
    <a10>   DW_AT_type        : <0x9a7>
 <1><a14>: Abbrev Number: 24 (DW_TAG_const_type)
    <a15>   DW_AT_type        : <0xa08>
 <1><a19>: Abbrev Number: 6 (DW_TAG_typedef)
    <a1a>   DW_AT_name        : (indirect string, offset: 0x89c7a): uint16_t
    <a1e>   DW_AT_decl_file   : 4
    <a1f>   DW_AT_decl_line   : 36
    <a20>   DW_AT_decl_column : 20
    <a21>   DW_AT_type        : <0x9c1>
 <1><a25>: Abbrev Number: 18 (DW_TAG_volatile_type)
    <a26>   DW_AT_type        : <0xa19>
 <1><a2a>: Abbrev Number: 6 (DW_TAG_typedef)
    <a2b>   DW_AT_name        : (indirect string, offset: 0xc1794): int32_t
    <a2f>   DW_AT_decl_file   : 4
    <a30>   DW_AT_decl_line   : 44
    <a31>   DW_AT_decl_column : 19
    <a32>   DW_AT_type        : <0x9d4>
 <1><a36>: Abbrev Number: 6 (DW_TAG_typedef)
    <a37>   DW_AT_name        : (indirect string, offset: 0x893eb): uint32_t
    <a3b>   DW_AT_decl_file   : 4
    <a3c>   DW_AT_decl_line   : 48
    <a3d>   DW_AT_decl_column : 20
    <a3e>   DW_AT_type        : <0x9e7>
 <1><a42>: Abbrev Number: 18 (DW_TAG_volatile_type)
    <a43>   DW_AT_type        : <0xa36>
 <1><a47>: Abbrev Number: 11 (DW_TAG_array_type)
    <a48>   DW_AT_type        : <0xa36>
    <a4c>   DW_AT_sibling     : <0xa57>
 <2><a50>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <a51>   DW_AT_type        : <0x999>
    <a55>   DW_AT_upper_bound : 1
 <2><a56>: Abbrev Number: 0
 <1><a57>: Abbrev Number: 20 (DW_TAG_structure_type)
    <a58>   DW_AT_byte_size   : 24
    <a59>   DW_AT_decl_file   : 5
    <a5a>   DW_AT_decl_line   : 324
    <a5c>   DW_AT_decl_column : 9
    <a5c>   DW_AT_sibling     : <0xab4>
 <2><a60>: Abbrev Number: 8 (DW_TAG_member)
    <a61>   DW_AT_name        : CR
    <a64>   DW_AT_decl_file   : 5
    <a65>   DW_AT_decl_line   : 326
    <a67>   DW_AT_decl_column : 17
    <a68>   DW_AT_type        : <0xa42>
    <a6c>   DW_AT_data_member_location: 0
 <2><a6d>: Abbrev Number: 1 (DW_TAG_member)
    <a6e>   DW_AT_name        : (indirect string, offset: 0xbefc2): NDTR
    <a72>   DW_AT_decl_file   : 5
    <a73>   DW_AT_decl_line   : 327
    <a75>   DW_AT_decl_column : 17
    <a76>   DW_AT_type        : <0xa42>
    <a7a>   DW_AT_data_member_location: 4
 <2><a7b>: Abbrev Number: 8 (DW_TAG_member)
    <a7c>   DW_AT_name        : PAR
    <a80>   DW_AT_decl_file   : 5
    <a81>   DW_AT_decl_line   : 328
    <a83>   DW_AT_decl_column : 17
    <a84>   DW_AT_type        : <0xa42>
    <a88>   DW_AT_data_member_location: 8
 <2><a89>: Abbrev Number: 1 (DW_TAG_member)
    <a8a>   DW_AT_name        : (indirect string, offset: 0xc0504): M0AR
    <a8e>   DW_AT_decl_file   : 5
    <a8f>   DW_AT_decl_line   : 329
    <a91>   DW_AT_decl_column : 17
    <a92>   DW_AT_type        : <0xa42>
    <a96>   DW_AT_data_member_location: 12
 <2><a97>: Abbrev Number: 1 (DW_TAG_member)
    <a98>   DW_AT_name        : (indirect string, offset: 0xc10dd): M1AR
    <a9c>   DW_AT_decl_file   : 5
    <a9d>   DW_AT_decl_line   : 330
    <a9f>   DW_AT_decl_column : 17
    <aa0>   DW_AT_type        : <0xa42>
    <aa4>   DW_AT_data_member_location: 16
 <2><aa5>: Abbrev Number: 8 (DW_TAG_member)
    <aa6>   DW_AT_name        : FCR
    <aaa>   DW_AT_decl_file   : 5
    <aab>   DW_AT_decl_line   : 331
    <aad>   DW_AT_decl_column : 17
    <aae>   DW_AT_type        : <0xa42>
    <ab2>   DW_AT_data_member_location: 20
 <2><ab3>: Abbrev Number: 0
 <1><ab4>: Abbrev Number: 9 (DW_TAG_typedef)
    <ab5>   DW_AT_name        : (indirect string, offset: 0xc2c8b): DMA_Stream_TypeDef
    <ab9>   DW_AT_decl_file   : 5
    <aba>   DW_AT_decl_line   : 332
    <abc>   DW_AT_decl_column : 3
    <abd>   DW_AT_type        : <0xa57>
 <1><ac1>: Abbrev Number: 20 (DW_TAG_structure_type)
    <ac2>   DW_AT_byte_size   : 40
    <ac3>   DW_AT_decl_file   : 5
    <ac4>   DW_AT_decl_line   : 430
    <ac6>   DW_AT_decl_column : 9
    <ac6>   DW_AT_sibling     : <0xb49>
 <2><aca>: Abbrev Number: 1 (DW_TAG_member)
    <acb>   DW_AT_name        : (indirect string, offset: 0xc1a7a): MODER
    <acf>   DW_AT_decl_file   : 5
    <ad0>   DW_AT_decl_line   : 432
    <ad2>   DW_AT_decl_column : 17
    <ad3>   DW_AT_type        : <0xa42>
    <ad7>   DW_AT_data_member_location: 0
 <2><ad8>: Abbrev Number: 1 (DW_TAG_member)
    <ad9>   DW_AT_name        : (indirect string, offset: 0xc21e9): OTYPER
    <add>   DW_AT_decl_file   : 5
    <ade>   DW_AT_decl_line   : 433
    <ae0>   DW_AT_decl_column : 17
    <ae1>   DW_AT_type        : <0xa42>
    <ae5>   DW_AT_data_member_location: 4
 <2><ae6>: Abbrev Number: 1 (DW_TAG_member)
    <ae7>   DW_AT_name        : (indirect string, offset: 0xc28e5): OSPEEDR
    <aeb>   DW_AT_decl_file   : 5
    <aec>   DW_AT_decl_line   : 434
    <aee>   DW_AT_decl_column : 17
    <aef>   DW_AT_type        : <0xa42>
    <af3>   DW_AT_data_member_location: 8
 <2><af4>: Abbrev Number: 1 (DW_TAG_member)
    <af5>   DW_AT_name        : (indirect string, offset: 0xc1460): PUPDR
    <af9>   DW_AT_decl_file   : 5
    <afa>   DW_AT_decl_line   : 435
    <afc>   DW_AT_decl_column : 17
    <afd>   DW_AT_type        : <0xa42>
    <b01>   DW_AT_data_member_location: 12
 <2><b02>: Abbrev Number: 8 (DW_TAG_member)
    <b03>   DW_AT_name        : IDR
    <b07>   DW_AT_decl_file   : 5
    <b08>   DW_AT_decl_line   : 436
    <b0a>   DW_AT_decl_column : 17
    <b0b>   DW_AT_type        : <0xa42>
    <b0f>   DW_AT_data_member_location: 16
 <2><b10>: Abbrev Number: 8 (DW_TAG_member)
    <b11>   DW_AT_name        : ODR
    <b15>   DW_AT_decl_file   : 5
    <b16>   DW_AT_decl_line   : 437
    <b18>   DW_AT_decl_column : 17
    <b19>   DW_AT_type        : <0xa42>
    <b1d>   DW_AT_data_member_location: 20
 <2><b1e>: Abbrev Number: 1 (DW_TAG_member)
    <b1f>   DW_AT_name        : (indirect string, offset: 0xbf68c): BSRR
    <b23>   DW_AT_decl_file   : 5
    <b24>   DW_AT_decl_line   : 438
    <b26>   DW_AT_decl_column : 17
    <b27>   DW_AT_type        : <0xa42>
    <b2b>   DW_AT_data_member_location: 24
 <2><b2c>: Abbrev Number: 1 (DW_TAG_member)
    <b2d>   DW_AT_name        : (indirect string, offset: 0xc2857): LCKR
    <b31>   DW_AT_decl_file   : 5
    <b32>   DW_AT_decl_line   : 439
    <b34>   DW_AT_decl_column : 17
    <b35>   DW_AT_type        : <0xa42>
    <b39>   DW_AT_data_member_location: 28
 <2><b3a>: Abbrev Number: 8 (DW_TAG_member)
    <b3b>   DW_AT_name        : AFR
    <b3f>   DW_AT_decl_file   : 5
    <b40>   DW_AT_decl_line   : 440
    <b42>   DW_AT_decl_column : 17
    <b43>   DW_AT_type        : <0xb59>
    <b47>   DW_AT_data_member_location: 32
 <2><b48>: Abbrev Number: 0
 <1><b49>: Abbrev Number: 11 (DW_TAG_array_type)
    <b4a>   DW_AT_type        : <0xa42>
    <b4e>   DW_AT_sibling     : <0xb59>
 <2><b52>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <b53>   DW_AT_type        : <0x999>
    <b57>   DW_AT_upper_bound : 1
 <2><b58>: Abbrev Number: 0
 <1><b59>: Abbrev Number: 18 (DW_TAG_volatile_type)
    <b5a>   DW_AT_type        : <0xb49>
 <1><b5e>: Abbrev Number: 9 (DW_TAG_typedef)
    <b5f>   DW_AT_name        : (indirect string, offset: 0xc3211): GPIO_TypeDef
    <b63>   DW_AT_decl_file   : 5
    <b64>   DW_AT_decl_line   : 441
    <b66>   DW_AT_decl_column : 3
    <b67>   DW_AT_type        : <0xac1>
 <1><b6b>: Abbrev Number: 20 (DW_TAG_structure_type)
    <b6c>   DW_AT_byte_size   : 8
    <b6d>   DW_AT_decl_file   : 5
    <b6e>   DW_AT_decl_line   : 490
    <b70>   DW_AT_decl_column : 9
    <b70>   DW_AT_sibling     : <0xb90>
 <2><b74>: Abbrev Number: 8 (DW_TAG_member)
    <b75>   DW_AT_name        : CR
    <b78>   DW_AT_decl_file   : 5
    <b79>   DW_AT_decl_line   : 492
    <b7b>   DW_AT_decl_column : 17
    <b7c>   DW_AT_type        : <0xa42>
    <b80>   DW_AT_data_member_location: 0
 <2><b81>: Abbrev Number: 8 (DW_TAG_member)
    <b82>   DW_AT_name        : CSR
    <b86>   DW_AT_decl_file   : 5
    <b87>   DW_AT_decl_line   : 493
    <b89>   DW_AT_decl_column : 17
    <b8a>   DW_AT_type        : <0xa42>
    <b8e>   DW_AT_data_member_location: 4
 <2><b8f>: Abbrev Number: 0
 <1><b90>: Abbrev Number: 9 (DW_TAG_typedef)
    <b91>   DW_AT_name        : (indirect string, offset: 0xc1f21): PWR_TypeDef
    <b95>   DW_AT_decl_file   : 5
    <b96>   DW_AT_decl_line   : 494
    <b98>   DW_AT_decl_column : 3
    <b99>   DW_AT_type        : <0xb6b>
 <1><b9d>: Abbrev Number: 20 (DW_TAG_structure_type)
    <b9e>   DW_AT_byte_size   : 136
    <b9f>   DW_AT_decl_file   : 5
    <ba0>   DW_AT_decl_line   : 500
    <ba2>   DW_AT_decl_column : 9
    <ba2>   DW_AT_sibling     : <0xd4a>
 <2><ba6>: Abbrev Number: 8 (DW_TAG_member)
    <ba7>   DW_AT_name        : CR
    <baa>   DW_AT_decl_file   : 5
    <bab>   DW_AT_decl_line   : 502
    <bad>   DW_AT_decl_column : 17
    <bae>   DW_AT_type        : <0xa42>
    <bb2>   DW_AT_data_member_location: 0
 <2><bb3>: Abbrev Number: 1 (DW_TAG_member)
    <bb4>   DW_AT_name        : (indirect string, offset: 0xc1e92): PLLCFGR
    <bb8>   DW_AT_decl_file   : 5
    <bb9>   DW_AT_decl_line   : 503
    <bbb>   DW_AT_decl_column : 17
    <bbc>   DW_AT_type        : <0xa42>
    <bc0>   DW_AT_data_member_location: 4
 <2><bc1>: Abbrev Number: 1 (DW_TAG_member)
    <bc2>   DW_AT_name        : (indirect string, offset: 0xc1e95): CFGR
    <bc6>   DW_AT_decl_file   : 5
    <bc7>   DW_AT_decl_line   : 504
    <bc9>   DW_AT_decl_column : 17
    <bca>   DW_AT_type        : <0xa42>
    <bce>   DW_AT_data_member_location: 8
 <2><bcf>: Abbrev Number: 8 (DW_TAG_member)
    <bd0>   DW_AT_name        : CIR
    <bd4>   DW_AT_decl_file   : 5
    <bd5>   DW_AT_decl_line   : 505
    <bd7>   DW_AT_decl_column : 17
    <bd8>   DW_AT_type        : <0xa42>
    <bdc>   DW_AT_data_member_location: 12
 <2><bdd>: Abbrev Number: 1 (DW_TAG_member)
    <bde>   DW_AT_name        : (indirect string, offset: 0xc238b): AHB1RSTR
    <be2>   DW_AT_decl_file   : 5
    <be3>   DW_AT_decl_line   : 506
    <be5>   DW_AT_decl_column : 17
    <be6>   DW_AT_type        : <0xa42>
    <bea>   DW_AT_data_member_location: 16
 <2><beb>: Abbrev Number: 1 (DW_TAG_member)
    <bec>   DW_AT_name        : (indirect string, offset: 0xbef77): AHB2RSTR
    <bf0>   DW_AT_decl_file   : 5
    <bf1>   DW_AT_decl_line   : 507
    <bf3>   DW_AT_decl_column : 17
    <bf4>   DW_AT_type        : <0xa42>
    <bf8>   DW_AT_data_member_location: 20
 <2><bf9>: Abbrev Number: 1 (DW_TAG_member)
    <bfa>   DW_AT_name        : (indirect string, offset: 0xbfe50): AHB3RSTR
    <bfe>   DW_AT_decl_file   : 5
    <bff>   DW_AT_decl_line   : 508
    <c01>   DW_AT_decl_column : 17
    <c02>   DW_AT_type        : <0xa42>
    <c06>   DW_AT_data_member_location: 24
 <2><c07>: Abbrev Number: 1 (DW_TAG_member)
    <c08>   DW_AT_name        : (indirect string, offset: 0xc3033): RESERVED0
    <c0c>   DW_AT_decl_file   : 5
    <c0d>   DW_AT_decl_line   : 509
    <c0f>   DW_AT_decl_column : 17
    <c10>   DW_AT_type        : <0xa36>
    <c14>   DW_AT_data_member_location: 28
 <2><c15>: Abbrev Number: 1 (DW_TAG_member)
    <c16>   DW_AT_name        : (indirect string, offset: 0xbef6e): APB1RSTR
    <c1a>   DW_AT_decl_file   : 5
    <c1b>   DW_AT_decl_line   : 510
    <c1d>   DW_AT_decl_column : 17
    <c1e>   DW_AT_type        : <0xa42>
    <c22>   DW_AT_data_member_location: 32
 <2><c23>: Abbrev Number: 1 (DW_TAG_member)
    <c24>   DW_AT_name        : (indirect string, offset: 0xc06d4): APB2RSTR
    <c28>   DW_AT_decl_file   : 5
    <c29>   DW_AT_decl_line   : 511
    <c2b>   DW_AT_decl_column : 17
    <c2c>   DW_AT_type        : <0xa42>
    <c30>   DW_AT_data_member_location: 36
 <2><c31>: Abbrev Number: 1 (DW_TAG_member)
    <c32>   DW_AT_name        : (indirect string, offset: 0xc303d): RESERVED1
    <c36>   DW_AT_decl_file   : 5
    <c37>   DW_AT_decl_line   : 512
    <c39>   DW_AT_decl_column : 17
    <c3a>   DW_AT_type        : <0xa47>
    <c3e>   DW_AT_data_member_location: 40
 <2><c3f>: Abbrev Number: 1 (DW_TAG_member)
    <c40>   DW_AT_name        : (indirect string, offset: 0xbee16): AHB1ENR
    <c44>   DW_AT_decl_file   : 5
    <c45>   DW_AT_decl_line   : 513
    <c47>   DW_AT_decl_column : 17
    <c48>   DW_AT_type        : <0xa42>
    <c4c>   DW_AT_data_member_location: 48
 <2><c4d>: Abbrev Number: 1 (DW_TAG_member)
    <c4e>   DW_AT_name        : (indirect string, offset: 0xbf801): AHB2ENR
    <c52>   DW_AT_decl_file   : 5
    <c53>   DW_AT_decl_line   : 514
    <c55>   DW_AT_decl_column : 17
    <c56>   DW_AT_type        : <0xa42>
    <c5a>   DW_AT_data_member_location: 52
 <2><c5b>: Abbrev Number: 1 (DW_TAG_member)
    <c5c>   DW_AT_name        : (indirect string, offset: 0xc079a): AHB3ENR
    <c60>   DW_AT_decl_file   : 5
    <c61>   DW_AT_decl_line   : 515
    <c63>   DW_AT_decl_column : 17
    <c64>   DW_AT_type        : <0xa42>
    <c68>   DW_AT_data_member_location: 56
 <2><c69>: Abbrev Number: 1 (DW_TAG_member)
    <c6a>   DW_AT_name        : (indirect string, offset: 0xc3047): RESERVED2
    <c6e>   DW_AT_decl_file   : 5
    <c6f>   DW_AT_decl_line   : 516
    <c71>   DW_AT_decl_column : 17
    <c72>   DW_AT_type        : <0xa36>
    <c76>   DW_AT_data_member_location: 60
 <2><c77>: Abbrev Number: 1 (DW_TAG_member)
    <c78>   DW_AT_name        : (indirect string, offset: 0xc13cf): APB1ENR
    <c7c>   DW_AT_decl_file   : 5
    <c7d>   DW_AT_decl_line   : 517
    <c7f>   DW_AT_decl_column : 17
    <c80>   DW_AT_type        : <0xa42>
    <c84>   DW_AT_data_member_location: 64
 <2><c85>: Abbrev Number: 1 (DW_TAG_member)
    <c86>   DW_AT_name        : (indirect string, offset: 0xbefc7): APB2ENR
    <c8a>   DW_AT_decl_file   : 5
    <c8b>   DW_AT_decl_line   : 518
    <c8d>   DW_AT_decl_column : 17
    <c8e>   DW_AT_type        : <0xa42>
    <c92>   DW_AT_data_member_location: 68
 <2><c93>: Abbrev Number: 1 (DW_TAG_member)
    <c94>   DW_AT_name        : (indirect string, offset: 0xc3051): RESERVED3
    <c98>   DW_AT_decl_file   : 5
    <c99>   DW_AT_decl_line   : 519
    <c9b>   DW_AT_decl_column : 17
    <c9c>   DW_AT_type        : <0xa47>
    <ca0>   DW_AT_data_member_location: 72
 <2><ca1>: Abbrev Number: 1 (DW_TAG_member)
    <ca2>   DW_AT_name        : (indirect string, offset: 0xc2461): AHB1LPENR
    <ca6>   DW_AT_decl_file   : 5
    <ca7>   DW_AT_decl_line   : 520
    <ca9>   DW_AT_decl_column : 17
    <caa>   DW_AT_type        : <0xa42>
    <cae>   DW_AT_data_member_location: 80
 <2><caf>: Abbrev Number: 1 (DW_TAG_member)
    <cb0>   DW_AT_name        : (indirect string, offset: 0xbf668): AHB2LPENR
    <cb4>   DW_AT_decl_file   : 5
    <cb5>   DW_AT_decl_line   : 521
    <cb7>   DW_AT_decl_column : 17
    <cb8>   DW_AT_type        : <0xa42>
    <cbc>   DW_AT_data_member_location: 84
 <2><cbd>: Abbrev Number: 1 (DW_TAG_member)
    <cbe>   DW_AT_name        : (indirect string, offset: 0xc1c7e): AHB3LPENR
    <cc2>   DW_AT_decl_file   : 5
    <cc3>   DW_AT_decl_line   : 522
    <cc5>   DW_AT_decl_column : 17
    <cc6>   DW_AT_type        : <0xa42>
    <cca>   DW_AT_data_member_location: 88
 <2><ccb>: Abbrev Number: 1 (DW_TAG_member)
    <ccc>   DW_AT_name        : (indirect string, offset: 0xc305b): RESERVED4
    <cd0>   DW_AT_decl_file   : 5
    <cd1>   DW_AT_decl_line   : 523
    <cd3>   DW_AT_decl_column : 17
    <cd4>   DW_AT_type        : <0xa36>
    <cd8>   DW_AT_data_member_location: 92
 <2><cd9>: Abbrev Number: 1 (DW_TAG_member)
    <cda>   DW_AT_name        : (indirect string, offset: 0xc26ba): APB1LPENR
    <cde>   DW_AT_decl_file   : 5
    <cdf>   DW_AT_decl_line   : 524
    <ce1>   DW_AT_decl_column : 17
    <ce2>   DW_AT_type        : <0xa42>
    <ce6>   DW_AT_data_member_location: 96
 <2><ce7>: Abbrev Number: 1 (DW_TAG_member)
    <ce8>   DW_AT_name        : (indirect string, offset: 0xbf794): APB2LPENR
    <cec>   DW_AT_decl_file   : 5
    <ced>   DW_AT_decl_line   : 525
    <cef>   DW_AT_decl_column : 17
    <cf0>   DW_AT_type        : <0xa42>
    <cf4>   DW_AT_data_member_location: 100
 <2><cf5>: Abbrev Number: 1 (DW_TAG_member)
    <cf6>   DW_AT_name        : (indirect string, offset: 0xc3065): RESERVED5
    <cfa>   DW_AT_decl_file   : 5
    <cfb>   DW_AT_decl_line   : 526
    <cfd>   DW_AT_decl_column : 17
    <cfe>   DW_AT_type        : <0xa47>
    <d02>   DW_AT_data_member_location: 104
 <2><d03>: Abbrev Number: 1 (DW_TAG_member)
    <d04>   DW_AT_name        : (indirect string, offset: 0xbf05c): BDCR
    <d08>   DW_AT_decl_file   : 5
    <d09>   DW_AT_decl_line   : 527
    <d0b>   DW_AT_decl_column : 17
    <d0c>   DW_AT_type        : <0xa42>
    <d10>   DW_AT_data_member_location: 112
 <2><d11>: Abbrev Number: 8 (DW_TAG_member)
    <d12>   DW_AT_name        : CSR
    <d16>   DW_AT_decl_file   : 5
    <d17>   DW_AT_decl_line   : 528
    <d19>   DW_AT_decl_column : 17
    <d1a>   DW_AT_type        : <0xa42>
    <d1e>   DW_AT_data_member_location: 116
 <2><d1f>: Abbrev Number: 1 (DW_TAG_member)
    <d20>   DW_AT_name        : (indirect string, offset: 0xc1591): RESERVED6
    <d24>   DW_AT_decl_file   : 5
    <d25>   DW_AT_decl_line   : 529
    <d27>   DW_AT_decl_column : 17
    <d28>   DW_AT_type        : <0xa47>
    <d2c>   DW_AT_data_member_location: 120
 <2><d2d>: Abbrev Number: 1 (DW_TAG_member)
    <d2e>   DW_AT_name        : (indirect string, offset: 0xc0dd9): SSCGR
    <d32>   DW_AT_decl_file   : 5
    <d33>   DW_AT_decl_line   : 530
    <d35>   DW_AT_decl_column : 17
    <d36>   DW_AT_type        : <0xa42>
    <d3a>   DW_AT_data_member_location: 128
 <2><d3b>: Abbrev Number: 1 (DW_TAG_member)
    <d3c>   DW_AT_name        : (indirect string, offset: 0xbfea9): PLLI2SCFGR
    <d40>   DW_AT_decl_file   : 5
    <d41>   DW_AT_decl_line   : 531
    <d43>   DW_AT_decl_column : 17
    <d44>   DW_AT_type        : <0xa42>
    <d48>   DW_AT_data_member_location: 132
 <2><d49>: Abbrev Number: 0
 <1><d4a>: Abbrev Number: 9 (DW_TAG_typedef)
    <d4b>   DW_AT_name        : (indirect string, offset: 0xc088e): RCC_TypeDef
    <d4f>   DW_AT_decl_file   : 5
    <d50>   DW_AT_decl_line   : 532
    <d52>   DW_AT_decl_column : 3
    <d53>   DW_AT_type        : <0xb9d>
 <1><d57>: Abbrev Number: 20 (DW_TAG_structure_type)
    <d58>   DW_AT_byte_size   : 84
    <d59>   DW_AT_decl_file   : 5
    <d5a>   DW_AT_decl_line   : 632
    <d5c>   DW_AT_decl_column : 9
    <d5c>   DW_AT_sibling     : <0xe85>
 <2><d60>: Abbrev Number: 8 (DW_TAG_member)
    <d61>   DW_AT_name        : CR1
    <d65>   DW_AT_decl_file   : 5
    <d66>   DW_AT_decl_line   : 634
    <d68>   DW_AT_decl_column : 17
    <d69>   DW_AT_type        : <0xa42>
    <d6d>   DW_AT_data_member_location: 0
 <2><d6e>: Abbrev Number: 8 (DW_TAG_member)
    <d6f>   DW_AT_name        : CR2
    <d73>   DW_AT_decl_file   : 5
    <d74>   DW_AT_decl_line   : 635
    <d76>   DW_AT_decl_column : 17
    <d77>   DW_AT_type        : <0xa42>
    <d7b>   DW_AT_data_member_location: 4
 <2><d7c>: Abbrev Number: 1 (DW_TAG_member)
    <d7d>   DW_AT_name        : (indirect string, offset: 0x3798f): SMCR
    <d81>   DW_AT_decl_file   : 5
    <d82>   DW_AT_decl_line   : 636
    <d84>   DW_AT_decl_column : 17
    <d85>   DW_AT_type        : <0xa42>
    <d89>   DW_AT_data_member_location: 8
 <2><d8a>: Abbrev Number: 1 (DW_TAG_member)
    <d8b>   DW_AT_name        : (indirect string, offset: 0x3d2c9): DIER
    <d8f>   DW_AT_decl_file   : 5
    <d90>   DW_AT_decl_line   : 637
    <d92>   DW_AT_decl_column : 17
    <d93>   DW_AT_type        : <0xa42>
    <d97>   DW_AT_data_member_location: 12
 <2><d98>: Abbrev Number: 8 (DW_TAG_member)
    <d99>   DW_AT_name        : SR
    <d9c>   DW_AT_decl_file   : 5
    <d9d>   DW_AT_decl_line   : 638
    <d9f>   DW_AT_decl_column : 17
    <da0>   DW_AT_type        : <0xa42>
    <da4>   DW_AT_data_member_location: 16
 <2><da5>: Abbrev Number: 8 (DW_TAG_member)
    <da6>   DW_AT_name        : EGR
    <daa>   DW_AT_decl_file   : 5
    <dab>   DW_AT_decl_line   : 639
    <dad>   DW_AT_decl_column : 17
    <dae>   DW_AT_type        : <0xa42>
    <db2>   DW_AT_data_member_location: 20
 <2><db3>: Abbrev Number: 1 (DW_TAG_member)
    <db4>   DW_AT_name        : (indirect string, offset: 0xacf3b): CCMR1
    <db8>   DW_AT_decl_file   : 5
    <db9>   DW_AT_decl_line   : 640
    <dbb>   DW_AT_decl_column : 17
    <dbc>   DW_AT_type        : <0xa42>
    <dc0>   DW_AT_data_member_location: 24
 <2><dc1>: Abbrev Number: 1 (DW_TAG_member)
    <dc2>   DW_AT_name        : (indirect string, offset: 0x4b9da): CCMR2
    <dc6>   DW_AT_decl_file   : 5
    <dc7>   DW_AT_decl_line   : 641
    <dc9>   DW_AT_decl_column : 17
    <dca>   DW_AT_type        : <0xa42>
    <dce>   DW_AT_data_member_location: 28
 <2><dcf>: Abbrev Number: 1 (DW_TAG_member)
    <dd0>   DW_AT_name        : (indirect string, offset: 0x2e5c4): CCER
    <dd4>   DW_AT_decl_file   : 5
    <dd5>   DW_AT_decl_line   : 642
    <dd7>   DW_AT_decl_column : 17
    <dd8>   DW_AT_type        : <0xa42>
    <ddc>   DW_AT_data_member_location: 32
 <2><ddd>: Abbrev Number: 8 (DW_TAG_member)
    <dde>   DW_AT_name        : CNT
    <de2>   DW_AT_decl_file   : 5
    <de3>   DW_AT_decl_line   : 643
    <de5>   DW_AT_decl_column : 17
    <de6>   DW_AT_type        : <0xa42>
    <dea>   DW_AT_data_member_location: 36
 <2><deb>: Abbrev Number: 8 (DW_TAG_member)
    <dec>   DW_AT_name        : PSC
    <df0>   DW_AT_decl_file   : 5
    <df1>   DW_AT_decl_line   : 644
    <df3>   DW_AT_decl_column : 17
    <df4>   DW_AT_type        : <0xa42>
    <df8>   DW_AT_data_member_location: 40
 <2><df9>: Abbrev Number: 8 (DW_TAG_member)
    <dfa>   DW_AT_name        : ARR
    <dfe>   DW_AT_decl_file   : 5
    <dff>   DW_AT_decl_line   : 645
    <e01>   DW_AT_decl_column : 17
    <e02>   DW_AT_type        : <0xa42>
    <e06>   DW_AT_data_member_location: 44
 <2><e07>: Abbrev Number: 8 (DW_TAG_member)
    <e08>   DW_AT_name        : RCR
    <e0c>   DW_AT_decl_file   : 5
    <e0d>   DW_AT_decl_line   : 646
    <e0f>   DW_AT_decl_column : 17
    <e10>   DW_AT_type        : <0xa42>
    <e14>   DW_AT_data_member_location: 48
 <2><e15>: Abbrev Number: 1 (DW_TAG_member)
    <e16>   DW_AT_name        : (indirect string, offset: 0x16e34): CCR1
    <e1a>   DW_AT_decl_file   : 5
    <e1b>   DW_AT_decl_line   : 647
    <e1d>   DW_AT_decl_column : 17
    <e1e>   DW_AT_type        : <0xa42>
    <e22>   DW_AT_data_member_location: 52
 <2><e23>: Abbrev Number: 1 (DW_TAG_member)
    <e24>   DW_AT_name        : (indirect string, offset: 0x4f609): CCR2
    <e28>   DW_AT_decl_file   : 5
    <e29>   DW_AT_decl_line   : 648
    <e2b>   DW_AT_decl_column : 17
    <e2c>   DW_AT_type        : <0xa42>
    <e30>   DW_AT_data_member_location: 56
 <2><e31>: Abbrev Number: 1 (DW_TAG_member)
    <e32>   DW_AT_name        : (indirect string, offset: 0x90844): CCR3
    <e36>   DW_AT_decl_file   : 5
    <e37>   DW_AT_decl_line   : 649
    <e39>   DW_AT_decl_column : 17
    <e3a>   DW_AT_type        : <0xa42>
    <e3e>   DW_AT_data_member_location: 60
 <2><e3f>: Abbrev Number: 1 (DW_TAG_member)
    <e40>   DW_AT_name        : (indirect string, offset: 0xbc6f): CCR4
    <e44>   DW_AT_decl_file   : 5
    <e45>   DW_AT_decl_line   : 650
    <e47>   DW_AT_decl_column : 17
    <e48>   DW_AT_type        : <0xa42>
    <e4c>   DW_AT_data_member_location: 64
 <2><e4d>: Abbrev Number: 1 (DW_TAG_member)
    <e4e>   DW_AT_name        : (indirect string, offset: 0x501ab): BDTR
    <e52>   DW_AT_decl_file   : 5
    <e53>   DW_AT_decl_line   : 651
    <e55>   DW_AT_decl_column : 17
    <e56>   DW_AT_type        : <0xa42>
    <e5a>   DW_AT_data_member_location: 68
 <2><e5b>: Abbrev Number: 8 (DW_TAG_member)
    <e5c>   DW_AT_name        : DCR
    <e60>   DW_AT_decl_file   : 5
    <e61>   DW_AT_decl_line   : 652
    <e63>   DW_AT_decl_column : 17
    <e64>   DW_AT_type        : <0xa42>
    <e68>   DW_AT_data_member_location: 72
 <2><e69>: Abbrev Number: 1 (DW_TAG_member)
    <e6a>   DW_AT_name        : (indirect string, offset: 0xa26c3): DMAR
    <e6e>   DW_AT_decl_file   : 5
    <e6f>   DW_AT_decl_line   : 653
    <e71>   DW_AT_decl_column : 17
    <e72>   DW_AT_type        : <0xa42>
    <e76>   DW_AT_data_member_location: 76
 <2><e77>: Abbrev Number: 8 (DW_TAG_member)
    <e78>   DW_AT_name        : OR
    <e7b>   DW_AT_decl_file   : 5
    <e7c>   DW_AT_decl_line   : 654
    <e7e>   DW_AT_decl_column : 17
    <e7f>   DW_AT_type        : <0xa42>
    <e83>   DW_AT_data_member_location: 80
 <2><e84>: Abbrev Number: 0
 <1><e85>: Abbrev Number: 9 (DW_TAG_typedef)
    <e86>   DW_AT_name        : (indirect string, offset: 0xc306f): TIM_TypeDef
    <e8a>   DW_AT_decl_file   : 5
    <e8b>   DW_AT_decl_line   : 655
    <e8d>   DW_AT_decl_column : 3
    <e8e>   DW_AT_type        : <0xd57>
 <1><e92>: Abbrev Number: 20 (DW_TAG_structure_type)
    <e93>   DW_AT_byte_size   : 28
    <e94>   DW_AT_decl_file   : 5
    <e95>   DW_AT_decl_line   : 661
    <e97>   DW_AT_decl_column : 9
    <e97>   DW_AT_sibling     : <0xefc>
 <2><e9b>: Abbrev Number: 8 (DW_TAG_member)
    <e9c>   DW_AT_name        : SR
    <e9f>   DW_AT_decl_file   : 5
    <ea0>   DW_AT_decl_line   : 663
    <ea2>   DW_AT_decl_column : 17
    <ea3>   DW_AT_type        : <0xa42>
    <ea7>   DW_AT_data_member_location: 0
 <2><ea8>: Abbrev Number: 8 (DW_TAG_member)
    <ea9>   DW_AT_name        : DR
    <eac>   DW_AT_decl_file   : 5
    <ead>   DW_AT_decl_line   : 664
    <eaf>   DW_AT_decl_column : 17
    <eb0>   DW_AT_type        : <0xa42>
    <eb4>   DW_AT_data_member_location: 4
 <2><eb5>: Abbrev Number: 8 (DW_TAG_member)
    <eb6>   DW_AT_name        : BRR
    <eba>   DW_AT_decl_file   : 5
    <ebb>   DW_AT_decl_line   : 665
    <ebd>   DW_AT_decl_column : 17
    <ebe>   DW_AT_type        : <0xa42>
    <ec2>   DW_AT_data_member_location: 8
 <2><ec3>: Abbrev Number: 8 (DW_TAG_member)
    <ec4>   DW_AT_name        : CR1
    <ec8>   DW_AT_decl_file   : 5
    <ec9>   DW_AT_decl_line   : 666
    <ecb>   DW_AT_decl_column : 17
    <ecc>   DW_AT_type        : <0xa42>
    <ed0>   DW_AT_data_member_location: 12
 <2><ed1>: Abbrev Number: 8 (DW_TAG_member)
    <ed2>   DW_AT_name        : CR2
    <ed6>   DW_AT_decl_file   : 5
    <ed7>   DW_AT_decl_line   : 667
    <ed9>   DW_AT_decl_column : 17
    <eda>   DW_AT_type        : <0xa42>
    <ede>   DW_AT_data_member_location: 16
 <2><edf>: Abbrev Number: 8 (DW_TAG_member)
    <ee0>   DW_AT_name        : CR3
    <ee4>   DW_AT_decl_file   : 5
    <ee5>   DW_AT_decl_line   : 668
    <ee7>   DW_AT_decl_column : 17
    <ee8>   DW_AT_type        : <0xa42>
    <eec>   DW_AT_data_member_location: 20
 <2><eed>: Abbrev Number: 1 (DW_TAG_member)
    <eee>   DW_AT_name        : (indirect string, offset: 0xbf8b7): GTPR
    <ef2>   DW_AT_decl_file   : 5
    <ef3>   DW_AT_decl_line   : 669
    <ef5>   DW_AT_decl_column : 17
    <ef6>   DW_AT_type        : <0xa42>
    <efa>   DW_AT_data_member_location: 24
 <2><efb>: Abbrev Number: 0
 <1><efc>: Abbrev Number: 9 (DW_TAG_typedef)
    <efd>   DW_AT_name        : (indirect string, offset: 0xc3461): USART_TypeDef
    <f01>   DW_AT_decl_file   : 5
    <f02>   DW_AT_decl_line   : 670
    <f04>   DW_AT_decl_column : 3
    <f05>   DW_AT_type        : <0xe92>
 <1><f09>: Abbrev Number: 17 (DW_TAG_base_type)
    <f0a>   DW_AT_byte_size   : 8
    <f0b>   DW_AT_encoding    : 4	(float)
    <f0c>   DW_AT_name        : (indirect string, offset: 0x11a0e): long double
 <1><f10>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <f11>   DW_AT_encoding    : 7	(unsigned)
    <f12>   DW_AT_byte_size   : 1
    <f13>   DW_AT_type        : <0x9b3>
    <f17>   DW_AT_decl_file   : 6
    <f18>   DW_AT_decl_line   : 39
    <f19>   DW_AT_decl_column : 1
    <f1a>   DW_AT_sibling     : <0xf37>
 <2><f1e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <f1f>   DW_AT_name        : (indirect string, offset: 0xbfecd): HAL_OK
    <f23>   DW_AT_const_value : 0
 <2><f24>: Abbrev Number: 3 (DW_TAG_enumerator)
    <f25>   DW_AT_name        : (indirect string, offset: 0xc1893): HAL_ERROR
    <f29>   DW_AT_const_value : 1
 <2><f2a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <f2b>   DW_AT_name        : (indirect string, offset: 0xbf23d): HAL_BUSY
    <f2f>   DW_AT_const_value : 2
 <2><f30>: Abbrev Number: 3 (DW_TAG_enumerator)
    <f31>   DW_AT_name        : (indirect string, offset: 0xbfa67): HAL_TIMEOUT
    <f35>   DW_AT_const_value : 3
 <2><f36>: Abbrev Number: 0
 <1><f37>: Abbrev Number: 6 (DW_TAG_typedef)
    <f38>   DW_AT_name        : (indirect string, offset: 0xbe8cf): HAL_StatusTypeDef
    <f3c>   DW_AT_decl_file   : 6
    <f3d>   DW_AT_decl_line   : 44
    <f3e>   DW_AT_decl_column : 3
    <f3f>   DW_AT_type        : <0xf10>
 <1><f43>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <f44>   DW_AT_encoding    : 7	(unsigned)
    <f45>   DW_AT_byte_size   : 1
    <f46>   DW_AT_type        : <0x9b3>
    <f4a>   DW_AT_decl_file   : 6
    <f4b>   DW_AT_decl_line   : 50
    <f4c>   DW_AT_decl_column : 1
    <f4d>   DW_AT_sibling     : <0xf5e>
 <2><f51>: Abbrev Number: 3 (DW_TAG_enumerator)
    <f52>   DW_AT_name        : (indirect string, offset: 0xc1fea): HAL_UNLOCKED
    <f56>   DW_AT_const_value : 0
 <2><f57>: Abbrev Number: 3 (DW_TAG_enumerator)
    <f58>   DW_AT_name        : (indirect string, offset: 0xc34b3): HAL_LOCKED
    <f5c>   DW_AT_const_value : 1
 <2><f5d>: Abbrev Number: 0
 <1><f5e>: Abbrev Number: 6 (DW_TAG_typedef)
    <f5f>   DW_AT_name        : (indirect string, offset: 0xc1546): HAL_LockTypeDef
    <f63>   DW_AT_decl_file   : 6
    <f64>   DW_AT_decl_line   : 53
    <f65>   DW_AT_decl_column : 3
    <f66>   DW_AT_type        : <0xf43>
 <1><f6a>: Abbrev Number: 21 (DW_TAG_structure_type)
    <f6b>   DW_AT_byte_size   : 24
    <f6c>   DW_AT_decl_file   : 7
    <f6d>   DW_AT_decl_line   : 45
    <f6e>   DW_AT_decl_column : 9
    <f6e>   DW_AT_sibling     : <0xfc1>
 <2><f72>: Abbrev Number: 2 (DW_TAG_member)
    <f73>   DW_AT_name        : (indirect string, offset: 0xc1bf8): PLLState
    <f77>   DW_AT_decl_file   : 7
    <f78>   DW_AT_decl_line   : 47
    <f79>   DW_AT_decl_column : 12
    <f7a>   DW_AT_type        : <0xa36>
    <f7e>   DW_AT_data_member_location: 0
 <2><f7f>: Abbrev Number: 2 (DW_TAG_member)
    <f80>   DW_AT_name        : (indirect string, offset: 0xc1dc3): PLLSource
    <f84>   DW_AT_decl_file   : 7
    <f85>   DW_AT_decl_line   : 50
    <f86>   DW_AT_decl_column : 12
    <f87>   DW_AT_type        : <0xa36>
    <f8b>   DW_AT_data_member_location: 4
 <2><f8c>: Abbrev Number: 2 (DW_TAG_member)
    <f8d>   DW_AT_name        : (indirect string, offset: 0xc2555): PLLM
    <f91>   DW_AT_decl_file   : 7
    <f92>   DW_AT_decl_line   : 53
    <f93>   DW_AT_decl_column : 12
    <f94>   DW_AT_type        : <0xa36>
    <f98>   DW_AT_data_member_location: 8
 <2><f99>: Abbrev Number: 2 (DW_TAG_member)
    <f9a>   DW_AT_name        : (indirect string, offset: 0xc255a): PLLN
    <f9e>   DW_AT_decl_file   : 7
    <f9f>   DW_AT_decl_line   : 56
    <fa0>   DW_AT_decl_column : 12
    <fa1>   DW_AT_type        : <0xa36>
    <fa5>   DW_AT_data_member_location: 12
 <2><fa6>: Abbrev Number: 2 (DW_TAG_member)
    <fa7>   DW_AT_name        : (indirect string, offset: 0xc255f): PLLP
    <fab>   DW_AT_decl_file   : 7
    <fac>   DW_AT_decl_line   : 60
    <fad>   DW_AT_decl_column : 12
    <fae>   DW_AT_type        : <0xa36>
    <fb2>   DW_AT_data_member_location: 16
 <2><fb3>: Abbrev Number: 2 (DW_TAG_member)
    <fb4>   DW_AT_name        : (indirect string, offset: 0x4658e): PLLQ
    <fb8>   DW_AT_decl_file   : 7
    <fb9>   DW_AT_decl_line   : 63
    <fba>   DW_AT_decl_column : 12
    <fbb>   DW_AT_type        : <0xa36>
    <fbf>   DW_AT_data_member_location: 20
 <2><fc0>: Abbrev Number: 0
 <1><fc1>: Abbrev Number: 6 (DW_TAG_typedef)
    <fc2>   DW_AT_name        : (indirect string, offset: 0xc15eb): RCC_PLLInitTypeDef
    <fc6>   DW_AT_decl_file   : 7
    <fc7>   DW_AT_decl_line   : 73
    <fc8>   DW_AT_decl_column : 3
    <fc9>   DW_AT_type        : <0xf6a>
 <1><fcd>: Abbrev Number: 21 (DW_TAG_structure_type)
    <fce>   DW_AT_byte_size   : 48
    <fcf>   DW_AT_decl_file   : 8
    <fd0>   DW_AT_decl_line   : 49
    <fd1>   DW_AT_decl_column : 9
    <fd1>   DW_AT_sibling     : <0x1031>
 <2><fd5>: Abbrev Number: 2 (DW_TAG_member)
    <fd6>   DW_AT_name        : (indirect string, offset: 0xc2441): OscillatorType
    <fda>   DW_AT_decl_file   : 8
    <fdb>   DW_AT_decl_line   : 51
    <fdc>   DW_AT_decl_column : 12
    <fdd>   DW_AT_type        : <0xa36>
    <fe1>   DW_AT_data_member_location: 0
 <2><fe2>: Abbrev Number: 2 (DW_TAG_member)
    <fe3>   DW_AT_name        : (indirect string, offset: 0xc1c88): HSEState
    <fe7>   DW_AT_decl_file   : 8
    <fe8>   DW_AT_decl_line   : 54
    <fe9>   DW_AT_decl_column : 12
    <fea>   DW_AT_type        : <0xa36>
    <fee>   DW_AT_data_member_location: 4
 <2><fef>: Abbrev Number: 2 (DW_TAG_member)
    <ff0>   DW_AT_name        : (indirect string, offset: 0xc195e): LSEState
    <ff4>   DW_AT_decl_file   : 8
    <ff5>   DW_AT_decl_line   : 57
    <ff6>   DW_AT_decl_column : 12
    <ff7>   DW_AT_type        : <0xa36>
    <ffb>   DW_AT_data_member_location: 8
 <2><ffc>: Abbrev Number: 2 (DW_TAG_member)
    <ffd>   DW_AT_name        : (indirect string, offset: 0xc0764): HSIState
    <1001>   DW_AT_decl_file   : 8
    <1002>   DW_AT_decl_line   : 60
    <1003>   DW_AT_decl_column : 12
    <1004>   DW_AT_type        : <0xa36>
    <1008>   DW_AT_data_member_location: 12
 <2><1009>: Abbrev Number: 2 (DW_TAG_member)
    <100a>   DW_AT_name        : (indirect string, offset: 0xc2881): HSICalibrationValue
    <100e>   DW_AT_decl_file   : 8
    <100f>   DW_AT_decl_line   : 63
    <1010>   DW_AT_decl_column : 12
    <1011>   DW_AT_type        : <0xa36>
    <1015>   DW_AT_data_member_location: 16
 <2><1016>: Abbrev Number: 2 (DW_TAG_member)
    <1017>   DW_AT_name        : (indirect string, offset: 0xc0069): LSIState
    <101b>   DW_AT_decl_file   : 8
    <101c>   DW_AT_decl_line   : 66
    <101d>   DW_AT_decl_column : 12
    <101e>   DW_AT_type        : <0xa36>
    <1022>   DW_AT_data_member_location: 20
 <2><1023>: Abbrev Number: 16 (DW_TAG_member)
    <1024>   DW_AT_name        : PLL
    <1028>   DW_AT_decl_file   : 8
    <1029>   DW_AT_decl_line   : 69
    <102a>   DW_AT_decl_column : 22
    <102b>   DW_AT_type        : <0xfc1>
    <102f>   DW_AT_data_member_location: 24
 <2><1030>: Abbrev Number: 0
 <1><1031>: Abbrev Number: 6 (DW_TAG_typedef)
    <1032>   DW_AT_name        : (indirect string, offset: 0xc0e76): RCC_OscInitTypeDef
    <1036>   DW_AT_decl_file   : 8
    <1037>   DW_AT_decl_line   : 70
    <1038>   DW_AT_decl_column : 3
    <1039>   DW_AT_type        : <0xfcd>
 <1><103d>: Abbrev Number: 21 (DW_TAG_structure_type)
    <103e>   DW_AT_byte_size   : 20
    <103f>   DW_AT_decl_file   : 8
    <1040>   DW_AT_decl_line   : 75
    <1041>   DW_AT_decl_column : 9
    <1041>   DW_AT_sibling     : <0x1087>
 <2><1045>: Abbrev Number: 2 (DW_TAG_member)
    <1046>   DW_AT_name        : (indirect string, offset: 0xbfc87): ClockType
    <104a>   DW_AT_decl_file   : 8
    <104b>   DW_AT_decl_line   : 77
    <104c>   DW_AT_decl_column : 12
    <104d>   DW_AT_type        : <0xa36>
    <1051>   DW_AT_data_member_location: 0
 <2><1052>: Abbrev Number: 2 (DW_TAG_member)
    <1053>   DW_AT_name        : (indirect string, offset: 0xc15de): SYSCLKSource
    <1057>   DW_AT_decl_file   : 8
    <1058>   DW_AT_decl_line   : 80
    <1059>   DW_AT_decl_column : 12
    <105a>   DW_AT_type        : <0xa36>
    <105e>   DW_AT_data_member_location: 4
 <2><105f>: Abbrev Number: 2 (DW_TAG_member)
    <1060>   DW_AT_name        : (indirect string, offset: 0xc24c3): AHBCLKDivider
    <1064>   DW_AT_decl_file   : 8
    <1065>   DW_AT_decl_line   : 83
    <1066>   DW_AT_decl_column : 12
    <1067>   DW_AT_type        : <0xa36>
    <106b>   DW_AT_data_member_location: 8
 <2><106c>: Abbrev Number: 2 (DW_TAG_member)
    <106d>   DW_AT_name        : (indirect string, offset: 0xbeac2): APB1CLKDivider
    <1071>   DW_AT_decl_file   : 8
    <1072>   DW_AT_decl_line   : 86
    <1073>   DW_AT_decl_column : 12
    <1074>   DW_AT_type        : <0xa36>
    <1078>   DW_AT_data_member_location: 12
 <2><1079>: Abbrev Number: 2 (DW_TAG_member)
    <107a>   DW_AT_name        : (indirect string, offset: 0xc0836): APB2CLKDivider
    <107e>   DW_AT_decl_file   : 8
    <107f>   DW_AT_decl_line   : 89
    <1080>   DW_AT_decl_column : 12
    <1081>   DW_AT_type        : <0xa36>
    <1085>   DW_AT_data_member_location: 16
 <2><1086>: Abbrev Number: 0
 <1><1087>: Abbrev Number: 6 (DW_TAG_typedef)
    <1088>   DW_AT_name        : (indirect string, offset: 0xc1e7f): RCC_ClkInitTypeDef
    <108c>   DW_AT_decl_file   : 8
    <108d>   DW_AT_decl_line   : 92
    <108e>   DW_AT_decl_column : 3
    <108f>   DW_AT_type        : <0x103d>
 <1><1093>: Abbrev Number: 21 (DW_TAG_structure_type)
    <1094>   DW_AT_byte_size   : 20
    <1095>   DW_AT_decl_file   : 9
    <1096>   DW_AT_decl_line   : 46
    <1097>   DW_AT_decl_column : 9
    <1097>   DW_AT_sibling     : <0x10dd>
 <2><109b>: Abbrev Number: 16 (DW_TAG_member)
    <109c>   DW_AT_name        : Pin
    <10a0>   DW_AT_decl_file   : 9
    <10a1>   DW_AT_decl_line   : 48
    <10a2>   DW_AT_decl_column : 12
    <10a3>   DW_AT_type        : <0xa36>
    <10a7>   DW_AT_data_member_location: 0
 <2><10a8>: Abbrev Number: 2 (DW_TAG_member)
    <10a9>   DW_AT_name        : (indirect string, offset: 0xc6f0f): Mode
    <10ad>   DW_AT_decl_file   : 9
    <10ae>   DW_AT_decl_line   : 51
    <10af>   DW_AT_decl_column : 12
    <10b0>   DW_AT_type        : <0xa36>
    <10b4>   DW_AT_data_member_location: 4
 <2><10b5>: Abbrev Number: 2 (DW_TAG_member)
    <10b6>   DW_AT_name        : (indirect string, offset: 0xc0c21): Pull
    <10ba>   DW_AT_decl_file   : 9
    <10bb>   DW_AT_decl_line   : 54
    <10bc>   DW_AT_decl_column : 12
    <10bd>   DW_AT_type        : <0xa36>
    <10c1>   DW_AT_data_member_location: 8
 <2><10c2>: Abbrev Number: 2 (DW_TAG_member)
    <10c3>   DW_AT_name        : (indirect string, offset: 0xc14f5): Speed
    <10c7>   DW_AT_decl_file   : 9
    <10c8>   DW_AT_decl_line   : 57
    <10c9>   DW_AT_decl_column : 12
    <10ca>   DW_AT_type        : <0xa36>
    <10ce>   DW_AT_data_member_location: 12
 <2><10cf>: Abbrev Number: 2 (DW_TAG_member)
    <10d0>   DW_AT_name        : (indirect string, offset: 0xc082c): Alternate
    <10d4>   DW_AT_decl_file   : 9
    <10d5>   DW_AT_decl_line   : 60
    <10d6>   DW_AT_decl_column : 12
    <10d7>   DW_AT_type        : <0xa36>
    <10db>   DW_AT_data_member_location: 16
 <2><10dc>: Abbrev Number: 0
 <1><10dd>: Abbrev Number: 6 (DW_TAG_typedef)
    <10de>   DW_AT_name        : (indirect string, offset: 0xc22c8): GPIO_InitTypeDef
    <10e2>   DW_AT_decl_file   : 9
    <10e3>   DW_AT_decl_line   : 62
    <10e4>   DW_AT_decl_column : 2
    <10e5>   DW_AT_type        : <0x1093>
 <1><10e9>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <10ea>   DW_AT_encoding    : 7	(unsigned)
    <10eb>   DW_AT_byte_size   : 1
    <10ec>   DW_AT_type        : <0x9b3>
    <10f0>   DW_AT_decl_file   : 9
    <10f1>   DW_AT_decl_line   : 68
    <10f2>   DW_AT_decl_column : 1
    <10f3>   DW_AT_sibling     : <0x1104>
 <2><10f7>: Abbrev Number: 3 (DW_TAG_enumerator)
    <10f8>   DW_AT_name        : (indirect string, offset: 0xbf47c): GPIO_PIN_RESET
    <10fc>   DW_AT_const_value : 0
 <2><10fd>: Abbrev Number: 3 (DW_TAG_enumerator)
    <10fe>   DW_AT_name        : (indirect string, offset: 0xbf779): GPIO_PIN_SET
    <1102>   DW_AT_const_value : 1
 <2><1103>: Abbrev Number: 0
 <1><1104>: Abbrev Number: 6 (DW_TAG_typedef)
    <1105>   DW_AT_name        : (indirect string, offset: 0xc3263): GPIO_PinState
    <1109>   DW_AT_decl_file   : 9
    <110a>   DW_AT_decl_line   : 71
    <110b>   DW_AT_decl_column : 2
    <110c>   DW_AT_type        : <0x10e9>
 <1><1110>: Abbrev Number: 21 (DW_TAG_structure_type)
    <1111>   DW_AT_byte_size   : 48
    <1112>   DW_AT_decl_file   : 10
    <1113>   DW_AT_decl_line   : 48
    <1114>   DW_AT_decl_column : 9
    <1114>   DW_AT_sibling     : <0x11b5>
 <2><1118>: Abbrev Number: 2 (DW_TAG_member)
    <1119>   DW_AT_name        : (indirect string, offset: 0xc0d51): Channel
    <111d>   DW_AT_decl_file   : 10
    <111e>   DW_AT_decl_line   : 50
    <111f>   DW_AT_decl_column : 12
    <1120>   DW_AT_type        : <0xa36>
    <1124>   DW_AT_data_member_location: 0
 <2><1125>: Abbrev Number: 2 (DW_TAG_member)
    <1126>   DW_AT_name        : (indirect string, offset: 0xc0229): Direction
    <112a>   DW_AT_decl_file   : 10
    <112b>   DW_AT_decl_line   : 53
    <112c>   DW_AT_decl_column : 12
    <112d>   DW_AT_type        : <0xa36>
    <1131>   DW_AT_data_member_location: 4
 <2><1132>: Abbrev Number: 2 (DW_TAG_member)
    <1133>   DW_AT_name        : (indirect string, offset: 0xbedbe): PeriphInc
    <1137>   DW_AT_decl_file   : 10
    <1138>   DW_AT_decl_line   : 57
    <1139>   DW_AT_decl_column : 12
    <113a>   DW_AT_type        : <0xa36>
    <113e>   DW_AT_data_member_location: 8
 <2><113f>: Abbrev Number: 2 (DW_TAG_member)
    <1140>   DW_AT_name        : (indirect string, offset: 0xbf199): MemInc
    <1144>   DW_AT_decl_file   : 10
    <1145>   DW_AT_decl_line   : 60
    <1146>   DW_AT_decl_column : 12
    <1147>   DW_AT_type        : <0xa36>
    <114b>   DW_AT_data_member_location: 12
 <2><114c>: Abbrev Number: 2 (DW_TAG_member)
    <114d>   DW_AT_name        : (indirect string, offset: 0xc0b7f): PeriphDataAlignment
    <1151>   DW_AT_decl_file   : 10
    <1152>   DW_AT_decl_line   : 63
    <1153>   DW_AT_decl_column : 12
    <1154>   DW_AT_type        : <0xa36>
    <1158>   DW_AT_data_member_location: 16
 <2><1159>: Abbrev Number: 2 (DW_TAG_member)
    <115a>   DW_AT_name        : (indirect string, offset: 0xc2c49): MemDataAlignment
    <115e>   DW_AT_decl_file   : 10
    <115f>   DW_AT_decl_line   : 66
    <1160>   DW_AT_decl_column : 12
